{
  "newsItems": [
    {
      "title": "Netanyahu signals openness to Trump's Gaza ceasefire plan: Sources - ABC News",
      "url": "https://abcnews.go.com/International/live-updates/israel-gaza-live-updates-israel-hits-back-nations/?id=125807672&utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.abcnewsfe.com/a/db938b2c-f5e6-48e8-9884-e074b06b3705/un-3-gty-gmh-250926_1758892655160_hpMain_2_16x9.jpg?w=1600",
        "1": "https://i.abcnewsfe.com/a/db938b2c-f5e6-48e8-9884-e074b06b3705/un-3-gty-gmh-250926_1758892655160_hpMain_2_16x9.jpg?w=992",
        "2": "https://i.abcnewsfe.com/a/06999497-43f6-4943-a3b9-49b630e346e7/Gaza-food-DB-250928_1759067308791_hpMain.jpg",
        "3": "https://i.abcnewsfe.com/a/ed9ff2be-e46a-4462-ad9c-191d85a15451/Gaza-tank-DB-250928_1759057694271_hpMain.jpg",
        "4": "https://i.abcnewsfe.com/a/a0dd5913-f8f9-413e-862b-540f5237fcbc/IDF-artillery-DB-250928_1759049020075_hpMain.jpg"
      },
      "content": "# Netanyahu signals openness to Trump's Gaza ceasefire plan: Sources\n\nNetanyahu is scheduled to sit down with Trump at the White House on Monday.\n\nThe Israel Defense Forces is continuing its operation to take control of Gaza City, the largest urban area in the Gaza Strip, despite international outcry over the deteriorated humanitarian situation in the Palestinian territory.\n\nMeanwhile, in protest of Israel's continuation of its military operations in Gaza, several nations including France, the U.K. and Canada recognized Palestinian statehood as leaders gathered in New York last week for meetings at the United Nations General Assembly.\n\nIsraeli Prime Minister Benjamin Netanyahu addressed the leaders on Friday, again saying Israel will not allow an independent Palestinian state to exist.\n\n## Key Headlines\n\n- Sep 28, 2025, 7:20 AM EDTGaza death toll tops 66,000, health ministry says\n\n- Sep 28, 2025, 5:32 AM EDTHamas says no new ceasefire proposals after Trump post\n\n- Sep 27, 2025, 10:56 AM EDT'Intense' negotiations ongoing for a ceasefire in Gaza, Trump says\n\n- Sep 26, 2025, 9:46 AM EDTNetanyahu makes case that Israel's cause is America's, Europe's\n\n## Netanyahu signals openness to Trump's Gaza ceasefire plan: Sources\n\nIsraeli Prime Minister Benjamin Netanyahu and his advisers met for a second time with U.S. special envoy to the Middle East Steve Witkoff on Sunday afternoon to discuss President Donald Trump’s 21-point Gaza ceasefire proposal, two sources familiar with the matter told ABC News.\n\nThe hours-long meeting -- the second in as many days -- comes ahead of Netanyahu’s scheduled sit-down with Trump at the White House on Monday. Netanyahu is in the U.S. after speaking at the UN General Assembly on Friday.\n\nAsked about Trump’s ceasefire plan on Fox News Sunday, Netanyahu said, “We’re working with President Trump’s team,” but added, “It’s not been finalized yet.”\n\nHe also revealed for the first time how seriously he is weighing the proposal, saying, “I hope we can make it a go.”\n\nHamas leaders in Qatar are expected to receive the Trump proposal sometime on Monday.\n\n-ABC News' Jordana Miller\n\n## Trump teases 'something special' for Middle East\n\nAhead of hosting Israeli Prime Minister Benjamin Netanyahu at the White House on Monday, President Donald Trump posted to social media teasing successful negotiations among \"all\" parties in the Middle East -- claiming \"something special\" is on the horizon for \"greatness\" in the region.\n\n\"We have a real chance for GREATNESS IN THE MIDDLE EAST. ALL ARE ON BOARD FOR SOMETHING SPECIAL, FIRST TIME EVER. WE WILL GET IT DONE,\" Trump wrote on social media. It was not immediately clear which countries or leaders Trump was referring to.\n\nThe post comes days after Trump reported \"inspired and productive\" discussions regarding a possible ceasefire deal in the Gaza Strip.\n\n-ABC News' Isabella Murray\n\n## Gaza death toll tops 66,000, health ministry says\n\nThe Hamas-run Gaza Health Ministry said Sunday that 79 people were killed and 379 people injured over the past 24 hours as Israeli forces continued their military operation in the strip.\n\nAmong the dead were two bodies recovered from under rubble, with officials warning that more victims remain trapped in places that rescue crews cannot reach.\n\nThe ministry put the cumulative toll since Israel's campaign began on Oct. 7, 2023, at 66,005 dead and 168,162 wounded.\n\nAt least 13,137 people have been killed and 56,121 have been injured since Israel broke the last ceasefire on March 18, the ministry said.\n\nAmong those killed over the previous 24 hours were six people killed seeking food aid, with another 66 people injured while doing the same. The ministry said the overall toll of what it called \"livelihood seekers\" killed has now reached 2,566, with more than 18,769 wounded.\n\nIn a separate statement, the ministry said that some hospitals and clinics in Gaza City remain partially functional, despite bombardment and severe shortages of medicine and supplies.\n\nThe ministry credited the \"exceptional efforts\" of doctors and staff working under what it called \"extreme danger.\"\n\nThe ministry appealed to the UN and the international community to provide protection for medical facilities and ensure urgent deliveries of essential supplies so they can continue operating.\n\n-ABC News' Samy Zyara and Dada Jovanovic\n\n## Hamas says no new ceasefire proposals after Trump post\n\nHamas released a statement on Sunday denying that it had received \"any new proposals\" for a ceasefire in the Gaza Strip, after U.S. President Donald Trump said that \"intense negotiations were ongoing.\"\n\nTrump said in a social media post on Friday, \"All of the Countries within the Region are involved, Hamas is very much aware of these discussions, and Israel has been informed at all levels, including Prime Minister Bibi Netanyahu.\"\n\nBut Hamas said in its Sunday statement that it had received nothing new from the mediating parties.\n\nHamas said that negotiations \"have been suspended since the failed assassination attempt\" against top Hamas officials in Doha, referring to the Israeli strike in the Qatari capital on Sept. 9.\n\n\"Hamas reiterates its readiness to consider any proposals that may be presented by the mediators with full positivity and responsibility, in a manner that safeguards the national rights of our people,\" the statement said.\n\n-ABC News' Rashid Haddou\n\n- Israel\n\n## Sponsored Content by Taboola\n\n## Mystery drones over Denmark are 'hybrid attack,' defense minister says\n\n- Sep 25, 5:00 PM\n\n## Russia hits Ukraine with 593 drones, 50 missiles as NATO scrambles jets in response\n\n- Sep 28, 3:47 AM\n\n## UN imposes 'snapback' sanctions on Iran over its nuclear program\n\n- Sep 27, 8:10 PM\n\n## Selena Gomez, Benny Blanco are married\n\n- Sep 27, 8:21 PM\n\n## Oregon moves to No. 2 behind Buckeyes in AP poll; Rebels, Sooners join top 5\n\n- Sep 28, 2:01 PM",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Iran sanctions reimposed 10 years after landmark nuclear deal",
      "url": "https://www.bbc.com/news/articles/crme84w3n23o?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/news/1024/branded_news/8223/live/7a3ef040-9c05-11f0-92db-77261a15b9d2.jpg",
        "1": "https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png",
        "2": "https://ichef.bbci.co.uk/news/480/cpsprodpb/6506/live/42926080-9c3e-11f0-b741-177e3e2c2fc7.jpg.webp",
        "3": "https://ichef.bbci.co.uk/news/480/cpsprodpb/f4d8/live/a3145fa0-9c55-11f0-8fff-71b8c6321a0d.jpg.webp",
        "4": "https://ichef.bbci.co.uk/news/480/cpsprodpb/0353/live/8873a830-9b52-11f0-928c-71dbb8619e94.jpg.webp"
      },
      "content": "# Sanctions reimposed on Iran 10 years after landmark nuclear deal\n\nSweeping UN economic and military sanctions have been reimposed on Iran - 10 years after they were lifted in a landmark international deal over its nuclear programme.\n\nThe new measures took effect as the three European partners to the deal - the UK, France and Germany - activated the so-called \"snapback\" mechanism, accusing Iran of \"continued nuclear escalation\" and lack of co-operation.\n\nIran suspended inspections of its nuclear facilities - a legal obligation under the terms of the 2015 deal - after Israel and the US bombed several of its nuclear sites and military bases in June.\n\nIts President Masoud Pezeshkian insisted last week that the country had no intention of developing nuclear weapons.\n\nThe reintroduction of sanctions - which Pezeshkian described as \"unfair, unjust, and illegal\" - is the latest blow to a deal that was heralded as a turning point in Western relations with the long-ostracised Islamist nation when it was first struck.\n\nThe Joint Comprehensive Plan of Action (JCPOA) places limits on Iran's nuclear installations, its stockpiles of enriched uranium, and the amount of research and development it can undertake.\n\nIt aims to allow Iran to develop its nuclear power infrastructure without straying into making nuclear weaponry.\n\nIran stepped up its banned nuclear activity after Donald Trump pulled the US out of the agreement during his first term as president in 2018.\n\nHe has persistently criticised the deal, negotiated under his predecessor Barack Obama, as flawed, vowing to negotiate better terms.\n\nThe US and Israeli bombing of nuclear facilities in June was intended to reverse some of Iran's nuclear progress, as well as punish it for arming regional proxies that have repeatedly attacked Israel.\n\nWhile Trump said these had caused \"monumental damage\", others cast doubt on the extent to which they had hindered Iran's nuclear programme.\n\nIran said the strikes \"fundamentally changed the situation\" and rendered international support for the nuclear deal \"obsolete\".\n\nEuropean allies that remain party to the deal still hope negotiations will yield a cooling of tensions.\n\n\"We urge Iran to refrain from any escalatory action,\" they said in a joint statement, adding: \"The reimposition of UN sanctions is not the end of diplomacy.\"\n\nTalks between the three countries and Iran on the sidelines of the UN General Assembly earlier this week failed to produce a deal which would have delayed the sanctions being reimposed.\n\nThe foreign ministers of the so-called E3 said they had \"no choice\" but to trigger the snapback procedure, as Iran had \"repeatedly breached\" its commitments.\n\nThey cited Iran's failure to \"take the necessary actions to address our concerns, nor to meet our asks on extension, despite extensive dialogue\".\n\nSpecifically, they mentioned Tehran's refusal to co-operate with the UN nuclear watchdog, the International Atomic Energy Agency (IAEA).\n\n\"Iran has not authorised IAEA inspectors to regain access to Iran's nuclear sites, nor has it produced and transmitted to the IAEA a report accounting for its stockpile of high-enriched uranium,\" the statement read.\n\nThe suspension of IAEA inspections began following the US/Israeli bombings, but the agency confirmed on Friday that they had resumed.\n\nIn a statement on Sunday, Iran said it did not recognise the \"illegal\" and \"unjustifiable\" sanctions.\n\nIts foreign ministry warned that \"any action aimed at undermining the rights and interests of its people will face a firm and appropriate response\".\n\nPezeshkian has softened earlier threats of Iran quitting the Non-Proliferation Treaty altogether - but has warned that a return of sanctions would put negotiations in jeopardy.\n\nHe told reporters on Friday that Tehran would need reassurances that its nuclear facilities would not be attacked by Israel in order to normalise its nuclear enrichment programme.\n\nHe also rejected a US demand to hand over all of Iran's stockpile of enriched uranium in return for a three-month exemption from sanctions, saying: \"Why would we put ourselves in such a trap and have a noose around our neck each month?\"\n\nWestern powers and the IAEA say they are not convinced by Iran's insistence that its nuclear programme has purely peaceful purposes.\n\nIsrael welcomed the reinstatement of sanctions as a \"major development in response to Iran's ongoing violations\", saying the international community should use \"every tool\" to prevent Iran becoming a nuclear power.\n\n## Satellite images show construction under way at Iran nuclear sites hit in strikes\n\n## UK, France and Germany move to reimpose UN sanctions on Iran",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Home | Iran International",
      "url": "https://www.iranintl.com/en?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://v2.iranintl.com/images/ii/opengraph-image.webp",
        "1": "https://i.iranintl.com/images/rdk9umy0/production/700f632b349017f3cf8cc1897c7779963205a1a1-800x533.jpg?rect=134,0,533,533&w=600&h=600&q=70&fit=max&auto=format",
        "2": "https://i.iranintl.com/images/rdk9umy0/production/fe98fba8747e94e5772663150a06623c12246549-5000x3333.jpg?w=600&h=400&q=80&fit=crop&auto=format",
        "3": "https://i.iranintl.com/images/rdk9umy0/production/4a2b650b29b6375db4e9902915942488c47f4149-1280x853.jpg?w=600&h=400&q=80&fit=crop&auto=format",
        "4": "https://i.iranintl.com/images/rdk9umy0/production/ea4b930b4395ec9290f92e852e0e85284c0efbd3-1920x1080.png?rect=150,0,1620,1080&w=600&h=400&q=80&fit=crop&auto=format"
      },
      "content": "#### EU reinstates sanctions on Iran’s banks, oil and cargo flights\n\n#### Israel braces for possible Iranian strike after snapback sanctions - Israel Hayom\n\n#### EU reimposes sweeping sanctions on Iran after UN snapback\n\n#### Iran's parliament to review NPT exit and atomic bomb plan\n\n#### Iranian lawmakers call for expelling European envoys and reviewing NPT exit\n\n#### Kayhan urges parliament to revoke NPT ratification but keep signature\n\nThe European Union on Monday reimposed sweeping sanctions on Iran’s nuclear and ballistic programs after the return of United Nations restrictions under the snapback mechanism, reinstating bans on trade, finance, transport and energy first lifted in 2015.\n\nThe reimposition of UN sanctions on Iran, atop the US sanctions President Masoud Pezeshkian had pledged to lift during his election campaign, has disillusioned many of his moderate supporters and prompted hardliners to call for his resignation.\n\n#### Iran threatens to engage in war with US if attacked by Israel again\n\nIran will enter a war with the United States if Israel launches a new attack on the Islamic Republic, a senior Iranian official and former chief commander of the Revolutionary Guard said on Sunday.\n\n#### Israel on high alert as UN snapback sanctions hit Iran - Ynet\n\n#### Israel says not done yet, won't let Iran rebuild its nuclear capabilities\n\nIran executed a man identified as Bahman Choubi-asl on Monday after convicting him of spying for Israel’s Mossad intelligence service, the judiciary’s news outlet Mizan reported, describing him as \"one of the most important spies for Israel in Iran\".\n\nPresident Masoud Pezeshkian’s reference at the UN to Iranian children killed by Israeli strikes triggered a backlash at home, where many asked why he did not also acknowledge the dozens of children slain by Iranian security forces during the 2022 uprising.\n\nThe human rights situation in Iran has worsened sharply since the June attacks by the United States and Israel and the Islamic Republic’s response, according to a new United Nations report to be formally presented in New York on October 30.\n\n#### Iran state TV slammed for censoring Finnish FM's legs during UN meeting\n\nFinnish Foreign Minister Elina Valtonen called Iranian state television’s decision to blur her legs during a broadcast of her UN meeting with Iran’s foreign minister a “sad” reflection of women’s treatment in the country.\n\n#### Iran says US sought uranium handover for 90-day relief in 'humiliating' offer\n\nWestern countries demanded Iran surrender its stocks of highly enriched uranium in exchange for only a few months of relief from UN sanctions, Iranian authorities said on Saturday, calling the offer humiliating.\n\n#### Iran challenge persists despite Trump's triumph call, analyst says\n\n#### Iran caps stablecoin purchases and holdings as rial hits record low\n\nIran has imposed new limits on stablecoin transactions, capping annual purchases at $5,000 per person and total holdings at $10,000, authorities announced on Saturday, as the rial plunged to a record low on the eve of the return of UN sanctions.\n\n#### Economists sound crisis alarm as Iran braces for sanctions amid downturn\n\n#### Iran’s intelligence mocked by allies and foes over 'secret' Israel files\n\nA documentary released by Iran’s Intelligence Ministry claiming infiltration into Israel has drawn ridicule from both opposition groups and hardline loyalists of the Islamic Republic who criticized it for relying on public images and exaggerating its claims.\n\n#### Guards-linked media admits Iran used online photos in Israel intelligence film\n\n#### Larijani backs Lebanon’s ‘resistance’ in Beirut visit\n\nIran’s top security official, Ali Larijani, traveled to Beirut on Saturday to attend memorial ceremonies for the slain Hezbollah leader Hassan Nasrallah, announcing his support for Lebanon’s role as a frontline of resistance against Israel.\n\n#### Three Iranians plead not guilty over alleged plot against journalists in UK\n\nThree Iranian men accused of working with Tehran’s intelligence services to target UK-based journalists pleaded not guilty during a preparatory hearing at the Central Criminal Court in London on Friday.\n\n#### ‘Why bother going?’ Tehran’s moderates knock Pezeshkian's UN trip\n\nPresident Masoud Pezeshkian’s speech at the United Nations drew an unusual split in Tehran: while conservatives and hardliners rallied behind him, many of his moderate supporters voiced sharp disappointment.\n\n#### No breakthrough in New York: Tehran split sharpens as UN sanctions near\n\n#### Khamenei comes up short in rhetorical duel with Trump\n\nSeven years after Donald Trump quit the nuclear deal, his duel with Ali Khamenei looks lopsided: the US president spoke from New York with renewed leverage, while Iran’s leader replied in taped defiance that evinced more strain than authority.\n\n#### History repeating itself? Khamenei risks another 'poison chalice' moment\n\n- Maryam Sinaiee\n\nMaryam Sinaiee\n\n- Behrouz Turani\n\nBehrouz Turani\n\n- Negar Mojtahedi\n\nNegar Mojtahedi\n\n- Ata Mohamed Tabriz\n\nAta Mohamed Tabriz\n\n- Dalga Khatinoglu\n\nDalga Khatinoglu\n\n#### Iran’s intelligence mocked by allies and foes over 'secret' Israel files\n\n#### Coupons and concerts: Tehran scrambles for quick fixes as sanctions loom\n\n#### Condom sales in Iran surged during Israel war, online retailer says\n\n#### Temporary marriage in Iran: religiously sanctioned, socially taboo\n\n#### Moderates and hardliners enlist Khamenei in fight over diplomacy\n\n#### Accountability for Iran hangs on UN mission’s future\n\n#### Women break taboos in Iran viral concerts: propaganda or progress?\n\nViral videos of women dancing unveiled in Iranian concerts have reignited debate over whether the apparent social opening is genuine or contrived by a ruling system facing external military pressure and domestic discontent.\n\n#### Nuclear crisis looms as Iran faces sanctions snapback, expert warns\n\n#### Unite to overthrow Iran 'demon of tyranny', Nobel laureate Ebadi urges\n\n#### Israel now calls the shots on Iran as US steps back, ex-negotiator says\n\n#### Islamic Republic 'flailing' as challenges mount, ex-US official says\n\n#### Iran’s water crisis is real but man-made, climatologist argues\n\nLife in Iran feels suspended, with many convinced war will return and unable to plan for the future beyond how to endure it when it comes.\n\nIran is awash in voices claiming to speak for its people: state loyalists, opposition figures and self-styled experts of every stripe drowning out the non-extreme yet critical voices with their din.\n\n#### United States\n\n#### Iran Nuclear\n\n#### Military\n\n#### Society\n\n#### Human Rights\n\n#### Iran Sanctions\n\n#### Mideast Crisis\n\n#### Economy & Environment\n\n#### Iran Protests\n\n#### Diplomacy\n\n#### Domestic Politics\n\n#### Iran Insights",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Russia will give ‘decisive response’ if provoked by West, says Lavrov | Russia-Ukraine war News | Al Jazeera",
      "url": "https://www.aljazeera.com/news/2025/9/27/russia-will-give-decisive-response-if-provoked-by-the-west-says-lavrov?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.aljazeera.com/wp-content/uploads/2025/09/afp_68d827234bce-1758996259_43e452-1759019188.jpg?resize=1200%2C630&quality=80"
      },
      "content": "Russia will give ‘decisive response’ if provoked by West, says Lavrov | Russia-Ukraine war News | Al Jazeera\n\nplay videoplay videoVideo Duration 06 minutes 01 seconds play-arrow06:01Lavrov framing NATO as the aggressor: Analysis\n\nPublished On 27 Sep 202527 Sep 2025Click here to share on social mediashare2SharefacebooktwitterwhatsappcopylinkSave\n\nRussian Minister of Foreign Affairs Sergey Lavrov has [warned NATO](https://www.aljazeera.com/news/2025/9/25/is-russia-testing-nato-with-aerial-incursions-in-europe) and the European Union that “any aggression against my country will be met with a decisive response”.\n\nSpeaking at the United Nations General Assembly (UNGA) in New York on Saturday, Lavrov insisted that Moscow had no plans to attack the West, but that it was prepared to act if provoked.\n\n## Recommended Stories\n\nlist of 3 items\n\n- list 1 of 3[Moldova bans pro-Russian parties ahead of Sunday’s election](https://www.aljazeera.com/news/2025/9/26/moldova-bans-pro-russian-parties-ahead-of-sundays-election) - list 2 of 3[Russia-Ukraine war: List of key events, day 1,311](https://www.aljazeera.com/news/2025/9/27/russia-ukraine-war-list-of-key-events-day-1311) - list 3 of 3[Denmark reports new drone sightings overnight at military sites](https://www.aljazeera.com/news/2025/9/27/denmark-reports-new-drone-sightings-overnight-at-military-sites)\n\nend of list\n\nHis comments came as Ukrainian President Volodymyr Zelenskyy blamed Russia for recent drone and plane [incursions in Europe](https://www.aljazeera.com/news/2025/9/24/russia-accused-of-trying-to-intimidate-europe-with-threats-beyond-ukraine).\n\n“Russia is testing their ability to defend themselves and trying to influence societies so people begin to ask: ‘If we can’t protect ourselves, why should we keep supporting Ukraine?’. This is intended to reduce assistance to Ukraine, especially ahead of winter,” he wrote on X.\n\nMoscow continues to deny violating Polish airspace with drones, and Estonian airspace with fighter jets, this month. It also says it played no role in the rogue drones spotted near airports in Denmark this week, which forced several airports to shut temporarily.\n\n## ‘Some hopes’ for US-brokered peace\n\nIn his UN speech, Lavrov hit out at accusations from the West, blaming it for scaremongering about the possibility of a “third world war”.\n\n“Russia is being accused of almost planning to attack NATO and EU countries. President [Vladimir] Putin has repeatedly debunked these provocations,” he said.\n\nBut Lavrov also insisted that his country still had “some hopes” for ceasefire talks with the United States over Moscow’s war in Ukraine, just days after US President Donald Trump appeared to align himself more closely with Kyiv by saying it could recapture all of the Ukrainian territory seized by Russia.\n\nAdvertisement\n\nTrump’s comments, which were made after he met Zelenskyy on the sidelines of the UNGA, marked a significant change in tone. Previously, the US president had said that Kyiv needed to make concessions, arguing that it would never reclaim occupied territory seized by Russia since 2014.\n\nDespite Trump’s statement on Tuesday, Lavrov still expressed a belief in the role of the US as a potential mediator.\n\n“We have some hopes for the continuation of the Russian-American dialogue, especially after the summit in Alaska,” he told delegates at the UN headquarters on Saturday.\n\nThe Russian foreign minister suggested that the Trump administration wanted to “realistically resolve the Ukrainian crisis”.\n\n“Russia and the US bear a special responsibility for the state of affairs in the world and for avoiding risks that could plunge humanity into a new war,” he added.\n\n## More villages taken in Donetsk and Dnipropetrovsk regions\n\nLavrov’s appearance at the UN followed claims by Russia on Saturday that it had captured three more villages in eastern Ukraine.\n\nThe Russian army said in a statement that it had taken the villages of Derylove and Maiske in the Donetsk region, and the settlement of Stepove in the Dnipropetrovsk region.\n\nMeanwhile, Ukraine said it had launched a successful drone attack against an oil pumping facility in Russia’s Chuvashia region.\n\n“The SBU [Ukrainian security service] continues to impose sanctions on the Russian oil sector, which brings the aggressor country excess profits that go to the war against Ukraine,” a Ukrainian official told Reuters.\n\nAn overnight Russian barrage killed one person and wounded 12 in Ukraine’s southeastern Kherson region, and damaged railways in the neighbouring Odesa region, according to the Ukrainian authorities.\n\nAs Kyiv attempts to improve its air defences to stop Russian missile and drone attacks, Zelenskyy said on Saturday that a Ukrainian delegation would head to the US for weapons talks in late September or early October.\n\nUkraine’s president added that his country had received a US-made Patriot air defence system from Israel a month ago, with two more expected to arrive later this year.\n\nOn Saturday, both Russia and Ukraine blamed each other for a four-day blackout at the Russian-occupied Zaporizhzhia nuclear plant. Although outages are common, it is the longest so far in the war.\n\nThe plant’s six reactors have been off since Moscow seized it shortly after its full-scale invasion in February 2022. However, the facility still needs power to keep its cooling and safety systems operating to prevent its reactors from melting.",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "World News, Global and International Stories | National Post",
      "url": "https://nationalpost.com/category/news/world/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://dcs-static.gprod.postmedia.digital/19.6.0/websites/images/np/ogimage-np.png",
        "1": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2025/04/Trump-Netanyahu-1.jpg?quality=90&strip=all&w=116&sig=kMHGIJtW3EDL4tUGUknU_Q",
        "2": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2025/09/church-shooting-michigan_298989721.jpg?quality=90&strip=all&w=116&sig=CE-WufyS82JeBcgQ1YvXog",
        "3": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2025/09/aptopix-israel-palestinians-gaza_298965501.jpg?quality=90&strip=all&w=116&sig=yHj3IK99iVaHmcSKUtb3Gw",
        "4": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2025/09/president-trump-departs-white-house-for-new-york-e1759070232353.jpg?quality=90&strip=all&w=116&sig=V3_ohPEKfxWyFUfwtALWfw"
      },
      "content": "# World News, Global and International Stories | National Post\n\n## New York City mayor Eric Adams abandons bid for re-election\n\nOutgoing mayor said campaign was hampered by legal problems and a lack of money\n\n### Trump's 21-point peace plan includes hostage exchange, Gaza Strip reconstruction\n\n### Gunman drove truck into Michigan Mormon church and opened fire: police\n\n### Free all remaining hostages or 'Gaza will be destroyed': Israeli defence minister\n\n### Trump and congressional leaders to meet as government shutdown deadline looms\n\n## Latest News Videos\n\n## Israel & Middle East\n\n- Netanyahu slams the west for recognizing Palestinian state The message to Hamas, Netanyahu said, was that 'murdering Jews pays off' 2 days ago Israel & Middle East You can save this article by registering for free here. Or sign-in if you have an account.\n\n### Netanyahu slams the west for recognizing Palestinian state\n\nThe message to Hamas, Netanyahu said, was that 'murdering Jews pays off'\n\nYou can save this article by registering for free here. Or sign-in if you have an account.\n\n- Dua Lipa denies firing agent over pro-Israel views The Daily Mail reported that Lipa had parted ways with her European agent, David Levy, for signing a leaked letter to Glastonbury founder, urging him to drop rap group Kneecap 3 days ago Israel & Middle East You can save this article by registering for free here. Or sign-in if you have an account.\n\n### Dua Lipa denies firing agent over pro-Israel views\n\nThe Daily Mail reported that Lipa had parted ways with her European agent, David Levy, for signing a leaked letter to Glastonbury founder, urging him to drop rap group Kneecap\n\n- Litigating 'genocide': Israeli think tank finds no evidence The researchers say they found no credible proof that Israeli policy-directed attacks aimed to kill civilians 6 days ago Israel & Middle East You can save this article by registering for free here. Or sign-in if you have an account.\n\n### Litigating 'genocide': Israeli think tank finds no evidence\n\nThe researchers say they found no credible proof that Israeli policy-directed attacks aimed to kill civilians\n\n- Hamas victims' families ask Canadians to oppose recognition of Palestinian state Relatives of the eight Canadians killed by Hamas in Oct. 7, 2023, attacks say none of Prime Minister Mark Carney's conditions have been met, and recognition rewards terror with Video September 21, 2025 News You can save this article by registering for free here. Or sign-in if you have an account.\n\n### Hamas victims' families ask Canadians to oppose recognition of Palestinian state\n\nRelatives of the eight Canadians killed by Hamas in Oct. 7, 2023, attacks say none of Prime Minister Mark Carney's conditions have been met, and recognition rewards terror\n\n- Carney recognizes Palestinian state ahead of UN trip Carney's statement drew immediate backlash from family members of the eight Canadian citizens killed by Hamas terrorists in the Oct. 7 attacks with Video September 21, 2025 Canada You can save this article by registering for free here. Or sign-in if you have an account.\n\n### Carney recognizes Palestinian state ahead of UN trip\n\nCarney's statement drew immediate backlash from family members of the eight Canadian citizens killed by Hamas terrorists in the Oct. 7 attacks\n\n- What Mark Carney is missing, according to this eminence grise insider News\n\n### What Mark Carney is missing, according to this eminence grise insider\n\n- Letters: Our children are pondering where to live — outside Canada NP Comment\n\n### Letters: Our children are pondering where to live — outside Canada\n\n- Canada Post is on strike (again). Here's what it means for your mail News\n\n### Canada Post is on strike (again). Here's what it means for your mail\n\n- Michael Taube: The Liberals just can't leave duck hunters alone NP Comment\n\n### Michael Taube: The Liberals just can't leave duck hunters alone\n\n- Raymond J. de Souza: The Truth and Reconciliation Commission's statist legacy NP Comment\n\n### Raymond J. de Souza: The Truth and Reconciliation Commission's statist legacy\n\n## You've reached the 20 article limit.\n\nYou can manage saved articles in your account.\n\nand save up to 100 articles!\n\n## Looks like you've reached your saved article limit!\n\nYou can manage your saved articles in your account and clicking the X located at the bottom right of the article.",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Current world order ‘reflects a bygone era,’ says Cuban Foreign Minister | UN News",
      "url": "https://news.un.org/en/story/2025/09/1165978?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Libraries/Production%20Library/27-09-2025-UN-Photo-Cuba.jpg/image770x420cropped.jpg"
      },
      "content": "# Current world order ‘reflects a bygone era,’ says Cuban Foreign Minister\n\nFacebook Twitter Print Email\n\n# Current world order ‘reflects a bygone era,’ says Cuban Foreign Minister\n\nBruno Rodríguez Parilla, in his address to the General Assembly on Saturday, said that there can be no effective global response to serious challenges because the current world order \"reflects a bygone era, when most developing countries did not even exist as independent states.\"\n\nMr. Parilla began by expressing solidarity with Palestine and condemning what he described as the “genocidal extermination and ethnic cleansing” of Palestinians by Israel.\n\nHe said that, at a time when “a handful of countries and individuals have amassed more wealth than the vast majority of all other countries combined,” the United Nations continues to be the most representative body of the international community and must be protected and strengthened.\n\nMr. Parilla called for a new international order that guarantees “the right to development, sovereign equality, participation and representation of developing countries in global policy decision.”\n\nHe referred to the Secretary-General’s UN80 reform initiatives which, he said, needs to strengthen the United Nations’ intergovernmental nature, and improve its capacity to better confront the urgent challenges of today.\n\n## Reject ‘peace through strength’\n\nThe international community, he argued, must reject the doctrine of “peace through strength” which is “equivalent to imposing the arbitrary will of US imperialism on everyone,” and would come at the cost of the values upon which the UN was founded.\n\nThe foreign minister also demanded an end to the economic blockade imposed on Cuba by the United States for more than six decades, which he described as \"an economic war\" aimed at depriving Cubans of their livelihoods and sustainability.\n\n“Cuba faces a grave scenario of prolonged and daily blackouts, difficulties in affording food, insufficient availability of medicines, reduced public transport, limited community services and pronounced inflation, which is eroding real incomes.”\n\nMr. Parilla also warned of a looming threat of war in the Caribbean and said that the deployment of US military forces in the region to fight crime and drug trafficking was a pretext and “a dangerous situation that violates international law.”\n\nRegarding climate change, the minister said that, from the podium of the General Assembly, science and \"decades of collective work\" to protect the planet are being questioned.\n\n\"If the unsustainable patterns of production and consumption of capitalism are not fundamentally changed, we will exceed the fateful threshold of 1.5 degrees Celsius before 2030,\" he declared.\n\nReferring to new technologies, Mr. Parilla said that, with a small number of transnational corporations imposing their operation systems and controlling what content is seen, read and heard, \"we suffer from the dictatorship of the algorithm.\"\n\nHe called on the UN to create common standards, in order to ensure that technology, especially artificial intelligence, benefit all.\n\n- UNGA80\n\n- General Assembly\n\n- cuba",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Zelenskyy condemns Russia’s ‘vile and cowardly’ 12-hour bombing of Ukraine | Ukraine | The Guardian",
      "url": "https://www.theguardian.com/world/2025/sep/28/hundreds-of-russian-missiles-and-drones-hit-ukraine-as-poland-scrambles-jets?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/5cfec6f34d25631e45bdc43882c03fee0ada4de0/113_0_5600_4480/master/5600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7b13ad08efddb14aa61a69c5527a3e6a",
        "1": "https://i.guim.co.uk/img/media/5cfec6f34d25631e45bdc43882c03fee0ada4de0/113_0_5600_4480/master/5600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=2c2768afdd0f5aa3ef0d5792ce54b5d4",
        "2": "https://i.guim.co.uk/img/media/5cfec6f34d25631e45bdc43882c03fee0ada4de0/113_0_5600_4480/master/5600.jpg?width=465&dpr=1&s=none&crop=none",
        "3": "https://i.guim.co.uk/img/media/fa45389176e079c65c15aaa5879f8dc4b8ea4ab7/805_0_7991_6394/master/7991.jpg?width=220&dpr=1&s=none&crop=5%3A4",
        "4": "https://i.guim.co.uk/img/media/521275a0d011ebbb8f89415cca298e2f42002620/804_0_5600_4480/master/5600.jpg?width=220&dpr=1&s=none&crop=5%3A4"
      },
      "content": "Destruction caused by a Russian missile during an attack on Kyiv on Sunday. Photograph: Alessio Mamo/The GuardianView image in fullscreenDestruction caused by a Russian missile during an attack on Kyiv on Sunday. Photograph: Alessio Mamo/The Guardian\n\n# Zelenskyy condemns Russia’s ‘vile and cowardly’ 12-hour bombing of Ukraine\n\nMoscow targets Kyiv and other regions with about 600 drones and 40 missiles, killing at least four people\n\nOne of the worst bombardments of Kyiv since the start of Vladimir Putin’s full-scale invasion of Ukraine has killed at least four people in what Volodymyr Zelenskyy described as a “vile and cowardly” attack.Russia launched nearly 600 drones and more than 40 cruise missiles in a bombardment that lasted more than 12 hours over Saturday night and into Sunday morning. The main targets were the Ukrainian capital and the regions of Zaporizhzhia, Khmelnytskyi, Sumy, Mykolaiv, Chernihiv and Odesa.Ukraine’s president noted that the onslaught came at the close of UN general assembly week in New York, during which Donald Trump had expressed support for Kyiv. Zelenskyy called on allies to stop all Russian oil imports and promised his country would “strike back”.Map of regions targeted“This is precisely how Russia shows its true position. Moscow wants to keep fighting and killing and deserves only the harshest pressure in the world,” he wrote on Telegram. “The Kremlin benefits from continuing this war and terror as long as energy revenues flow and the shadow fleet operates.”Earlier, Kyiv echoed with the sound of anti-aircraft fire as waves of drones arrived in a grey dawn sky. Residents scrambled to take cover amid air raid sirens. A missile wiped out most of a street in the Petropavlivska Borshchahivka district, sheering off roofs and blowing out windows.Damage in KyivA falling concrete slab crushed and killed a 12-year-old girl, Oleksandra. Classmates left flowers and toys outside her gutted house. A neighbour, Liudmyla, described her as a happy and active girl who did sport and took English classes. She had just returned from Canada to go back to school in Kyiv. “A wonderful child. It’s such a shock,” Liudmyla said.Other victims included a nurse and a patient who died when Kyiv’s cardiology institute took a direct hit. The body of another person was found under debris, officials said.“There was a huge explosion around 6am. Everything started falling on our heads,” Lolita Isakova, 24, said. “We started to run in panic. There were booms and we couldn’t understand what was happening. My neighbour was covered in blood. He was screaming, looking for his wife and daughter. They were downstairs and OK. An ambulance took him away.” She added: “Russia is a terrorist state. Fuck them.”Mark Serhiyiv, a 35-year-old army chaplain, said it was the second time Moscow had destroyed his home. “I still can’t believe that the children are alive. It’s such a blessing from God. They were right under the roof when it hit them. The roof was torn off right above my eldest son’s bed,” he said.“I’m from Melitopol. They occupied the city and took my property. I moved to Kyiv in 2024. Our Russian neighbour is crazy. They shoot and deliberately kill civilians. This is our reality.”Cleanup in KyivMore than 70 people were injured across the country, including three children whose high-rise apartment building was hit in the southern city of Zaporizhzhia.On Sunday morning in Kyiv firefighters doused a burning car. Rescue workers and a digger shovelled up glass, masonry and twisted rebar.The head of Ukraine’s presidential office, Andriy Yermak, said: “Once again, residential buildings and infrastructure are being hit. Once again, it is a war against civilians.” There will be a response to these actions. But the west’s economic blows against Russia must also be stronger.”Cleanup in KyivThere was widespread international condemnation. The UK defence secretary, John Healey, said the bombardment had brought further death and destruction and showed that Putin was “committed to war”. He said Britain would step up its support for Kyiv in response to Moscow’s “illegal attacks”.Finland’s president, Alexander Stubb, said Russia had again targeted civilians in cold blood. “This brutal attack … lays bare Russia’s false narratives of the war and again shows the world the true face of the aggressor,” he said. He called for additional EU sanctions against Moscow and for pressure to be put on its war machine.Poland’s military said it had scrambled fighter jets and put ground-based air defence systems on high alert in response to the strikes on Ukraine. The moves were preventive and intended to secure Polish airspace and protect citizens, especially in border areas with Ukraine, the military said.EU to move forward with plans for drone wall amid Russian incursionsRead morePoland closed the airspace near its southeastern cities of Lublin and Rzeszów, a key hub for aid to Ukraine, for several hours.Speaking on Saturday in Kyiv after meeting Trump at the UN in New York, Zelenskyy had warned that Russia was preparing for a wider European conflict. “Putin will not wait for the war in Ukraine to end. He will open some other front. No one knows which one. But there is no doubt that he wants it,” he said.He made his remarks after drone sightings in Denmark, Poland and Romania and the violation of Estonian airspace by Russian fighter jets. Denmark’s army said on Sunday that drones had been spotted flying over Danish military sites for the second night running.Zelenskyy suggested EU governments were struggling to deal with this new and dangerous threat. Ukraine spotted 92 drones flying towards Poland in a “choreographed” way earlier this month. It intercepted most of them, but 19 crossed into Polish territory where four were shot down.Russia claimed its strikes on Sunday were against Ukrainian military facilities. Earlier it denied it was responsible for drone incursions and said it had no plans to attack Nato member states. The Russian foreign minister, Sergei Lavrov, told the UN general assembly: “Any aggression against my country will be met with a decisive response.”Speaking to reporters later, Lavrov said that if any country downed objects still within Russian airspace, “they will very much regret it”.\n\nExplore more on these topics\n\n- [Ukraine](https://www.theguardian.com/world/ukraine) - [Russia](https://www.theguardian.com/world/russia) - [Poland](https://www.theguardian.com/world/poland) - [Europe](https://www.theguardian.com/world/europe-news) - [news](https://www.theguardian.com/tone/news)\n\nShareReuse this content\n\nMore on this story\n\n## More on this story\n\n- Safety fears as external power to Zaporizhzhia nuclear plant still out after three days - ‘You have to live’: Ukrainians on frontline practise normality despite Russian bombings - EU to move forward with plans for drone wall amid Russian incursions - Trump’s change in tone is valuable to Ukraine – but more than words are needed - ‘Most destructive arms race in human history’: Zelenskyy appeals at UN for intervention to stop Russia - Trump says he believes Ukraine can regain all land lost to Russia since 2022 invasion - Zelenskyy accuses allies of ‘wasting time’ as he prepares for Trump meeting - Outgoing MI6 chief says Putin has ‘bitten off more than he can chew’ in Ukraine\n\nMost viewed\n\n## Most viewed",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Ukraine-Russia war latest: Trump considers supplying Kyiv long-range ...",
      "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-war-trump-king-putin-nato-latest-news-b2834830.html?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://static.independent.co.uk/2025/07/15/9/42/GettyImages-1258784752.jpeg?trim=650,1152,436,215&width=1200&height=800&crop=1200:800",
        "1": "https://static.independent.co.uk/2025/09/28/14/38/GettyImages-2237537389.jpeg?quality=75&width=230&crop=3%3A2%2Csmart&auto=webp",
        "2": "https://static.independent.co.uk/2025/09/25/5/28/A-light-moves-in-the-sky-over-Aalborg-amid-reports-of-drone-sightings-that-led-to-the-citys-airport.jpeg?quality=75&width=230&crop=3%3A2%2Csmart&auto=webp",
        "3": "https://static.independent.co.uk/2025/09/27/17/Russia_Ukraine_War_76140.jpg?quality=75&width=230&crop=3%3A2%2Csmart&auto=webp",
        "4": "https://static.independent.co.uk/2025/01/08/15/ab37590b17dabf678e1c362e0b7fad00Y29udGVudHNlYXJjaGFwaSwxNzM2NDM2MDYx-2.74385971.jpg?quality=75&width=230&crop=3%3A2%2Csmart&auto=webp"
      },
      "content": "Destruction in Kyiv after deadly Russian attack\n\nDonald [Trump](https://www.independent.co.uk/topic/trump) is considering [Ukraine](https://www.independent.co.uk/topic/ukraine)’s request to obtain long-range Tomahawk missiles in an effort to push back against [Russia](https://www.independent.co.uk/topic/russia), US vice president JD Vance has said.\n\nUkrainian president Volodymyr [Zelensky](https://www.independent.co.uk/topic/zelensky) asked the US to sell Tomahawks to European nations that would send them to Ukraine, Vance said on Fox News on Sunday, adding that Trump would make the “final decision” on the deal.\n\n\"We're certainly looking at a number of requests from the Europeans,\" Vance said.\n\nTrump has long denied Ukraine’s requests for the use of long-range missiles in the past, but has recently grown frustrated with Vladimir Putin’s refusal to reach a peace deal.\n\nTomahawk missiles have a range of 2,500km, which would put Moscow in range of Ukraine’s arsenal. This could be viewed as an escalation in the three-and-a-half year-long war.\n\nThe move comes at a time where more [Nato](https://www.independent.co.uk/topic/nato) nations are raising the alarm over violations in their airspace from Russia, with [Denmark](https://www.independent.co.uk/topic/denmark) ordering a ban on civil drone flights ahead of two European summits this week after unexplained drones were spotted near military sites over the weekend.\n\nThe country’s defence minister Troels Lund Poulsen warned the country was “currently in a difficult security situation”.\n\nRecommended\n\n- [Girl among four killed after Russia hits Ukraine with 600 drones and dozens of missiles in ‘brutal’ 12-hour attack](https://www.independent.co.uk/news/world/europe/ukraine-russia-kyiv-attack-drones-missiles-b2835297.html) - [Denmark lies more than 1,000 miles from Russia – so why would it be the target of a ‘hybrid attack’?](https://www.independent.co.uk/news/world/europe/denmark-russia-drone-airport-closure-aalborg-copenhagen-b2833631.html) - [Ukraine nuclear plant enters fifth day on emergency power as Zelenskyy announces $90B arms deal](https://www.independent.co.uk/news/world/europe/ukraine-kyiv-international-atomic-energy-agency-united-states-greenpeace-b2834998.html) - [Russia and Belarus regain full IPC membership as Paralympic suspension lifted](https://www.independent.co.uk/sport/olympics/paralympics/russia-belarus-paralympics-olympics-ipc-ioc-b2835232.html)\n\n### Recap watch: Destruction in Kyiv over the weekend after deadly Russian attack\n\nDestruction in Kyiv after deadly Russian attack\n\nBryony Gooch29 September 2025 10:19\n\n### Kremlin says Britain and France must be involved in nuclear disarmament talks\n\nTalks on reducing strategic nuclear weapons must first be conducted between Russia and the US, but the arsenals of Britain and France will ultimately have to be included in negotiations, Kremlin spokesman Dmitry Peskov was quoted as saying on Sunday.\n\nPeskov's remarks come amid a Kremlin proposal to the US this month to voluntarily maintain for a year the limits on deployed strategic nuclear weapons set out in their New START arms control treaty once it expires next year if the US does the same.\n\nWhite House press secretary Karoline Leavitt said Putin's proposal sounded \"pretty good,\" but the issue was up to U.S. President Donald Trump. The US president has said he wants to open denuclearisation talks with Russia and China.\n\n\"Naturally, we have to start talks at the bilateral level. New START is after all a bilateral document,\" Peskov told TASS.\n\nKremlin spokesman Dmitry Peskov waits before the talks between Russian President Vladimir Putin and Interim President of the Republic of Mali Assimi Goita at the Grand Kremlin Palace in Moscow (via REUTERS)\n\n\"But in the long term, you cannot remain abstract with these arsenals. All the more so that these arsenals are a component of the overall problem of global European security and strategic stability.\"\n\nNew START was signed by then-presidents Barack Obama and Dmitry Medvedev in 2010, came into force a year later and was extended in 2021 for five more years after U.S. President Joe Biden took office.\n\nIn 2023, Putin suspended Russia's participation, but Moscow said it would continue to observe the warhead limits. Putin this month made his offer to maintain the treaty's limits as Ukraine tries to convince Trump to impose harsher sanctions on Russia over its February 2022 invasion of its smaller neighbour.\n\nRussia and the US have by far the biggest nuclear arsenals in the world. New START caps the number of deployed strategic nuclear warheads at 1,550 and the number of delivery vehicles - missiles, submarines and bomber planes - at 700 on each side.\n\nFrance and Britain, which were never a party to New START or its precursor treaties, have much smaller arsenals numbering between 250 and 300 warheads each.\n\nBryony Gooch29 September 2025 10:01\n\n### Medvedev warns Europe can't afford war against Russia, mentioning weapons of mass destruction\n\nRussia’s security council deputy chairman Dmitry Medvedev has said that Europe could not afford a war against Russia but that if its leaders made the mistake of triggering one then it could escalate into a conflict with weapons of mass destruction.\n\nRussia, Medvedev said in an inflammatory statement on Telegram, does not need such a war, including with \"frigid old Europe\".\n\n\"They simply cannot afford a war with Russia,\" Medvedev said of European powers, adding that \"the possibility of a fatal accident always exists.\"\n\n\"And such a conflict has an absolutely real risk of escalating into a war using weapons of mass destruction,\" he said.\n\nBryony Gooch29 September 2025 09:48\n\n### Watch: Zelensky warns Europe of drone attacks after treacherous Ukraine strikes\n\nZelensky warns Europe of drone attacks after treacherous Ukraine strikes\n\nBryony Gooch29 September 2025 09:25\n\n### EU congratulates Moldova as EU ruling party decisively wins parliamentary election\n\nThe President of the EU Commission, Ursula Von Der Leyen, has congratulated Moldova’s pro-EU ruling party has decisively won a parliamentary election fraught with Russian interference claims.\n\n“Moldova, you’ve done it again”, she said on X. “No attempt to sow fear or division could break your resolve. You made your choice clear: Europe. Democracy. Freedom.\n\n“Our door is open. And we will stand with you every step of the way. The future is yours.”\n\nBryony Gooch29 September 2025 09:20\n\n### Britain might already be at war with Russia, ex-MI5 chief warns\n\n### Britain might already be at war with Russia, ex-MI5 chief warns\n\nBaroness Eliza Manningham-Buller points to rising number of cyberattacks as well as sabotage and covert operations on UK soil\n\nBryony Gooch29 September 2025 09:14\n\n### Moldova’s pro-EU party wins parliamentary election amid Russian interference claims\n\n### Moldova’s pro-EU party wins parliamentary election amid Russian interference claims\n\nMoldova’s pro-Western ruling party has decisively won a parliamentary election, widely seen as a stark East-West choice and marred by Russian interference claims.\n\nBryony Gooch29 September 2025 08:44\n\n### Two killed in drone strike on Moscow region, local governor says\n\nTwo people were killed as a result of a drone attack in Russia's Moscow region overnight, the local governor, Andrei Vorobyov, said in a statement on Telegram.\n\nRussia's air defence units said they destroyed 84 Ukrainian drones overnight, RIA news agency reported on Monday, citing Russian defence ministry data.\n\nBryony Gooch29 September 2025 08:34\n\n### Russia launches 32 drones at Ukraine in overnight attack\n\nUkraine shot down 23 of the 32 drones launched by Russia in an overnight attack, according to the Ukrainian armed forces.\n\nThe strike drones in question were Shahed, Gerbera, and other unmanned aerial vehicles, which came from the Bryansk, Orel, and Primorsko-Akhtarsk directions in Russia.\n\nNine strike drone hits were recorded in eight locations.\n\nBryony Gooch29 September 2025 08:26\n\n### US considering sending long-range Tomahawk missiles to Ukraine\n\nThe United States is considering Ukraine's request to obtain long-range Tomahawk missiles for its effort to push back against Russian invaders, vice president JD Vance said on Sunday.\n\nUkrainian president Volodymyr Zelensky has asked the United States to sell Tomahawks to European nations that would send them to Ukraine. Vance said on Fox News Sunday that US President Donald Trump would make the “final determination” on whether to allow the deal.\n\n“We're certainly looking at a number of requests from the Europeans,\" the vice president said.\n\nBryony Gooch29 September 2025 08:15\n\n[Newer](https://www.independent.co.uk/?page=1)[Older](https://www.independent.co.uk/?page=2)",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Death toll climbs to 40 after stampede at political rally for actor Vijay in southern India | AP News",
      "url": "https://apnews.com/article/india-tamil-nadu-rally-stampede-vijay-5176f836cb6e9277c7570fdd4e9ba060?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://dims.apnews.com/dims4/default/680ff02/2147483647/strip/true/crop/1620x911+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F47%2F003cc0c45b4ea614c5b6cad75f79%2F25fb40dbb6f64d5591568e2242d5b33a"
      },
      "content": "- World SECTIONS Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa TOP STORIES Police: Deadly shooting in North Carolina was 'highly premeditated' and location was 'targeted' Through their eyes: Donald Trump and his actions, as seen by leaders from around the world Death toll climbs to 40 after stampede at political rally for actor Vijay in southern India Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. The Afternoon Wire Get caught up on what you may have missed throughout the day. See All Newsletters\n\n- Police: Deadly shooting in North Carolina was 'highly premeditated' and location was 'targeted'\n\n- Through their eyes: Donald Trump and his actions, as seen by leaders from around the world\n\n- Death toll climbs to 40 after stampede at political rally for actor Vijay in southern India\n\n- U.S. SECTIONS Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths TOP STORIES Gunman opens fire at Michigan church and sets it ablaze, killing at least 4 and wounding 8 New York City Mayor Eric Adams abandons his reelection campaign Things to know about federal law enforcement activity in Chicago, Portland, Memphis Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. See All Newsletters AP QUIZZES Test Your News I.Q. — take today’s quiz\n\n- Gunman opens fire at Michigan church and sets it ablaze, killing at least 4 and wounding 8\n\n- New York City Mayor Eric Adams abandons his reelection campaign\n\n- Things to know about federal law enforcement activity in Chicago, Portland, Memphis\n\n- Politics SECTIONS White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game TOP STORIES Trump's shutdown blame game: Why he says Democrats are at fault Trump will speak at a hastily called meeting of top military leaders, AP source says Shutdown standoff deepens ahead of crucial meeting at the White House Newsletters Ground Game Exclusive insights and key stories from the world of politics. See All Newsletters\n\n- Trump's shutdown blame game: Why he says Democrats are at fault\n\n- Trump will speak at a hastily called meeting of top military leaders, AP source says\n\n- Shutdown standoff deepens ahead of crucial meeting at the White House\n\n- Sports SECTIONS AP Top 25 NFL MLB Ryder Cup WNBA Tennis NBA NHL TOP STORIES LIVE AP Top 25 sees Oregon jump to No. 2, Ole Miss and Oklahoma crack the top 5 Rory McIlroy calls out 'unacceptable and abusive behavior' from Bethpage fans at Ryder Cup Oregon moves to No. 2 behind Buckeyes in AP poll; Rebels, Sooners join top 5 Newsletters AP Top 25 Poll Alerts Get email alerts for every college football Top 25 Poll release. The Sports Wire Your home base for in-depth reporting from the world of sports. See All Newsletters\n\n- LIVE AP Top 25 sees Oregon jump to No. 2, Ole Miss and Oklahoma crack the top 5\n\n- Rory McIlroy calls out 'unacceptable and abusive behavior' from Bethpage fans at Ryder Cup\n\n- Oregon moves to No. 2 behind Buckeyes in AP poll; Rebels, Sooners join top 5\n\n- Entertainment SECTIONS Movies What to Stream Television Celebrity Interviews Music Books TOP STORIES Latin superstar Bad Bunny will headline the 2026 Super Bowl halftime show 'One Battle After Another' opens with $22.4 million Liberatore puts models on emergency escape, drawing attention to global chaos Newsletters AP Entertainment Wire Get AP's first personalized newsletter delivering you entertainment news twice a week. See All Newsletters\n\n- Latin superstar Bad Bunny will headline the 2026 Super Bowl halftime show\n\n- 'One Battle After Another' opens with $22.4 million\n\n- Liberatore puts models on emergency escape, drawing attention to global chaos\n\n- Business SECTIONS Tariffs Inflation Financial Markets Financial Wellness Technology TOP STORIES 58M pounds of corn dogs and sausage-on-a-stick products recalled because wood pieces may be inside How Walmart plans to prepare America's largest private workforce for an AI-driven future Tyla and Liza Koshy help remind the Global Citizen Festival audience of their collective power\n\n- 58M pounds of corn dogs and sausage-on-a-stick products recalled because wood pieces may be inside\n\n- How Walmart plans to prepare America's largest private workforce for an AI-driven future\n\n- Tyla and Liza Koshy help remind the Global Citizen Festival audience of their collective power\n\n- Science SECTIONS Space Animals The Ancient World Climate Medicine TOP STORIES Comentarios de Trump sobre autismo generan ira y esperanza entre personas autistas y sus familias\n\n- Comentarios de Trump sobre autismo generan ira y esperanza entre personas autistas y sus familias\n\n- Fact Check\n\n- Oddities TOP STORIES Ghana's fantasy coffins are a colorful celebration of life and legacy Ground squirrels are taking over a North Dakota city and officials are not amused Photos show Ghana's fantasy coffins as a stylish final rest Whale surfaces, capsizes fishing boat off New Hampshire coast Swastikas still linger on some flags in Finland's air force, but are on the way out Giant trolls have a message for humans about protecting the planet\n\n- Ghana's fantasy coffins are a colorful celebration of life and legacy\n\n- Ground squirrels are taking over a North Dakota city and officials are not amused\n\n- Photos show Ghana's fantasy coffins as a stylish final rest\n\n- Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Swastikas still linger on some flags in Finland's air force, but are on the way out\n\n- Giant trolls have a message for humans about protecting the planet\n\n- Be Well TOP STORIES Some people tape their mouths shut at night. Doctors wish they wouldn't A good shower is a simple shower, no matter what influencers recommend Here’s what dermatologists are saying about your skin care routine: Keep it simple One path to kick-starting a healthier lifestyle: Start small Lice concerns rise as children return to school. Here's what parents can do Why the search for meaning can cause ‘purpose anxiety,’ and what to do about it\n\n- Some people tape their mouths shut at night. Doctors wish they wouldn't\n\n- A good shower is a simple shower, no matter what influencers recommend\n\n- Here’s what dermatologists are saying about your skin care routine: Keep it simple\n\n- One path to kick-starting a healthier lifestyle: Start small\n\n- Lice concerns rise as children return to school. Here's what parents can do\n\n- Why the search for meaning can cause ‘purpose anxiety,’ and what to do about it\n\n- Newsletters\n\n- Photography SECTIONS 2024 YEAR END PHOTOS Photo Essays Photography TOP STORIES 'Why? Why? Why?' Ukraine's Mariupol descends into despair How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss An AP photographer captures a masked protester undeterred by a deluge of pepper spray Newsletters The World in Pictures Get The AP’s most compelling photographs sent directly to your inbox. See All Newsletters\n\n- 'Why? Why? Why?' Ukraine's Mariupol descends into despair\n\n- How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss\n\n- An AP photographer captures a masked protester undeterred by a deluge of pepper spray\n\n- AP Investigations\n\n- Climate SECTIONS Indigenous peoples and climate Climate Questions Climate Migration India Focus TOP STORIES Tropical Storm Imelda forms near Bahamas and is expected to become a hurricane in coming days Vietnam evacuates thousands and shuts airports as Typhoon Bualoi makes landfall Tropical weather in the Atlantic slams the Caribbean and may hit Southeast US next\n\n- Tropical Storm Imelda forms near Bahamas and is expected to become a hurricane in coming days\n\n- Vietnam evacuates thousands and shuts airports as Typhoon Bualoi makes landfall\n\n- Tropical weather in the Atlantic slams the Caribbean and may hit Southeast US next\n\n- Health TOP STORIES Some people tape their mouths shut at night. Doctors wish they wouldn't Trump's comments on autism evoke anger and hope among autistic people and their families Listeria found in Walmart, Trader Joe's meals may be linked to deadly outbreak After massive shrimp recalls, the FDA finds radioactive contamination in spices too A good shower is a simple shower, no matter what influencers recommend 'Nightmare bacteria' cases are increasing in the US\n\n- Some people tape their mouths shut at night. Doctors wish they wouldn't\n\n- Trump's comments on autism evoke anger and hope among autistic people and their families\n\n- Listeria found in Walmart, Trader Joe's meals may be linked to deadly outbreak\n\n- After massive shrimp recalls, the FDA finds radioactive contamination in spices too\n\n- A good shower is a simple shower, no matter what influencers recommend\n\n- 'Nightmare bacteria' cases are increasing in the US\n\n- Tech SECTIONS Artificial Intelligence Social Media TOP STORIES Trump signs executive order supporting proposed deal to put TikTok under US ownership YouTube to start bringing back creators banned for COVID-19 and election misinformation Now that summer's over, here's what to do with all those photos on your camera roll\n\n- Trump signs executive order supporting proposed deal to put TikTok under US ownership\n\n- YouTube to start bringing back creators banned for COVID-19 and election misinformation\n\n- Now that summer's over, here's what to do with all those photos on your camera roll\n\n- Lifestyle SECTIONS Food & Recipes Gardening Homes Travel Fashion Pets TOP STORIES Here’s what dermatologists are saying about your skin care routine: Keep it simple Armani's last collection shown in solemn runway show with Richard Gere, Lauren Hutton in 1st row Pamela Anderson leads the way for women who choose to go makeup free\n\n- Here’s what dermatologists are saying about your skin care routine: Keep it simple\n\n- Armani's last collection shown in solemn runway show with Richard Gere, Lauren Hutton in 1st row\n\n- Pamela Anderson leads the way for women who choose to go makeup free\n\n- Religion TOP STORIES Russell M. Nelson, oldest-ever president of The Church of Jesus Christ of Latter-day Saints, dies A list of notable shooting attacks on houses of worship in the US in the past 20 years Photos show historic Japanese shrine that is torn down and rebuilt every 20 years Newsletters World of Faith Comprehensive global coverage of how religion shapes our world. See All Newsletters\n\n- Russell M. Nelson, oldest-ever president of The Church of Jesus Christ of Latter-day Saints, dies\n\n- A list of notable shooting attacks on houses of worship in the US in the past 20 years\n\n- Photos show historic Japanese shrine that is torn down and rebuilt every 20 years\n\n- Español TOP STORIES Tiroteo e incendio en iglesia mormona de Michigan deja 4 muertos y 8 heridos; abaten al agresor Assata Shakur, una activista estadounidense requerida por EEUU desde 1979, muere en Cuba Surge tormenta tropical Imelda cerca de Bahamas y podría convertirse en huracán en los próximos días Fuerte respaldo de EEUU: Milei elimina impuestos al agro en medio de turbulencias financieras Defensa en el “juicio del siglo” en el Vaticano pide recusación del fiscal por conducta cuestionable Estampida en mitin político del popular actor Vijay deja 40 muertos en la India\n\n- Tiroteo e incendio en iglesia mormona de Michigan deja 4 muertos y 8 heridos; abaten al agresor\n\n- Assata Shakur, una activista estadounidense requerida por EEUU desde 1979, muere en Cuba\n\n- Surge tormenta tropical Imelda cerca de Bahamas y podría convertirse en huracán en los próximos días\n\n- Fuerte respaldo de EEUU: Milei elimina impuestos al agro en medio de turbulencias financieras\n\n- Defensa en el “juicio del siglo” en el Vaticano pide recusación del fiscal por conducta cuestionable\n\n- Estampida en mitin político del popular actor Vijay deja 40 muertos en la India\n\n- Most watched videos\n\n- Standards\n\n- Quizzes\n\n- Press Releases\n\n- My Account\n\n- AP News Code of Conduct\n\n- MORE World Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa Middle East U.S. Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths Politics White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game Sports AP Top 25 NFL MLB Ryder Cup WNBA Tennis Tennis NBA NHL Auto Racing Soccer Entertainment Movies What to Stream Television Celebrity Interviews Music Books Business Tariffs Inflation Financial Markets Financial Wellness Technology Science Space Animals The Ancient World Climate Medicine Fact Check Oddities Be Well Newsletters Photography 2024 YEAR END PHOTOS Photo Essays Photography AP Investigations Climate Indigenous peoples and climate Climate Questions Climate Migration India Focus Health Tech Artificial Intelligence Social Media Lifestyle Food & Recipes Gardening Homes Travel Fashion Pets Religion Español Most watched videos Standards Quizzes Press Releases My Account AP News Code of Conduct\n\n- World Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa Middle East\n\n- Israel-Hamas war\n\n- Russia-Ukraine war\n\n- Español\n\n- China\n\n- Asia Pacific\n\n- Latin America\n\n- Europe\n\n- Africa\n\n- Middle East\n\n- U.S. Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths\n\n- Immigration\n\n- Weather\n\n- Education\n\n- Transportation\n\n- Abortion\n\n- LGBTQ+\n\n- Notable Deaths\n\n- Politics White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game\n\n- White House\n\n- Congress\n\n- U.S. Supreme Court\n\n- 2025 Election Calendar\n\n- The latest AP-NORC polls\n\n- Ground Game\n\n- Sports AP Top 25 NFL MLB Ryder Cup WNBA Tennis Tennis NBA NHL Auto Racing Soccer\n\n- AP Top 25\n\n- NFL\n\n- MLB\n\n- Ryder Cup\n\n- WNBA\n\n- Tennis Tennis\n\n- NBA\n\n- NHL\n\n- Auto Racing\n\n- Soccer\n\n- Entertainment Movies What to Stream Television Celebrity Interviews Music Books\n\n- Movies\n\n- What to Stream\n\n- Television\n\n- Celebrity Interviews\n\n- Music\n\n- Books\n\n- Business Tariffs Inflation Financial Markets Financial Wellness Technology\n\n- Tariffs\n\n- Inflation\n\n- Financial Markets\n\n- Financial Wellness\n\n- Technology\n\n- Science Space Animals The Ancient World Climate Medicine\n\n- Space\n\n- Animals\n\n- The Ancient World\n\n- Climate\n\n- Medicine\n\n- Fact Check\n\n- Oddities\n\n- Be Well\n\n- Newsletters\n\n- Photography 2024 YEAR END PHOTOS Photo Essays Photography\n\n- 2024 YEAR END PHOTOS\n\n- Photo Essays\n\n- Photography\n\n- AP Investigations\n\n- Climate Indigenous peoples and climate Climate Questions Climate Migration India Focus\n\n- Indigenous peoples and climate\n\n- Climate Questions\n\n- Climate Migration\n\n- India Focus\n\n- Health\n\n- Tech Artificial Intelligence Social Media\n\n- Artificial Intelligence\n\n- Social Media\n\n- Lifestyle Food & Recipes Gardening Homes Travel Fashion Pets\n\n- Food & Recipes\n\n- Gardening\n\n- Homes\n\n- Travel\n\n- Fashion\n\n- Pets\n\n- Religion\n\n- Español\n\n- Most watched videos\n\n- Standards\n\n- Quizzes\n\n- Press Releases\n\n- My Account\n\n- AP News Code of Conduct\n\n- World SECTIONS Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa TOP STORIES Police: Deadly shooting in North Carolina was 'highly premeditated' and location was 'targeted' Through their eyes: Donald Trump and his actions, as seen by leaders from around the world Death toll climbs to 40 after stampede at political rally for actor Vijay in southern India Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. The Afternoon Wire Get caught up on what you may have missed throughout the day. See All Newsletters\n\n- Police: Deadly shooting in North Carolina was 'highly premeditated' and location was 'targeted'\n\n- Through their eyes: Donald Trump and his actions, as seen by leaders from around the world\n\n- Death toll climbs to 40 after stampede at political rally for actor Vijay in southern India\n\n- U.S. SECTIONS Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths TOP STORIES Gunman opens fire at Michigan church and sets it ablaze, killing at least 4 and wounding 8 New York City Mayor Eric Adams abandons his reelection campaign Things to know about federal law enforcement activity in Chicago, Portland, Memphis Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. See All Newsletters AP QUIZZES Test Your News I.Q. — take today’s quiz\n\n- Gunman opens fire at Michigan church and sets it ablaze, killing at least 4 and wounding 8\n\n- New York City Mayor Eric Adams abandons his reelection campaign\n\n- Things to know about federal law enforcement activity in Chicago, Portland, Memphis\n\n- Politics SECTIONS White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game TOP STORIES Trump's shutdown blame game: Why he says Democrats are at fault Trump will speak at a hastily called meeting of top military leaders, AP source says Shutdown standoff deepens ahead of crucial meeting at the White House Newsletters Ground Game Exclusive insights and key stories from the world of politics. See All Newsletters\n\n- Trump's shutdown blame game: Why he says Democrats are at fault\n\n- Trump will speak at a hastily called meeting of top military leaders, AP source says\n\n- Shutdown standoff deepens ahead of crucial meeting at the White House\n\n- Sports SECTIONS AP Top 25 NFL MLB Ryder Cup WNBA Tennis NBA NHL TOP STORIES LIVE AP Top 25 sees Oregon jump to No. 2, Ole Miss and Oklahoma crack the top 5 Rory McIlroy calls out 'unacceptable and abusive behavior' from Bethpage fans at Ryder Cup Oregon moves to No. 2 behind Buckeyes in AP poll; Rebels, Sooners join top 5 Newsletters AP Top 25 Poll Alerts Get email alerts for every college football Top 25 Poll release. The Sports Wire Your home base for in-depth reporting from the world of sports. See All Newsletters\n\n- LIVE AP Top 25 sees Oregon jump to No. 2, Ole Miss and Oklahoma crack the top 5\n\n- Rory McIlroy calls out 'unacceptable and abusive behavior' from Bethpage fans at Ryder Cup\n\n- Oregon moves to No. 2 behind Buckeyes in AP poll; Rebels, Sooners join top 5\n\n- Entertainment SECTIONS Movies What to Stream Television Celebrity Interviews Music Books TOP STORIES Latin superstar Bad Bunny will headline the 2026 Super Bowl halftime show 'One Battle After Another' opens with $22.4 million Liberatore puts models on emergency escape, drawing attention to global chaos Newsletters AP Entertainment Wire Get AP's first personalized newsletter delivering you entertainment news twice a week. See All Newsletters\n\n- Latin superstar Bad Bunny will headline the 2026 Super Bowl halftime show\n\n- 'One Battle After Another' opens with $22.4 million\n\n- Liberatore puts models on emergency escape, drawing attention to global chaos\n\n- Business SECTIONS Tariffs Inflation Financial Markets Financial Wellness Technology TOP STORIES 58M pounds of corn dogs and sausage-on-a-stick products recalled because wood pieces may be inside How Walmart plans to prepare America's largest private workforce for an AI-driven future Tyla and Liza Koshy help remind the Global Citizen Festival audience of their collective power\n\n- 58M pounds of corn dogs and sausage-on-a-stick products recalled because wood pieces may be inside\n\n- How Walmart plans to prepare America's largest private workforce for an AI-driven future\n\n- Tyla and Liza Koshy help remind the Global Citizen Festival audience of their collective power\n\n- Science SECTIONS Space Animals The Ancient World Climate Medicine TOP STORIES Comentarios de Trump sobre autismo generan ira y esperanza entre personas autistas y sus familias\n\n- Comentarios de Trump sobre autismo generan ira y esperanza entre personas autistas y sus familias\n\n- Fact Check\n\n- Oddities TOP STORIES Ghana's fantasy coffins are a colorful celebration of life and legacy Ground squirrels are taking over a North Dakota city and officials are not amused Photos show Ghana's fantasy coffins as a stylish final rest Whale surfaces, capsizes fishing boat off New Hampshire coast Swastikas still linger on some flags in Finland's air force, but are on the way out Giant trolls have a message for humans about protecting the planet\n\n- Ghana's fantasy coffins are a colorful celebration of life and legacy\n\n- Ground squirrels are taking over a North Dakota city and officials are not amused\n\n- Photos show Ghana's fantasy coffins as a stylish final rest\n\n- Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Swastikas still linger on some flags in Finland's air force, but are on the way out\n\n- Giant trolls have a message for humans about protecting the planet\n\n- Be Well TOP STORIES Some people tape their mouths shut at night. Doctors wish they wouldn't A good shower is a simple shower, no matter what influencers recommend Here’s what dermatologists are saying about your skin care routine: Keep it simple One path to kick-starting a healthier lifestyle: Start small Lice concerns rise as children return to school. Here's what parents can do Why the search for meaning can cause ‘purpose anxiety,’ and what to do about it\n\n- Some people tape their mouths shut at night. Doctors wish they wouldn't\n\n- A good shower is a simple shower, no matter what influencers recommend\n\n- Here’s what dermatologists are saying about your skin care routine: Keep it simple\n\n- One path to kick-starting a healthier lifestyle: Start small\n\n- Lice concerns rise as children return to school. Here's what parents can do\n\n- Why the search for meaning can cause ‘purpose anxiety,’ and what to do about it\n\n- Newsletters\n\n- Photography SECTIONS 2024 YEAR END PHOTOS Photo Essays Photography TOP STORIES 'Why? Why? Why?' Ukraine's Mariupol descends into despair How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss An AP photographer captures a masked protester undeterred by a deluge of pepper spray Newsletters The World in Pictures Get The AP’s most compelling photographs sent directly to your inbox. See All Newsletters\n\n- 'Why? Why? Why?' Ukraine's Mariupol descends into despair\n\n- How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss\n\n- An AP photographer captures a masked protester undeterred by a deluge of pepper spray\n\n- AP Investigations\n\n- Climate SECTIONS Indigenous peoples and climate Climate Questions Climate Migration India Focus TOP STORIES Tropical Storm Imelda forms near Bahamas and is expected to become a hurricane in coming days Vietnam evacuates thousands and shuts airports as Typhoon Bualoi makes landfall Tropical weather in the Atlantic slams the Caribbean and may hit Southeast US next\n\n- Tropical Storm Imelda forms near Bahamas and is expected to become a hurricane in coming days\n\n- Vietnam evacuates thousands and shuts airports as Typhoon Bualoi makes landfall\n\n- Tropical weather in the Atlantic slams the Caribbean and may hit Southeast US next\n\n- Health TOP STORIES Some people tape their mouths shut at night. Doctors wish they wouldn't Trump's comments on autism evoke anger and hope among autistic people and their families Listeria found in Walmart, Trader Joe's meals may be linked to deadly outbreak After massive shrimp recalls, the FDA finds radioactive contamination in spices too A good shower is a simple shower, no matter what influencers recommend 'Nightmare bacteria' cases are increasing in the US\n\n- Some people tape their mouths shut at night.",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Iranians fear more economic pain, war as UN sanctions snapback | Israel-Iran conflict News | Al Jazeera",
      "url": "https://www.aljazeera.com/news/2025/9/28/iranians-fear-more-economic-pain-war-as-un-sanctions-snapback?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.aljazeera.com/wp-content/uploads/2025/09/2025-09-27T082203Z_208577980_RC280HAD6UAM_RTRMADP_3_IRAN-NUCLEAR-1759043876.jpg?resize=1920%2C1440",
        "1": "https://www.aljazeera.com/wp-content/uploads/2025/09/2025-09-27T082203Z_208577980_RC280HAD6UAM_RTRMADP_3_IRAN-NUCLEAR-1759043876.jpg?resize=770%2C513&quality=80",
        "2": "https://www.aljazeera.com/wp-content/uploads/2019/05/83990b95560343dd90352efbb62bb090_6.jpeg?resize=96%2C96&quality=80"
      },
      "content": "Iranians fear more economic pain, war as UN sanctions snapback | Israel-Iran conflict News | Al Jazeera\n\nIranian people walk at the Tehran Bazaar, September 27, 2025 [Majid Asgaripour/WANA via Reuters]\n\nBy Maziar MotamediPublished On 28 Sep 202528 Sep 2025Click here to share on social mediashare2SharefacebooktwitterwhatsappcopylinkSave\n\n**Tehran, Iran –** After about a decade, Iran is once more subject to United Nations sanctions as the West piles pressure on Tehran, despite opposition from Russia and China.\n\nThe sanctions were automatically reinstated at midnight GMT on Sunday after the European signatories of Iran’s 2015 nuclear deal invoked the “snapback” mechanism of the landmark accord to reactivate them.\n\n## Recommended Stories\n\nlist of 3 items\n\n- list 1 of 3[Iran recalls envoys to UK, France, Germany as UN sanctions reimposed](https://www.aljazeera.com/news/2025/9/27/iran-recalls-envoys-to-uk-france-germany-as-un-sanctions-reimposed) - list 2 of 3[As delegates walk out, Netanyahu tells UN Israel must ‘finish job’ in Gaza](https://www.aljazeera.com/news/2025/9/26/netanyahu-tells-un-that-israel-must-finish-job-in-gaza) - list 3 of 3[Iran and Russia sign $25bn nuclear plant deal](https://www.aljazeera.com/news/2025/9/26/iran-and-russia-sign-25bn-nuclear-plant-deal)\n\nend of list\n\nThey include an arms embargo, asset freezes and travel bans, and nuclear, missile and banking sanctions that are expected to impact all sectors of the beleaguered Iranian economy, as most of over 90 million people pay the price over the coming months.\n\nThe sanctions are binding for all member states, to be enforced using nonmilitary measures.\n\nIran’s turbulent regional situation has some fearing more military strikes by Israel and the United States, who perpetrated [12 days of attacks on the country in June](https://www.aljazeera.com/news/2025/7/6/iran-demands-accountability-for-israel-and-us-after-war-of-aggression) that killed more than 1,000 people and caused billions of dollars in damage.\n\nSome Iranians are concerned that Israel would use the sanctions an excuse to attack again, as it used the [resolution issued by the global nuclear watchdog](https://www.aljazeera.com/news/2025/6/12/un-nuclear-watchdog-says-iran-non-compliant-of-nuclear-safeguards) in June as a pretext for a war that was cheered by Israeli officials and the public alike.\n\n## Nervous markets, worried people\n\nOn Sunday, market reactions showed economic anxiety over Iran’s increasing isolation due to the sanctions.\n\nThe Iranian rial traded at nearly 1.13 million per US dollar in Tehran’s open currency market on the second day of the working week, but activity was very limited amid fluctuations.\n\nAdvertisement\n\nThis marked an all-time low for the rial, which has dropped from 1.06 million per dollar when European powers triggered the snapback process a month ago.\n\n“Things are not looking stable at all,” said Rouzbeh, a 35-year-old who works at the Grand Bazaar of Tehran, selling electric motors imported from China and other countries.\n\n“Just like with the past few years, when the dollar has been going up, imported goods will get more expensive and scarce,” he told Al Jazeera.\n\n“Some people here close off all sales for a few days until there’s some price stability. Others take advantage of the situation and hike prices. When prices go up, sales go down because people’s purchasing power is not going up.”\n\nHardliners in Tehran seemed happy with the renewed UN sanctions, likely because it means the demise of a nuclear accord that they vehemently opposed for a decade as allegedly amounting to “pure loss”.\n\nSaeed Jalili, ultraconservative member of Iran’s Supreme National Security Council and longtime [failed presidential candidate](https://www.aljazeera.com/news/2024/7/3/who-is-competing-to-become-irans-president-in-the-run-off-election), posted online a video of a speech made last week to condemn the nuclear deal and engagement with the West.\n\n“Today we must neutralise the enemy’s excessive demands and prevent his further threats,” he said, without elaborating how.\n\nThe Iranian judiciary said in a statement released on Saturday that it is monitoring online activity around news of snapback and warned media outlets it will take action against them if they commit any violations. It said a number of unnamed websites and Telegram channels have had cases opened against them after they “disturbed the psychological security of the society” by publishing “provocative content about price increases”.\n\nIranian newspapers on Sunday reflected people’s concerns, with reformist Shargh daily mourning the “death” of the nuclear deal and Donya-e-Eqtesad, the country’s largest economic daily, pointing out that [inflation is at its highest point](https://www.aljazeera.com/news/2025/3/11/irans-coupons-and-taxes-giving-with-one-hand-taking-with-the-other) in 28 months at more than 40 percent.\n\nKayhan, whose editor-in-chief is appointed by Supreme Leader Ayatollah Ali Khamenei, tried to downplay the situation, claiming that “economic growth was positive without negotiations, negative with negotiations”.\n\nKhamenei last week ruled out any talks with the US.\n\n## Who abused the snapback mechanism?\n\nThe snapback process was part of the nuclear deal, known as the Joint Comprehensive Plan of Action (JCPOA), set up to punish Iran if it reneged on strict limits set to ensure the peacefulness of its nuclear programme in exchange for the lifting of sanctions.\n\nAdvertisement\n\nIran, China and Russia argue that the West has abused the mechanism – set to expire on October 18 – since it was US President Donald Trump who withdrew from JCPOA in 2018 and imposed unilateral sanctions while Iran remained committed.\n\nTehran started gradually abandoning the curbs only a year after that, but maintains that it will never seek a bomb.\n\nAfter [numerous tit-for-tat measures](https://www.aljazeera.com/news/2021/4/11/incident-at-iranian-nuclear-site-targeted-by-blast-last-year) over the years, Iran’s enrichment of uranium was up to 60 percent – but it had not attempted to build a bomb – as claimed by Israel and the US in their pretext for the attack.\n\nThe fate of its high-enriched uranium and the exact damage to its underground nuclear facilities remain unclear since the International Atomic Energy Agency (IAEA) was denied access to most sites after the war.\n\n## Trying to avert the crisis\n\nPerceiving the Islamic Republic to be at its weakest in decades and fuming over its alleged supply of explosive drones to Russia for the Ukraine war, the US and its three European allies – France, Germany and the United Kingdom, also known as the E3 – have applied pressure while rejecting Iranian proposals for an interim understanding.\n\nRepeated calls and a [last-ditch UN Security Council vote](https://www.aljazeera.com/news/2025/9/26/u-n-security-council-rejects-last-ditch-effort-to-delay-iran-sanctions) put forward by China and Russia on Friday to defer snapback were rejected as well.\n\nWhile Israel was attacking Iran in June, German Chancellor Friedrich Merz went as far as saying Israel was “doing the dirty work” for the West by attacking Iran.\n\nAraghchi, whom the West accused at one point of not being an authoritative representative of Iran, said on Sunday that the West “buried” diplomacy and chose bullying.\n\n“Terminated sanctions cannot be revived,” he insisted on X, adding that Iran considers the UNSC resolution underpinning the nuclear deal as expiring in October, as previously planned.\n\nChina and Russia appeared to be on the same page, the three countries stressing last month that the move lacked a legal basis.\n\nMoscow delivered strong rhetoric on Friday, telling the UNSC meeting in New York that any attempts to resuscitate the sanctions are “null and void”, even threatening that it will “seriously reconsider our relations” with the UN Secretariat.\n\nOn Thursday, Russia and Iran [signed a memorandum of understanding](https://www.aljazeera.com/news/2025/9/26/iran-and-russia-sign-25bn-nuclear-plant-deal) worth $25bn to build several nuclear power reactors in Iran.\n\nChina has remained the largest buyer of Iranian oil over the years despite US sanctions, enjoying hefty discounts from an isolated Iran.\n\nIt remains to be seen whether the two world powers, or any other of Iran’s limited allies, will risk exposing themselves to secondary UN sanctions by significantly dealing with Iran.\n\n## ‘US policy, delegated to Israel’\n\nAli Akbar Dareini, a researcher for the Tehran-based Center for Strategic Studies, said the Europeans and the US “showed utmost animosity” and “slaughtered” the nuclear Non-Proliferation Treaty (NPT).\n\n“The US has delegated its Iran policy to Israel since Trump has taken office,” he told Al Jazeera.\n\n“The US in the past refused to be drawn into a war with Iran, but Christian evangelists and Zionists, including the US ambassador to Israel, have been instrumental in convincing Trump to join the Israeli war of aggression against Iran,” Akbar Dareini said.\n\nAdvertisement\n\nHe said Iran will be working to circumvent sanctions as it has for years, but also has other options, like putting an end to IAEA monitoring of Iran’s nuclear facilities, leaving the NPT, or stopping implementation of all NPT commitments without formally withdrawing.\n\n“America’s top priority is to focus on and contain China. Before doing that, the US needs to bring the Middle East into a new regional order with Israel at the top. The big obstacle is Iran, so they are trying to weaken and destabilise Iran to achieve their goal.”",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Trump news at a glance: Trump orders deployment of national guard to ‘war ravaged’ Portland | Trump administration | The Guardian",
      "url": "https://www.theguardian.com/us-news/2025/sep/28/trump-administration-news-updates-today?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/aad2f66553a277d987e11c51f1bdc8522f90e8f3/1188_7_2646_2118/master/2646.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=73c2006bcda75d14ecc55543676df9f2",
        "1": "https://i.guim.co.uk/img/media/aad2f66553a277d987e11c51f1bdc8522f90e8f3/1188_7_2646_2118/master/2646.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=8507018c9f1257f006640b916218ca1b",
        "2": "https://i.guim.co.uk/img/media/aad2f66553a277d987e11c51f1bdc8522f90e8f3/175_0_4545_3638/master/4545.jpg?width=465&dpr=1&s=none&crop=none"
      },
      "content": "Democratic Oregon governor Tina Kotek speaks at a news conference in Portland on Saturday 27 September after Republican president Donald Trump said he would send troops to the city. Photograph: Claire Rush/APView image in fullscreenDemocratic Oregon governor Tina Kotek speaks at a news conference in Portland on Saturday 27 September after Republican president Donald Trump said he would send troops to the city. Photograph: Claire Rush/AP\n\nExplainer\n\n# Trump news at a glance: Trump orders deployment of national guard to ‘war ravaged’ Portland\n\nOfficials in Portland have pushed back against the announcement, saying there is ‘no need for military troops’ – key US politics stories from Saturday 27 September\n\nDonald Trump has ordered the deployment of the national guard to Portland, Oregon, authorizing “full force, if necessary”, ignoring calls from local and state officials who say the president has been misinformed about the scale of a protest outside a federal immigration office.\n\nThe president says that he has directed all necessary troops to be deployed to protect “war ravaged Portland”, claiming that immigration facilities were “under siege from attack by Antifa and other domestic terrorists”.\n\nOfficials in Portland have pushed back against the decision and rejected the president’s characterization.\n\n“There is no insurrection. There is no threat to national security and there is no need for military troops in our major city,” said Oregon’s Democratic governor, Tina Kotek.\n\nHere are the key stories at a glance.\n\n## Donald Trump says he is deploying troops to Portland, Oregon\n\nDonald Trump made the announcement on social media, where he claimed that the deployment was necessary “to protect war ravaged [Portland](https://www.theguardian.com/us-news/portland),” and Immigration and Customs Enforcement (Ice) facilities he said were “under siege by antifascists and other domestic terrorists”.\n\nOregon’s governor, Tina Kotek, rejected the president’s characterization. “In my conversations directly with President Trump and secretary [of homeland security, Kristi] Noem, I have been abundantly clear that Portland and the state of [Oregon](https://www.theguardian.com/us-news/oregon) believe in the rule of law and can manage our own local public safety needs,” Kotek said at a news conference in Portland on Saturday.\n\n[Read the full story](https://www.theguardian.com/us-news/2025/sep/27/portland-oregon-us-military-trump)\n\n## Portland residents scoff at Trump threat to send military: ‘This is not a war zone’\n\nA visit to downtown Portland on Saturday, hours after Donald Trump falsely declared the city “war ravaged” to justify the deployment of federal troops, made it plain the US president’s impression of the city, apparently shaped by [misleading conservative media reports](https://www.theguardian.com/us-news/2025/sep/05/trump-portland-video-protests), is entirely divorced from reality.\n\nThere were just four protesters outside the Immigration and Customs Enforcement (Ice) field office in an outlying residential neighborhood that the president had claimed was “under siege” by antifascists and “other domestic terrorists”.\n\n[Read the full story](https://www.theguardian.com/us-news/2025/sep/27/portland-oregon-trump-national-guard)\n\n## Trump fires US attorney who told border agents to follow law on immigration raids\n\nDonald Trump fired a top federal prosecutor in Sacramento just hours after she warned immigration agents they could not indiscriminately detain people in her district, according to documents [reviewed by the New York Times](https://www.nytimes.com/2025/09/26/us/trump-fires-us-attorney-california-immigration.html).\n\nMichele Beckwith, who became the acting US attorney in Sacramento in January, received an email at 4.31pm on 15 July notifying her that the president had ordered her termination.\n\n[Read the full story](https://www.theguardian.com/us-news/2025/sep/26/trump-fires-prosecutor-sacramento)\n\n## ‘Hell on earth’: immigrants held in new California detention facility beg for help\n\nImmigrants locked up in California’s newest federal detention center have described the facility as a “a torture chamber”, “a zoo” and “hell on earth”, saying they were confined in filthy cells and suffered medical crises without help.\n\nSix people detained at the California City detention center, which opened in late August and is now the state’s largest Immigration and Customs Enforcement (Ice) detention center, shared accounts with the Guardian of poor conditions and alleged mistreatment by staff.\n\n[Read the full story](https://www.theguardian.com/us-news/2025/sep/27/immigrants-california-detention-facility)\n\n## US military brass brace for firings as Pentagon chief orders top-level meeting\n\n[US military](https://www.theguardian.com/us-news/us-military) officials are reportedly bracing for possible firings or demotions after the [Trump administration](https://www.theguardian.com/us-news/trump-administration)’s Pentagon chief, [Pete Hegseth](https://www.theguardian.com/us-news/pete-hegseth), abruptly summoned hundreds of generals and admirals from around the world to attend a gathering in Virginia in the upcoming days.\n\nThe event, scheduled for [Tuesday at Marine Corps University in Quantico](https://www.nytimes.com/2025/09/26/us/politics/hegseth-military-summit.html), is expected to feature a short address by Hegseth focused on military standards and the “warrior ethos”, according to the [Washington Post](https://www.washingtonpost.com/national-security/2025/09/26/hegseth-generals-meeting-warrior-speech/).\n\n[Read the full story](https://www.theguardian.com/us-news/2025/sep/27/us-military-leaders-meeting-pete-hegseth)\n\n## FBI arrest man who allegedly threatened to shoot people at Texas Pride parade\n\nFederal authorities in Texas have arrested a man for allegedly threatening to shoot people at a pro-LGBTQ+ parade, to avenge the murder of [Charlie Kirk](https://www.theguardian.com/us-news/charlie-kirk-shooting).\n\nAccording to court documents viewed by the Guardian, on 18 September, the FBI’s field office in Dallas was notified by Abilene, [Texas](https://www.theguardian.com/us-news/texas), police about online threats from a local resident.\n\n[Read the full story](https://www.theguardian.com/us-news/2025/sep/27/fbi-arrest-man-texas-pride-parade)\n\n## What else happened today:\n\n- Northwestern University students blocked from enrolment after refusing controversial antisemitism training. - ‘Free speech for me, not for thee’: how Trump’s censorship blitz is splitting the right. - Trump is flaunting his corruption. Is it changing what the US thinks of scandal? The Guardian’s David Smith on Trump’s brazen approach to the presidency.\n\nCatching up?*Here’s what happened 26 September 2025.*\n\nExplore more on these topics\n\n- [Trump administration](https://www.theguardian.com/us-news/trump-administration) - [Trump administration briefing](https://www.theguardian.com/us-news/series/trump-administration-briefing) - [Donald Trump](https://www.theguardian.com/us-news/donaldtrump) - [US politics](https://www.theguardian.com/us-news/us-politics) - [explainers](https://www.theguardian.com/tone/explainers)\n\nShareReuse this content\n\nMost viewed\n\n## Most viewed",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Fact check: Israeli Prime Minister Netanyahu’s speech at the UNGA | United Nations News | Al Jazeera",
      "url": "https://www.aljazeera.com/news/2025/9/27/fact-check-israeli-prime-minister-netanyahus-speech-at-unga?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.aljazeera.com/wp-content/uploads/2025/09/2025-09-26T131247Z_1007864458_RC2PZGAE5Y8F_RTRMADP_3_UN-ASSEMBLY-1758893020.jpg?resize=1920%2C1440",
        "1": "https://www.aljazeera.com/wp-content/uploads/2019/05/83990b95560343dd90352efbb62bb090_6.jpeg?resize=96%2C96&quality=80"
      },
      "content": "Fact check: Israeli Prime Minister Netanyahu’s speech at the UNGA | United Nations News | Al Jazeera\n\nIsraeli Prime Minister Benjamin Netanyahu addresses the 80th United Nations General Assembly headquarters in New York City, United States [File: Jeenah Moon/Reuters]\n\nBy Maziar MotamediPublished On 27 Sep 202527 Sep 2025Click here to share on social mediashare2SharefacebooktwitterwhatsappcopylinkSave\n\nIsraeli Prime Minister Benjamin Netanyahu addressed the United Nations General Assembly, signalling he saw no end in sight for the war on Gaza, despite international condemnation.\n\nNetanyahu also dismissed a UN commission’s findings that Israel has committed genocide in Gaza, saying the forced displacement of civilians undermined the assessment.\n\n## Recommended Stories\n\nlist of 3 items\n\n- list 1 of 3[Iran “still willing to talk” to US but Trump wants isolation or war](https://www.aljazeera.com/video/quotable/2025/9/27/iran-still-willing-to-talk-to-us-but-trump-wants-isolation-or-war) - list 2 of 3[Iraq resumes Kurdish oil exports to Turkiye after two-and-a-half-year halt](https://www.aljazeera.com/news/2025/9/27/iraq-resumes-kurdish-oil-exports-to-turkiye-after-two-and-a-half-year-halt) - list 3 of 3[Palestinian statehood: Recognition amidst erasure?](https://www.aljazeera.com/video/the-listening-post/2025/9/27/palestinian-statehood-recognition-amidst-erasure)\n\nend of list\n\nHere’s a rundown of some of his key claims, fact checked.\n\n## Netanyahu’s claims on Gaza\n\n#### Claim: If Hamas agrees to Israel’s demands, the war could end “right now”.\n\nFact check*:* Israel, with full political and military support from the United States, has blocked numerous efforts to reach a ceasefire in Gaza.\n\nNetanyahu and his government have been repeatedly blasted by the families of captives held in Gaza, along with thousands of Israelis, who protested to call for an end to the war and the return of all captives.\n\nOn March 18, Israel torpedoed a ceasefire deal it had made with Hamas by killing more than 400 Palestinians and starting a months-long total blockade that led to famine in the enclave.\n\nEarlier this month, Israel claimed it had agreed to a ceasefire proposal again, only to immediately bomb Qatar in a failed effort to wipe out the entire political leadership of Hamas outside Gaza, and kill any hope of negotiations.\n\n#### Claim: Israel is taking great pains to minimise civilian casualties in Gaza.\n\nFact check: Contrary to Netanyahu’s statement that the ratio of non-combatant to combatant casualties in Gaza is “less than two to one”, an investigation in August revealed a classified Israeli database that clearly showed [83 percent of the people Israel was killing in Gaza were civilians](https://www.aljazeera.com/news/2025/8/21/israeli-data-shows-83-percent-of-gaza-war-dead-are-civilians-report).\n\nAdvertisement\n\nThe investigation by +972 magazine, Local Call and The Guardian showed that of the list of 8,900 names of Hamas fighters killed in the database, several were listed as “probably” killed, meaning the percentage of civilians killed may be even higher.\n\n#### Claim: Hamas is endangering civilians in Gaza by forcing people to act as its human shields.\n\nFact check: Netanyahu’s claim that “Hamas implants itself in mosques, schools, hospitals, apartment buildings and tries to force these civilians not to leave, to stay in harm’s way”, repeated a justification Israel has often used to bomb places where civilians shelter.\n\nThis includes hospitals, schools, ambulances, mosques, water facilities, power stations and other infrastructure required to sustain life.\n\nMeanwhile, it has offered no evidence of an effort by Hamas and other fighters to use civilian facilities as so-called “military command and control centres”.\n\n#### Claim: A country committing genocide would not plead with civilians to get out of the way of its bombs.\n\nNetanyahu claims that issuing forced evacuation orders, which give families very little time to pack up their entire lives and flee or risk being killed, negates multilateral evidence-based findings that genocide is being committed in Gaza.\n\nThe International Court of Justice, an independent international UN commission of inquiry, the International Association of Genocide Scholars, a large number of international human rights groups, including Israeli group B’Tselem and Amnesty International, and several countries have found that Israel has been committing genocidal acts in Gaza.\n\nThe UN and a slew of international organisations and doctors working on the ground in Gaza have testified that Israel has also been systematically blocking aid while creating a highly unsafe and desperate environment in which aid is regularly looted.\n\n#### Claim: Israel is not blocking aid from entering Gaza; it is Hamas that is stealing the aid from Palestinians.\n\nFact check: Several reports have found that Hamas is not stealing the meagre aid that is allowed into Gaza. [One report was by Israel’s own army](https://www.aljazeera.com/news/2025/7/26/israel-says-its-distributing-aid-in-gaza-so-why-are-people-starving), another by the US’s foreign aid agency, USAID.\n\nIsrael has imposed full blockades of all aid entering the Strip at various times, most recently between March and May this year.\n\nIn May, it announced its support for the so-called Gaza Humanitarian Foundation as an aid distributor, with only four locations for the two million people in the entire Gaza Strip.\n\nThe GHF relies on armed guards and Israeli soldiers to “secure” its premises, and [more than 1,000 people have been killed](https://www.aljazeera.com/news/2025/7/31/inside-israels-role-in-the-killings-at-gazas-food-aid-sites) there as they tried to secure food aid for their starving families.\n\nAdvertisement\n\nOn the other hand, Netanyahu has [admitted openly that his government is supporting a Palestinian militia](https://www.aljazeera.com/news/2025/6/5/netanyahu-admits-israel-backed-armed-rivals-of-hamas-in-gaza) in Gaza that is widely reported to be looting aid trucks.\n\n## Netanyahu’s claims on the region\n\n#### Claim: Iran is rapidly developing a massive nuclear weapons programme and a massive ballistic missile programme that were meant to destroy Israel, threaten the US and blackmail nations.\n\nFact check*:* Iran has always said its nuclear programme, which it has had for more than two decades, is for civilian purposes and that it is not seeking a nuclear weapon.\n\nIran does not currently possess a nuclear weapon and the International Atomic Energy Agency [say](https://www.aljazeera.com/video/talk-to-al-jazeera/2025/6/19/iaea-chief-no-evidence-iran-is-building-a-nuclear-weapon) they have [not found](https://www.aljazeera.com/news/2025/6/25/why-iran-conflict-has-raised-new-questions-about-iaeas-credibility) evidence of nuclear weapons production – though they have [raised](https://www.aljazeera.com/news/2025/6/12/un-nuclear-watchdog-says-iran-non-compliant-of-nuclear-safeguards) concerns about their uranium enrichment efforts.\n\nThis is unlike the 90 or more nuclear warheads that Israel is believed to possess, according to multiple sources, including the United Kingdom parliament. The[House of Commons Library](https://commonslibrary.parliament.uk/research-briefings/cbp-9075/)says Israel is also thought to still be producing plutonium for weapons purposes and could even have a triad for delivery of its weapons (by land, sea and air).\n\nWestern belief in the 2000s that Tehran wanted to build a bomb culminated in UN sanctions, which were lifted through the 2015 nuclear deal, which heavily restricted Iran’s enrichment capacity.\n\nTrump unilaterally left the deal in 2018, prompting Iran to gradually ramp up its nuclear enrichment, which is now at up to 60 percent, a closer technical step from the more than 90 percent required for a bomb, but it maintains it will never build a weapon of mass destruction.\n\n#### Claim: Israel has killed Iran’s top military commanders and its top nuclear scientists\n\nFact check*:* Israel has succeeded in assassinating dozens of top military commanders and nuclear scientists across Iran, but Iranian authorities have said that eliminating individuals will not stop it from achieving its goals.\n\nThey also said some of the country’s air defences remain intact, while others have been repaired or replaced. Iran has also threatened to launch more retaliatory strikes if Israel attacks it.\n\n#### Claim: Israel has killed half of the leadership of the Houthis, Hamas, and Hezbollah, destroyed former Syrian leader Bashar al-Assad’s armaments in Syria and deterred Shia militias in Iraq.\n\nFact check*:* The Israeli military has attacked Yemen repeatedly, including its single-largest strikes on the capital, Sanaa, on Thursday, allegedly targeting the headquarters of the Houthi General Staff, and killing the Houthi prime minister last month, along with other cabinet ministers and leaders.\n\nBut it does not appear to have wiped out Houthi military command, which continues to launch drone and missile strikes on Israel in opposition to the war on Palestinians in Gaza and the occupied West Bank.\n\nIsrael has assassinated much of the top political and military leadership of Hezbollah, including longtime secretary-general Hassan Nasrallah, but the Lebanese group remains defiant, vowing to continue fighting against Israel.\n\nAdvertisement\n\nIsrael has killed senior political leaders of Hamas inside and outside Gaza, including Yahya Sinwar and Ismail Haniyeh. Hamas, although weakened, continues to launch attacks against invading Israeli ground forces in Gaza and is recruiting more fighters.\n\nIn Syria, after the fall of the 50-year Assad dynasty, Israel continued to attack Syria’s military assets and infrastructure, destroying much of it. Israel also continues to militarily occupy the Golan Heights and large parts of Syria south of the capital, Damascus, arguing it is necessary for its security.",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Carney defends trips abroad, says visits further agenda on trade, investment - The Globe and Mail",
      "url": "https://www.theglobeandmail.com/world/article-carney-london-international-trips-world-leaders/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.theglobeandmail.com/resizer/v2/TH4ZVIXQ3VFATG4BISXN4NV52Y.jpg?auth=5fe3eefe9bd2d4e534f93c109934abef30959c5afa1c66e8f8d42fd338a1ed9f&width=1200&height=800&quality=80&smart=true",
        "1": "https://www.theglobeandmail.com/resizer/v2/TH4ZVIXQ3VFATG4BISXN4NV52Y.jpg?auth=5fe3eefe9bd2d4e534f93c109934abef30959c5afa1c66e8f8d42fd338a1ed9f&width=560&quality=80",
        "2": "https://www.theglobeandmail.com/resizer/v2/5F67PPZJZJFUHOYCOXSLI6XUQU.JPG?auth=63a796714807aa26edb531163497a6ad2d4b62d8a370950ece2d578261b85a24&width=600&quality=80",
        "3": "https://www.theglobeandmail.com/resizer/v2/TH4ZVIXQ3VFATG4BISXN4NV52Y.jpg?auth=5fe3eefe9bd2d4e534f93c109934abef30959c5afa1c66e8f8d42fd338a1ed9f&width=600&quality=80",
        "4": "https://www.theglobeandmail.com/resizer/v2/C7V6ZFZI3ZGABC6ZWCWUILREIQ.JPG?auth=116320efaa79a1b8ff74f3b36062ca78c3013d16419cf625e26ba0d655ad03b1&width=300&height=200&quality=80&smart=true"
      },
      "content": "Open this photo in gallery:\n\nPrime Minister Mark Carney holds a press conference at Canada House in London on Saturday.Sean Kilpatrick/The Canadian Press\n\nShareSave for laterPlease log in to bookmark this story.Log InCreate Free Account\n\nPrime Minister [Mark Carney](https://www.theglobeandmail.com/topics/mark-carney/) has defended his international travel schedule, saying meeting world leaders is important to furthering the government’s agenda on trade, security and investment.\n\nMr. Carney was in London Friday and Saturday, his fifth trip to Europe since being sworn in as Prime Minister last March. He has also made two trips to the U.S., and [he visited Mexico earlier this month](https://www.theglobeandmail.com/politics/article-carney-mexico-visit-trade-ties/).\n\n“It’s not just you sign a nice agreement and then something happens,” Mr. Carney told reporters on Saturday during a press conference at the High Commission in London. “No, you actually have to do the work, to meet with the leaders to make sure the work’s being done. You have to mark progress as it’s being done, which is what we’re doing with the various European leaders.”\n\nWhile in London on this trip, Mr. Carney met British Prime Minister [Keir Starmer](https://www.theglobeandmail.com/topics/keir-starmer/) and attended the Global Progress Action Summit, a gathering of centre-left policy makers and leaders from several countries. He also held meetings with investment professionals and had one-on-one discussions at the summit with the prime ministers of Australia, Iceland and Spain.\n\n[Carney, Starmer and other leaders discuss far-right threat at London conference](https://www.theglobeandmail.com/world/article-carney-starmer-global-progress-action-summit-trump/)\n\nThe trips have faced criticism from Conservative Leader [Pierre Poilievre](https://www.theglobeandmail.com/topics/pierre-poilievre/) who called the recent visit to London part of an “[illusion tour](https://x.com/PierrePoilievre/status/1971616901513003421?ref_src=twsrc%5Etfw).”\n\nIn a post this week on X, Mr. Poilievre wrote that the Prime Minister “gets nothing for Canada in his costly trip to the UK. British blockade of Canadian beef remains in place and no new trade deal. These trips are nothing but Liberal showbusiness to distract from spiralling debt, costs, crime, immigration and job loss.”\n\n> So Carney gets nothing for Canada in his costly trip to the UK. British blockade of Canadian beef remains in place and no new trade deal. These trips are nothing but Liberal showbusiness to distract from spiralling debt, costs, crime, immigration and job loss. We need a Prime…— Pierre Poilievre (@PierrePoilievre) September 26, 2025\n\nOn Saturday, Mr. Carney said that in recent weeks he had strengthened Canada’s ties with Mexico, reached a trade deal with Indonesia, and furthered work on Canada’s trade relationship with Britain.\n\nHe has argued that the trips have been necessary to shore up Canada’s international relations and broaden the country’s trade ties beyond the U.S., in the face of U.S. President [Donald Trump](https://www.theglobeandmail.com/topics/donald-trump/)’s global trade war.\n\n“It’s one thing to have the strategy. It’s another thing to have these deepening trade relationships,” he said.\n\n[Trump’s latest tariffs hit new group of Canadian industries, but details are hazy](https://www.theglobeandmail.com/business/economy/article-trump-tariffs-pharmaceuticals-trucks-cabinets-furniture/)\n\nMr. Carney and Mr. Starmer also discussed the [war in Gaza](https://www.theglobeandmail.com/topics/israel-hamas-war/) and the “coalition of the willing,” a group of countries that have committed to serving a role in guaranteeing Ukraine’s security once a peace deal is reached with Russia.\n\nOn Saturday, Mr. Carney said he welcomed Mr. Trump’s [apparent change of heart on Ukraine](https://www.theglobeandmail.com/world/article-trump-zelensky-ukraine-russia-war/) and his comments that Kyiv could win back all of the territory captured by Russia.\n\n“We very much welcome President Trump’s position as we have welcomed his engagement from the start in his conflict,” Mr. Carney said. He added that Canada “will do our bit” but that “ultimately, some form of U.S. backstop to any security guarantee of Ukraine that is provided by the coalition of the willing will be necessary.”\n\nOpen this photo in gallery:\n\nPrime Minister Mark Carney and wife Diana Fox Carney arrive at 10 Downing St. in London on Friday.Sean Kilpatrick/The Canadian Press\n\nMr. Carney also defended the recent moves by Canada, Britain, France Australia and other countries to [recognize a Palestinian state](https://www.theglobeandmail.com/politics/article-carney-defends-recognizing-palestinian-state-despite-trump-threat/). He said the long-time policy of Canada and many other nations was to back a two-state solution, Palestine alongside Israel, something that has been rejected by Israeli Prime Minister Benjamin Netanyahu.\n\n“It’s been the position of every Canadian government since 1947 to support a two-state solution consistent with the principles of the United Nations on self-determination. Further, there will never be a durable peace for Israel unless those rights of self-determination are respected for the Palestinian people,” Mr. Carney said. “And so a Palestinian state that is free and viable, living in peace and security side by side with the State of Israel.”\n\nHe also said that a peace plan for Gaza is taking shape, led by the U.S., Egypt, Jordan and the Gulf states. “I don’t want to overstate it, but there is a coming together of a number of very influential countries, ourselves included, in a way that is increasing the possibility of success,” he said.\n\nMr. Carney’s final stop in London on Saturday will be to attend the [final of the Women’s Rugby World Cup](https://www.theglobeandmail.com/sports/article-womens-rugby-world-cup-final-2025-canada-vs-england-beginners-guide/) in Twickenham, south of London, and watch Canada take on England. The game is being played before 82,000 fans in a sold-out Allianz Stadium, making it the largest crowd ever to watch a women’s rugby match. England is ranked No. 1 in the world, and Canada is world No. 2.\n\n“I’m very excited about the game,” Mr. Carney said. “This is an event for the ages.”",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Watch euronews TV Live - Television live broadcast",
      "url": "https://www.euronews.com/live?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://static.euronews.com/website/images/euronews-og-image-1200x675.png",
        "1": "https://images.euronews.com/articles/stories/09/48/73/42/189x106_cmsv2_f8d21868-dd91-52da-8508-cc06f2884fbb-9487342.jpg",
        "2": "https://images.euronews.com/articles/stories/08/05/41/68/189x106_cmsv2_90a5720d-4134-55a7-9f41-ce149022ebf5-8054168.jpg",
        "3": "https://images.euronews.com/articles/stories/09/48/74/45/189x106_cmsv2_d04e9967-f04c-50bc-96df-4eb3526b28a2-9487445.jpg",
        "4": "https://images.euronews.com/articles/stories/09/48/74/52/189x106_cmsv2_0cc1b652-0e5f-5aec-8295-aa42e4a8166b-9487452.jpg"
      },
      "content": "- [Music](https://www.euronews.com/tag/music) - [European Union](https://www.euronews.com/tag/european-union) - [Drones](https://www.euronews.com/tag/drones) - [NATO](https://www.euronews.com/tag/nato) - [War in Ukraine](https://www.euronews.com/tag/war-in-ukraine) - [Greens](https://www.euronews.com/tag/greens)\n\nWatch Euronews TV Live\n\nDenmark\n\n### Denmark bans all drone flights ahead of European Summit in Copenhagen\n\nCulture news\n\n### Culture Digest: The best things to do, hear, see or watch in Europe this week\n\nTech News\n\n### How NATO and allies seek to train defence tech companies on the battlefield\n\nTop News Stories Today\n\n### Latest news bulletin | September 29th, 2025 – Morning\n\nMoldova\n\n### Moldova's pro-EU party wins high-stakes parliamentary election\n\nUSA\n\n### Gunman kills four and injures eight in shooting at Michigan church",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Zelensky condemns 'vile' Russian strikes lasting 12 hours",
      "url": "https://www.bbc.com/news/articles/c75qeqr5905o?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/news/1024/branded_news/7e0c/live/0796d830-9c48-11f0-b741-177e3e2c2fc7.jpg",
        "1": "https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png",
        "2": "https://ichef.bbci.co.uk/news/480/cpsprodpb/67be/live/c6722380-9c49-11f0-82b3-31d97f4e1ffa.jpg.webp",
        "3": "https://ichef.bbci.co.uk/news/480/cpsprodpb/ba90/live/433566b0-963d-11f0-9ed9-693309fd1b9f.jpg.webp",
        "4": "https://ichef.bbci.co.uk/news/480/cpsprodpb/c13f/live/c28ed850-95c6-11f0-9cf6-cbf3e73ce2b9.jpg.webp"
      },
      "content": "# Zelensky condemns 'vile' Russian strikes lasting 12 hours\n\nA Russian aerial bombardment that lasted more than 12 hours has killed at least four people and injured at least 70 others in Ukraine.\n\nPresident Volodymyr Zelensky said the deaths all occurred in the capital, Kyiv, where many of the projectiles were aimed, and the victims included a 12-year-old girl.\n\nThe barrage - involving nearly 600 drones and several dozen missiles aimed at seven regions of Ukraine - is one of the heaviest in recent months.\n\nZelensky warned that Ukraine would retaliate and said the \"vile\" attack showed Moscow \"wants to continue fighting and killing\". Russia said it struck military facilities and industrial enterprises supporting Ukraine's armed forces.\n\nFor Ukrainians, aerial bombardments can be both random and routine.\n\nThey tend to occur late on Saturday evenings - in this case, the first sirens were heard at 22:00 GMT.\n\nThe sound of anti-aircraft fire was punctuated with occasional explosions - presumably either from the sound of an intercepted drone or one hitting its target.\n\nIn Kyiv, the country's air alert app urged people to head to shelters and stay there. They were followed by pings warning of an increased aerial threat as hundreds of drones descended on the city.\n\nUkraine's Defence Minister Igor Klymenko said that at least 100 civilian sites had been damaged across the country by the attack, with entire neighbourhoods lefts in ruins.\n\nEmergency services said an attack on Kyiv's Institute of Cardiology had killed a nurse and a patient.\n\nA large bakery, an automobile rubber factory, as well as apartment buildings and civilian infrastructure were also targeted, Zelensky said.\n\n## Russia has no intention of attacking EU or Nato states, foreign minister says\n\n## Kyiv can win all of Ukraine back from Russia, Trump says\n\n## Russia will expand aggression beyond Ukraine if not stopped, Zelensky warns\n\nHe added that Zaporizhzhia, Khmelnytskyi, Sumy, Mykolaiv, Chernihiv and Odesa regions were also hit.\n\nZaporizhzhia's Governor Ivan Fedorov said 34 people had been injured in the region, including three children - two boys, aged 11 and 12, and a nine-year-old girl.\n\nOne boy was caught in an explosion while the other had suffered carbon monoxide poisoning, he said. Both are in a serious condition.\n\nSumy's regional governor said a 59-year-old man had died in strikes in the past day.\n\nZelensky vowed that Ukraine \"will strike back\" in a bid to \"force diplomacy\" from Russia, and said he was counting on a \"strong reaction\" from Europe and the US.\n\n\"This dastardly attack took place in fact as the end of the week of the UN General Assembly, and this is how Russia declares its real position,\" he said.\n\nZelensky reiterated his support of US President Donald Trump's threat of harsher sanctions on Russia, as well as his call for European allies to curb their Russian oil and gas imports.\n\nTrump has recently shifted his position on the war, saying for the first time last week that he thought Ukraine could retake the land it had lost from Moscow as the Russian economy flagged under the strain of a prolonged war.\n\nThe US president has so far desisted from imposing further sanctions on Russia, but has appeared increasingly frustrated with the lack of eagerness from the Kremlin to begin peace talks.\n\nZelensky said on Saturday that Russia would not stop its aggression with Ukraine - which is why it was testing European air defences with the recent incursions in several countries belonging to the Nato military alliance.\n\nMeanwhile, jets were scrambled in neighbouring Poland early on Sunday as Russia hit western Ukraine, the nation's armed forces said.\n\nThe Polish military described the actions - which have become routine since Polish and Nato aircraft shot down three Russian drones in Poland's airspace on 10 September - as preventative.\n\nDenmark's Defence Ministry confirmed on Sunday that it had observed drones over military sites for a second night in a row.\n\nNato has now said it will upgrade its mission in the Baltic Sea in response, including enhanced surveillance and stationing at least one air defence frigate there.\n\nIt follows a series of incidents in which drones appeared over Danish airports, causing disruption to air traffic. Danish officials said they had no evidence to suggest Russian involvement in what they described as a concerted attack, while Moscow denied responsibility.\n\nAlong with Poland, Estonia and Romania have also accused Russia of violating their airspace, prompting a renewed Nato to bolster the alliance's eastern flank.\n\nTrump has gone as far as to say that Nato nations should shoot down Russian planes in their airspace.\n\nIn a speech to the UN General Assembly on Saturday, Russia's Foreign Minister Sergei Lavrov said his country had no intention of attacking EU or Nato member states - but warned of a \"decisive response\" to any \"aggression\" directed towards Moscow.\n\n## Ukraine in maps: Tracking the war with Russia\n\n## Ukraine says three killed in 'massive' Russian aerial attack",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "How Europe held off a stunning U.S. fightback to win the 2025 Ryder Cup - The Athletic",
      "url": "https://www.nytimes.com/athletic/live-blogs/ryder-cup-2025-live-updates-day-3-scores-results-singles/V3UaGTQQqLwd/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://cdn-media.theathletic.com/cdn-cgi/image/width=1200,height=630,fit=cover/V3UaGTQQqLwd_zYhewiqGjT0i_1440x960.jpg",
        "1": "https://cdn-media.theathletic.com/cdn-cgi/image/width=1200,height=675,fit=cover/V3UaGTQQqLwd_zYhewiqGjT0i_1440x960.jpg",
        "2": "https://cdn-media.theathletic.com/cdn-cgi/image/width=1920%2cquality=70%2cformat=auto/https://cdn-media.theathletic.com/V3UaGTQQqLwd_zYhewiqGjT0i_1440x960.jpg",
        "3": "https://static01.nyt.com/athletic/uploads/wp/2020/09/08131325/Luke-Brown-headshot-1.jpg?width=96&quality=70&auto=webp",
        "4": "https://static01.nyt.com/athletic/uploads/wp/2020/11/24152147/Ray-Justin-Headshot-110220.jpg?width=96&quality=70&auto=webp"
      },
      "content": "Ryder Cup 2025Europe Wins Ryder CupTeam Europe's LeadU.S. Needs a MiracleScheffler's ProblemMcIlroy Faces Verbal Abuse A Beatdown at Bethpage\n\n# How Europe held off a stunning U.S. fightback to win the 2025 Ryder Cup\n\nEurope won 15-13 at Bethpage Black despite a Sunday singles rally for the ages from the United States\n\nThe Athletic Live Team and moreSeptember 29, 2025 at 4:02 AM EDT\n\nGetty Images\n\nLuke Brown·Managing Editor, Live\n\n## Europe wins 2025 Ryder Cup\n\nEurope won the Ryder Cup after holding off a sensational U.S. fightback at Bethpage Black.Keegan Bradley’s side trailed by seven points heading into the Sunday singles.The U.S. dominated the session and clawed their way back into contention but Shane Lowry delivered the crucial half-point to retain the trophy.Tyrrell Hatton then added another half in the penultimate match to ensure an outright, 15-13 victory.\n\nSeptember 28, 2025 at 8:07 PM EDTJustin Ray\n\n## What to know about the Europeans’ thrilling Ryder Cup win\n\nIn two days, the Europeans built what seemed to be an insurmountable wall of points at Bethpage Black. Sunday, amid a fervent New York crowd, the Americans nearly climbed over it. The U.S. pushed the seemingly inevitable celebration back farther than Luke Donald and company could have anticipated, but the Europeans retained the Ryder Cup when Shane Lowry birdied the 18th hole to win half a point against Russell Henley. They later accumulated two more halves to win 15-13 overall. Here are the top numbers and notes to know from a thrilling final day at Bethpage Black.\n\nFull Story\n\nSeptember 29, 2025 at 3:44 AM EDTMichael Bailey·Live ReporterMy goodness, they actually had Keegan Bradley’s words up on the wall in HUGE letters.And yes — in the words of my esteemed colleague Craig Chisnall, hang it in the Louvre.\n\nSeptember 29, 2025 at 3:39 AM EDTLukas Weese·Live Reporter\n\n## Where will host the 2027 Ryder Cup?\n\nWith talk of Luke Donald potentially captaining Europe again and Shane Lowry sinking the putt to ensure Europe retained the Ryder Cup, you could already tell focus was switching to the next edition of this storied event.That takes place in 2027 at Adare Manor in Ireland. Established in 1995, the course hosted the Irish Open in 2007 and 2008.It’s going to be a spectacular host of the 46th Ryder Cup too.\n\nSeptember 29, 2025 at 3:34 AM EDTMichael Bailey·Live Reporter\n\n## Pick of the pics\n\nThis shot from Richard Heathcote is in a league of its own.The man in the shot, Luke Donald, isn’t fair off being that himself.\n\nSeptember 29, 2025 at 3:29 AM EDTMichael Bailey·Live Reporter\n\n## Not so fast, Keegan\n\nGetty Images\n\nKeegan Bradley repeated his sentiments in the Team USA media conference shortly after, adding that he had some ideas for how the rules could be changed — but he would keep those to himself for now.When the European captain and players then sat in the same seats for their media conference and Luke Donald was asked about Bradley’s comments, several of the players behind him let out an audible laugh.Donald was clear on his views:💬 “I think it’s been in place since 1971. The U.S. have used it before. It happened in 1991 with Steve Pate. That was a tight Ryder Cup too, 14.5-13.5 (where the U.S. won). It happened in 1993; Sam Torrance couldn’t play with an injured toe. The U.S. won that one.“We have a captains’ agreement for a reason, for situations that occur. I want to center it back to Viktor; I would have had absolute faith in him to deliver a point. He couldn’t play and he was gutted.”\n\nSeptember 29, 2025 at 3:23 AM EDTMichael Bailey·Live Reporter\n\n## Bradley wants ‘obvious’ rule change\n\nGetty Images\n\nThis was the U.S. reaction after the event, first from Harris English speaking to the Golf Channel:💬 “A little soft. I mean, I know Viktor’s hurt. He sent me a text, he came up to me … and the rule is what it is. Hopefully they’ll look at it at some point, but it sucked to not go out there and play today.“It is what it is, I was part of the crowd and cheering them on as much as I could.”As for Keegan Bradley, here’s what he said out on the course during the day:💬 “I mean, it was 25 percent of the points they needed to win. Nothing against Viktor, I’m sure he’s hurt and everything. But that rule has to change. It’s obvious now.“If a person gets hurt on the football field, you don’t give them seven points if Tom Brady gets hurt.“Listen, this is part of how the Ryder Cup is … what makes it unique. It’s got different rules and it’s a bummer it had to happen. I’m sure Viktor was really bummed out too.”\n\nSeptember 29, 2025 at 2:59 AM EDTMichael Bailey·Live Reporter\n\n## Is change needed over envelope rule?\n\nGetty Images\n\nOne of the legacies this Ryder Cup could enjoy is altering the rules for when a player is injured heading into the Sunday singles — at least, that’s what Keegan Bradley was calling for in the aftermath of Team USA’s defeat.Viktor Hovland’s neck injury caused him to pull out of his final match, with Harris English nominated to sit down as part of the now famous yet rarely invoked ‘envelope rule’.As a result both sides halved the point, when Bradley felt the U.S. should have received more.Fair or not? Let us know: live@theathletic.com — and we’ll bring you the U.S. and European view next …\n\nSeptember 29, 2025 at 2:43 AM EDTMichael Bailey·Live Reporter\n\n## McIlroy among those feeling supremely grateful\n\nGetty Images\n\nAs Rory McIlroy said from the 18th green on Sunday afternoon …💬 “What people were saying after Whistling Straits about this decades of American dominance, we took a lot from that. We let that fuel us. We got so lucky in getting an incredible leader in Luke Donald.“He shepherded us through this whole process and he’s been absolutely amazing. A lot of the credit has to go down to him. Eleven of the 12 players from Rome came back, we did what we needed to do and we’re going to celebrate like there’s no tomorrow.”We’ll ignore the fact it already is tomorrow — I’m sure they are still going.\n\nSeptember 29, 2025 at 2:31 AM EDTMichael Bailey·Live Reporter Getty ImagesHenrik Stenson was a Ryder Cup powerhouse and already an heir apparent to the captaincy, when he was appointed in March 2022 ahead of the following year’s Ryder Cup at the Marco Simone Golf & Country Club in Rome.Then LIV Golf came along. Four months later, Stenson was stripped of his contract by the European Tour following his decision to play in the new tournament and a vacancy was created.So who would fill it? The issue was so many other leading candidates with Ryder Cup pedigree were also signed up to LIV, including Lee Westwood, Ian Poulter, Sergio Garcia and Graham McDowell.But that wasn’t the case for Luke Donald, who was a vice-captain at Whistling Straits in 2021 and stepped up to take reins that may have not been placed in front of him without those extraordinary events three years ago.And in the end, the rest has been both history and historic.\n\nSeptember 29, 2025 at 2:22 AM EDTMichael Bailey·Live Reporter\n\n## A sliding doors moment in 2022\n\nGetty Images\n\nThe questions to Luke Donald were persistent from the moment Europe won the 45th Ryder Cup at Bethpage: what about 2027?Each one of those he dismissed or declined to open up at. It’s an answer for another day.However, it is also worth reflecting on how Donald even ended up being European captain in the first place ahead of the 2023 Ryder Cup in Rome …\n\nSeptember 29, 2025 at 2:07 AM EDTMichael Bailey·Live Reporter For those of you wondering, these were the various celebration outfits from 1987, 1995, 2004 and 2012 respectively — including one face that may be slightly more familiar than the other three …\n\nSeptember 29, 2025 at 1:56 AM EDTMichael Bailey·Live Reporter\n\n## Theme: Manifested\n\nMore recently — and more evidence as to why Luke Donald has completely nailed the job of being a Ryder Cup captain — was this answer.It was to our own Gabby Herzig who asked about the theme that underpinned Europe’s Bethpage campaign, and it involved so many minor details — including the kit worn by the players …💬 “Well, our theme was we were trying to win for a fifth time away. We talked about it at the beginning of the week. The practice shirts were based off the wins we already had away: 1987, 1995, 2004, 2012. Everything we did was centered around that, and to make the guys feel we had done it quite often.“In 10 away Ryder Cups since 1983, we had won four of them and come damn close three other times. This wasn’t an impossible task.“We wanted to inspire them to know it could be done. My job is to give them the reasons to make them believe they can win.”\n\nSeptember 29, 2025 at 1:41 AM EDTMichael Bailey·Live Reporter\n\n## Donald delivers ‘something to admire’\n\nGetty Images\n\nI thought it was fascinating that Brandel Chamblee took time to highlight the final message from Luke Donald’s speech at the opening ceremony back on Wednesday.Words directed at the crowd of fans gathered at Bethpage — but actually meant for his players. Here they are again; give them a read with that in mind …💬 “New York is a place where if you show up with talent and a fighting spirit, the city will get behind you — although maybe not if you’re wearing European blue this week.“We know what awaits us. Beth Page isn’t exactly shy. This is New York sports country: passionate, loyal and ferociously loud. Rightly so. You the fans here respect effort over ego. You show up for those who grind, fight and rise for the big occasions. You make us earn every cheer.“We may not be your team but we will give you something to respect. Something to admire. And maybe by the end of this week something to cheer for.”That last part got a reaction that suggested the crowd wanted to applaud the words, but knew they couldn’t.In the end, the words proved profound.\n\nSeptember 29, 2025 at 1:32 AM EDTLukas Weese·Live Reporter\n\n## Potential U.S. captains for 2027\n\nI feel safe in saying Keegan Bradley won’t be captaining the American squad at the Ryder Cup again. So who will Team USA go to for the 2027 edition at Adare Manor?It is a great question. Do the Americans go back to the well with Davis Love III or Steve Stricker? Love and Stricker captained the U.S. teams to victories at the 2016 and 2021 Ryder Cups, respectively.Brandt Snedeker, one of the vice captains for Team USA this year, could also be an option. He finished a perfect 3-0-0 for the Americans in their 2016 win at Hazeltine.But the big elephant (cat?) in the room is Tiger Woods. It would be fascinating to see the 15-time major champion captaining Team USA as they try to win a road Ryder Cup for the first time since the Belfry in 1993.\n\nSeptember 29, 2025 at 1:19 AM EDTEd Mackey·Live Editor\n\n## Don’t let the crowds off the hook\n\nGetty Images\n\nAlthough the drama we saw today was incredible, to me the crowds at Bethpage Black were an embarrassment to the nation they represented.The treatment that followed Rory McIlroy and Shane Lowry around the course in yesterday’s fourball was nothing short of disgusting, including a beer can being thrown from the crowd towards the head of McIlroy’s wife, Erica.Thankfully, I’m fully confident the fans at Adare Manor in two years won’t behave the same way.But the PGA of America has a serious problem to solve when the Ryder Cup returns to these shores at Hazeltine in 2029.\n\nSeptember 29, 2025 at 1:10 AM EDTLukas Weese·Live Reporter\n\n## Favourite moment: Lowry’s emotional interview\n\nShane Lowry’s putt to retain the Ryder Cup will be etched into the lore of this event for years to come. But it is what happened after that will stay with me.Draped with Ireland flag, Lowry was tearing up. He was emotional in the interview, demonstrating how much this event means to him.Lowry won The Open at Portrush. But winning the Ryder Cup means more to him. To see grown men cry demonstrates the power and emotion of this event.An incredible scene at the 18th green of Bethpage Black.\n\nSeptember 29, 2025 at 1:01 AM EDTLukas Weese·Live Reporter\n\n## Favourite moment: Young caps off epic week\n\nIt was a stellar week for New York native Cameron Young. He finished 3-1 for Team USA, including a critical singles match win over Justin Rose at the start of the day.Young had a 3-up lead over Rose on the back nine before the experienced European player rallied. It was all square going to the 18th.Young had a putt to win the match and drained it. Seeing someone who doesn’t typically show much emotion become expressive after winning the match highlights the power of the Ryder Cup.Expect Young to be on future Ryder Cup teams.\n\nSeptember 29, 2025 at 12:52 AM EDTLukas Weese·Live Reporter\n\n## Favourite moment: Thomas’ winning putt\n\nJustin Thomas knows how to rev up a crowd. He was made for Sunday singles and he delivered again today at the Ryder Cup.Thomas’ rally against Tommy Fleetwood added to his accomplished resume. His winning putt on the 18th hole — the rousing roar, pumping up the crowd — made my eyes widen and jaw drop with excitement.It ensured Thomas remained unbeaten in Ryder Cup singles play. Even though Team USA didn’t complete the comeback, Thomas’ win was a rare highlight of the weekend for the home team.\n\nSeptember 29, 2025 at 12:48 AM EDTMichael Bailey·Live ReporterMy colleague Lukas Weese was all over the Sunday singles action at Bethpage. His magic moments from an incredible day are coming next …\n\nLoad more updates",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Russia's clear warning that it can easily chip away at Europe's defences | World News | Sky News",
      "url": "https://news.sky.com/story/why-drones-are-proving-critical-as-russia-sends-a-clear-warning-to-europe-13440471?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://e3.365dm.com/25/09/1600x900/skynews-russia-drone_7035435.jpg?20250928203229",
        "1": "https://e3.365dm.com/25/09/768x432/skynews-russia-drone_7035435.jpg?20250928203229",
        "2": "https://e3.365dm.com/25/06/75x75/skynews-diana-magnay_6949544.png?20250624142003",
        "3": "https://e3.365dm.com/25/09/768x432/skynews-fire-drone-ukraine_7034589.jpg?20250928101917"
      },
      "content": "Analysis Analysis\n\n# Russia's clear warning that it can easily chip away at Europe's defences\n\nGermany and Denmark are the latest countries to raise the alarm over drone sightings and unexplained drone activity.\n\nDiana Magnay International correspondent @DiMagnaySky\n\nSunday 28 September 2025 20:37, UK\n\nImage: A drone carrying a bomb during a joint Russian-Belarusian military drills. Pic: AP\n\n[Why you can trust Sky News](https://news.sky.com/info/policies-and-standards)\n\nThe brutality of Russia's drone assaults on Ukraine's towns and cities shows no let up.\"Savage strikes, a deliberate targeted terror\" is how the Ukrainian President Volodymyr Zelenskyy described the latest overnight bombardment. Some 595 attack drones and 48 missiles were involved and even if only a small fraction made it through Ukrainian air defences, the destruction - in Sumy and Odessa, Zaporizhia and Kyiv - is significant.Please use Chrome browser for a more accessible video player 2:57 Russia strikes Kyiv in major attack Also overnight, Denmark reported yet more drone sightings.It has not named Russia directly but after a week in which unidentified drones have resulted in the temporary shutdown of military and civilian airports, it is banning all civil drone flights and describing the threat as a hybrid attack.Germany is also raising the alarm over unexplained drone activity along its border with Denmark.Germany's interior minister said on Saturday: \"We are witnessing an arms race, an arms race between drone threats and drone defences. It is a race we cannot afford to lose.\" NATO is having to deploy extra assets to beef up its Baltic Sea defences and its Eastern flank.European nations are working to establish a drone wall along their borders with Russia and Ukraine. Get Sky News on WhatsApp Follow our channel and never miss an update Germany is setting up a drone defence centre to make sure it has what it needs to protect itself.The Kremlin is forcing NATO to divert assets to protect its airspace and sub-sea infrastructure at a time when Europe is trying to work out how best to support and finance Ukraine.Read more:Putin's top diplomat issues warningWhy Trump has made a U-turn Follow The World Listen to The World with Richard Engel and Yalda Hakim every Wednesday With drones an inexpensive element of its hybrid warfare arsenal, Russia is sending a clear warning that it can relatively easily chip away at Europe's defences and that Europe had better focus on protecting itself.\"If NATO begins to look too rattled, that actually is encouragement for Putin precisely to step up the pressure,\" says Mark Galeotti, a specialist in Russian security. \"So really we need to be holding our nerve.\"Yes, reserving the right to shoot things down that look like direct threats, but otherwise actually talking down, not talking up, the nature of the threat while of course we arm so that we are even more prepared.\"Last week, Estonia said its fighter jets had escorted three Russian MIG fighter jets out of their airspace after a 12-minute incursion, which Russia denies ever took place. Please use Chrome browser for a more accessible video player 3:24 Russia denies violating Estonia airspace amid NATO outrage [Be the first to get Breaking News Install the Sky News app for free](https://news.sky.com/download-app) On Saturday, Estonia pledged €10m (£8.7m) to NATO's \"Prioritised Ukraine Requirement List\" or PURL programme, which sees US-produced weapons, paid for by NATO's European partners, fast-tracked to Ukraine.Zelenskyy posted on Sunday after speaking with the NATO secretary general that PURL is moving forward well. And that is just what Russia is trying to prevent.\n\n### Related Topics\n\n- [NATO](https://news.sky.com/topic/nato-5921) - [Russia](https://news.sky.com/topic/russia-5803) - [Ukraine](https://news.sky.com/topic/ukraine-6556) - [Vladimir Putin](https://news.sky.com/topic/vladimir-putin-5972) - [Volodymyr Zelenskyy](https://news.sky.com/topic/volodymyr-zelenskyy-10031)\n\nfooter",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Home | Euractiv",
      "url": "https://www.euractiv.com/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.euractiv.com/content/uploads/sites/2/2025/09/GettyImages-2237615267.jpg",
        "1": "https://www.euractiv.com/content/uploads/sites/2/2025/09/GettyImages-2223284884-1.jpg",
        "2": "https://www.euractiv.com/content/uploads/sites/2/2025/09/BT1-26-e1759128680856.jpg",
        "3": "https://www.euractiv.com/content/uploads/sites/2/2025/09/10723421-1.jpg",
        "4": "https://www.euractiv.com/content/uploads/sites/2/2025/09/12709654.jpg"
      },
      "content": "### Policy areas\n\n- Economy\n\n- Politics\n\n- Agrifood\n\n- Health\n\n- Tech\n\n- Energy, Environment & Transport\n\n- Defence\n\n- euractiv.com\n\n- euractiv.fr\n\n- euractiv.de\n\n- euractiv.gr\n\n- euractiv.pl\n\n- euractiv.cz\n\n- euractiv.sk\n\n- euractiv.it\n\n- euractiv.es\n\n## TOP STORIES\n\n#### Moldova's pro-EU party wins key polls after Russian meddling claims\n\nPolitics\n\n##### EUCO under attack\n\n##### Drone threat looms as Europe's leaders head for Copenhagen summit\n\nDefence\n\n##### Watchdog report points to major failures in EU environment policy\n\nEnergy, Environment & Transport\n\n##### The far right is acting as one party. When will we?\n\nOpinion\n\n##### Member states talk stronger Frontex, test limits on returns\n\n##### Czech president to steer post-election course as populists lead\n\n##### Belarusian President mocks Poland’s airspace warning\n\n## Opinions\n\n##### The far right is acting as one party. When will we?\n\n##### Fragmentation is holding back Europe’s defence drive\n\n##### The Brief – 26 September 2025: The Good, the Bad, and the Ugly\n\n## Economy\n\n##### EU weighs new €140 billion Ukraine loan using Russian assets\n\nEconomy\n\n##### EU reparation loan for Ukraine ‘will never happen’, says Belgium\n\n##### Should we worry about Romania?\n\n## Agrifood\n\n##### HARVEST: Let there be (food) dialogue\n\nAgrifood\n\n##### EU farmers choose lobbying over rallying – for now\n\n##### Industry calls EU talk of unhealthy food levy 'knee-jerk'\n\n##### FIREPOWER: Defence the Chefsache for EU leaders in Copenhagen\n\n##### Commission must match money with ideas in Copenhagen to make EU defence a reality\n\n##### Slovakia signals defence cuts amid fiscal squeeze, downplays Russia threat\n\n## Across Europe\n\n##### Moldova's pro-EU party wins key polls after Russian meddling claims\n\n##### Slovakia signals defence cuts amid fiscal squeeze, downplays Russia threat\n\n##### Belarusian President mocks Poland’s airspace warning\n\n##### Drone threat looms as Europe's leaders head for Copenhagen summit\n\n## Advocacy Lab content\n\n##### Energy transition success hinges on upscaled storage and smarter grids\n\n##### Digital industry wants EU’s 30-year-old telecoms regulations updated\n\nTech\n\n##### Europe can’t compete without water action, warns Danish firm\n\n##### Farmers are deploying tech fast to meet tough sustainability targets\n\n## Health\n\n##### FIRST AID / The week ahead: A liver screen before Gastein?\n\nHealth\n\n##### Six questions about Trump's new drug tariff threats\n\n##### Ireland holds its breath as pharma tariff drama plays out\n\n##### EU confirms reimposition of Iran sanctions after UN move\n\n##### VOLTAGE: Brussels hit with atrocious environment scorecard\n\n##### Majority of EU company executives accept mandatory green transition plans\n\n## Promoted content\n\n##### Squid: The Unregulated Frontier of Sustainable Fisheries\n\n##### EU Strategy for the Danube Region – Prosperity through Diversity\n\n##### Partnerships: The engine of the agrifood transition\n\n##### Beyond the Institutions: How Associations Keep Europe Connected\n\n##### THE HACK: Cyber-security month is coming\n\n##### EXCLUSIVE: Danish Presidency wants EU to play bigger role in online child safeguarding\n\n##### Meta extends pay-or-consent ad model to the UK\n\n## Euractiv's Pro newsletters\n\n##### HARVEST: Let there be (food) dialogue\n\n##### FIREPOWER: Defence the Chefsache for EU leaders in Copenhagen\n\n##### FIRST AID / The week ahead: A liver screen before Gastein?\n\n##### VOLTAGE: Brussels hit with atrocious environment scorecard\n\n##### THE HACK: Moldova's election disinfo battleground\n\n## The Rapporteur\n\n##### EUCO under attack\n\n##### Brussels bets the house on Moldova\n\n##### Who killed the Brussels effect?\n\n##### Europe's West Bank woes",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Radio Free Europe/Radio Liberty",
      "url": "https://www.rferl.org/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://gdb.rferl.org/90eccac1-fe98-40eb-763c-08ddfa912cba_cx0_cy18_cw0_w250_r1.jpeg",
        "1": "https://gdb.rferl.org/34776510-bd3a-4816-8d99-65d73100e39a_cx0_cy4_cw0_w160_r1.jpg",
        "2": "https://gdb.rferl.org/34776510-bd3a-4816-8d99-65d73100e39a_cx0_cy4_cw0_w100_r1.jpg",
        "3": "https://gdb.rferl.org/2121c075-af09-4e1d-f6ee-08dde5265cd3_w160_r1.jpg",
        "4": "https://gdb.rferl.org/2121c075-af09-4e1d-f6ee-08dde5265cd3_w100_r1.jpg"
      },
      "content": "## Accessibility links\n\n- Skip to main content\n\n- Skip to main Navigation\n\n- Skip to Search\n\n##### Follow Us\n\n- Moldova's Pro-EU Election Result A Win For Brussels As Much As Chisinau\n\n#### Moldova's Pro-EU Election Result A Win For Brussels As Much As Chisinau\n\n- EU Monitoring Threats To Moldova's Elections Amid Alleged Russian Plot To Train Provocateurs In Serbia\n\n#### EU Monitoring Threats To Moldova's Elections Amid Alleged Russian Plot To Train Provocateurs In Serbia\n\n- As Moldova Votes, Widespread Poverty Feeds Anti-Western Narratives\n\n#### As Moldova Votes, Widespread Poverty Feeds Anti-Western Narratives\n\n- Massive Russian Air Barrage On Ukraine Kills 4, Including Child\n\n#### Massive Russian Air Barrage On Ukraine Kills 4, Including Child\n\n- Afghan's Taliban Rulers Release US Citizen From Custody After Trump Envoy's Visit\n\n#### Afghan's Taliban Rulers Release US Citizen From Custody After Trump Envoy's Visit\n\n## Top Stories\n\n- Iran Slams 'Failed Diplomacy' As Snapback Sanctions Take Force\n\n#### Iran Slams 'Failed Diplomacy' As Snapback Sanctions Take Force\n\n- New Drone Sightings Reported Over Europe As EU Plans Defensive Wall\n\n#### New Drone Sightings Reported Over Europe As EU Plans Defensive Wall\n\n- Russian Strikes Pound Ukraine As Kyiv Disrupts Major Oil-Pumping Station 1,200-Km From Border\n\n#### Russian Strikes Pound Ukraine As Kyiv Disrupts Major Oil-Pumping Station 1,200-Km From Border\n\n- Exclusive: The Russian Neo-Nazi Behind A Shadowy GRU Recruitment Campaign\n\n#### Exclusive: The Russian Neo-Nazi Behind A Shadowy GRU Recruitment Campaign\n\n## Don't Miss\n\n- A Kyiv Man Survived As His Home Collapsed. Rescuers Want Others To Be Ready For Disaster.\n\n#### A Kyiv Man Survived As His Home Collapsed. Rescuers Want Others To Be Ready For Disaster.\n\n- Afghans Fear Losing 'Last Hope' As Taliban Shuts Down Internet\n\n#### Afghans Fear Losing 'Last Hope' As Taliban Shuts Down Internet\n\n- What Does Trump's Sudden Shift Mean For Russia's War On Ukraine?\n\n#### What Does Trump's Sudden Shift Mean For Russia's War On Ukraine?\n\n- How NATO Is Boosting Eastern Defenses Amid Russian Air Incursions\n\n#### How NATO Is Boosting Eastern Defenses Amid Russian Air Incursions\n\n- Ukraine Pounds Major Russian Oil Refineries As Fuel Shortages Reported\n\n#### Ukraine Pounds Major Russian Oil Refineries As Fuel Shortages Reported\n\n- As Moldova Votes, Widespread Poverty Feeds Anti-Western Narratives\n\n#### As Moldova Votes, Widespread Poverty Feeds Anti-Western Narratives\n\n- Why Does Trump Want Afghanistan's Bagram Air Base Returned To US Control?\n\n#### Why Does Trump Want Afghanistan's Bagram Air Base Returned To US Control?\n\n- As NATO Mulls Response To Trespassing Russian Warplanes, Can It Shoot Them Down?\n\n#### As NATO Mulls Response To Trespassing Russian Warplanes, Can It Shoot Them Down?\n\n- The Sakharov Prize: Who's In The Running For The EU's Top Human Rights Award?\n\n#### The Sakharov Prize: Who's In The Running For The EU's Top Human Rights Award?\n\n- Uyghur Camp Survivor Details Forced Sterilization, Torture In Xinjiang\n\n#### Uyghur Camp Survivor Details Forced Sterilization, Torture In Xinjiang\n\n- Armenians In Uproar After Removal Of Mount Ararat From Passport Stamps\n\n#### Armenians In Uproar After Removal Of Mount Ararat From Passport Stamps\n\n- The Kremlin Wants to Cool Down The Russian Economy. Why That Could Be A Problem\n\n#### The Kremlin Wants to Cool Down The Russian Economy. Why That Could Be A Problem\n\n## Visuals\n\n- Ukrainian Life Hacks: How To Survive Being Trapped Under Rubble\n\n#### Ukrainian Life Hacks: How To Survive Being Trapped Under Rubble\n\n- Why Does Donald Trump Want Afghanistan's Bagram Air Base Back?\n\n#### Why Does Donald Trump Want Afghanistan's Bagram Air Base Back?\n\n- Russia Strikes 3 Ukrainian Regions As Ukraine Hits Russian Refinery\n\n#### Russia Strikes 3 Ukrainian Regions As Ukraine Hits Russian Refinery\n\n- Almost Surrounded By Russian Forces, Residents Of Kostyantynivka Hold Out\n\n#### Almost Surrounded By Russian Forces, Residents Of Kostyantynivka Hold Out\n\n- Mount Ararat, A Treasured Symbol For Armenians, To Disappear From Passport Stamps\n\n#### Mount Ararat, A Treasured Symbol For Armenians, To Disappear From Passport Stamps\n\n- Ukrainian Survivors Evacuated From Village Where Russian Strike Killed 25 Pensioners\n\n#### Ukrainian Survivors Evacuated From Village Where Russian Strike Killed 25 Pensioners\n\n- Afghan Children In Pakistan Fear Taliban Schools If Forced Home\n\n#### Afghan Children In Pakistan Fear Taliban Schools If Forced Home\n\n- RFE/RL Journalist Ihar Losik Released By Belarus After 5 Years In Detention\n\n#### RFE/RL Journalist Ihar Losik Released By Belarus After 5 Years In Detention\n\n- Newly Freed Belarusian Prisoners Shed Tears At Emotional News Conference\n\n#### Newly Freed Belarusian Prisoners Shed Tears At Emotional News Conference\n\n- On The Front Line, Ukrainian Drone Crew Hunts Russian Troops\n\n#### On The Front Line, Ukrainian Drone Crew Hunts Russian Troops\n\n- Georgian Opposition Protesters Gather Without Incident A Day After Violent Clashes\n\n#### Georgian Opposition Protesters Gather Without Incident A Day After Violent Clashes\n\n- Afghan Teen Returns To Village To Find His Family Killed\n\n#### Afghan Teen Returns To Village To Find His Family Killed\n\n- Ukrainian Amputee Veteran Finds Solace In Caring For Dogs\n\n#### Ukrainian Amputee Veteran Finds Solace In Caring For Dogs\n\n- Sister Of Jailed Activist Kalesnikava Sees Pivotal Moment For Belarusian Prisoners\n\n#### Sister Of Jailed Activist Kalesnikava Sees Pivotal Moment For Belarusian Prisoners\n\n- Ukrainian Soldier Tells Of Being Left For Dead By Russian Captors\n\n#### Ukrainian Soldier Tells Of Being Left For Dead By Russian Captors\n\n- As Drones Close In, Civilians Flee Kostyantynivka With Humanitarian Help\n\n#### As Drones Close In, Civilians Flee Kostyantynivka With Humanitarian Help\n\n- Touring Europe, Ukrainian Orchestra 'Fights On The Cultural Front'\n\n#### Touring Europe, Ukrainian Orchestra 'Fights On The Cultural Front'\n\n- Captured Russian Soldiers Report Heavy Losses As Ukraine Repels Breach Near Dobropillya\n\n#### Captured Russian Soldiers Report Heavy Losses As Ukraine Repels Breach Near Dobropillya\n\n- How Ukraine Fires Nets To Catch Russian Drones\n\n#### How Ukraine Fires Nets To Catch Russian Drones\n\n## Beyond Our Borders\n\n- Congress Wants To Label Russia A Terrorism Sponsor. Will It Happen?\n\n#### Congress Wants To Label Russia A Terrorism Sponsor. Will It Happen?\n\n- Silicon Valley Embraces US Defense Tech Amid Rising Global Conflicts\n\n#### Silicon Valley Embraces US Defense Tech Amid Rising Global Conflicts\n\n- China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n#### China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n- 50 Years After The Helsinki Final Act, Can The OSCE Stay Relevant?\n\n#### 50 Years After The Helsinki Final Act, Can The OSCE Stay Relevant?\n\n- Wider Europe Wider Europe Briefing: What Is NATO's Operation Eastern Sentry? Russia China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n#### Wider Europe Briefing: What Is NATO's Operation Eastern Sentry?\n\n#### China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n- Wider Europe Wider Europe Briefing: What Is NATO's Operation Eastern Sentry?\n\n#### Wider Europe Briefing: What Is NATO's Operation Eastern Sentry?\n\n- Russia China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n#### China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n## Most Popular Stories\n\n#### Ukraine Pounds Major Russian Oil Refineries As Fuel Shortages Reported\n\n#### Poland Reopens Belarus Border As China Moves To Protect Trade Routes\n\n#### Moldova On Knife Edge In Election Marred By Russian Disinformation Claims\n\n#### Exclusive: The Russian Neo-Nazi Behind A Shadowy GRU Recruitment Campaign\n\n#### Russian Strikes Pound Ukraine As Kyiv Disrupts Major Oil-Pumping Station 1,200-Km From Border\n\n## Follow Us\n\n## RFE/RL Investigates\n\n- A Toxic Trail Exposed: How Russia Makes Chemical Weapons And Uses Them Against Ukraine\n\n#### A Toxic Trail Exposed: How Russia Makes Chemical Weapons And Uses Them Against Ukraine\n\n- Satellite Images Appear To Show Secretive Construction Of 'Strategic' Base In Belarus\n\n#### Satellite Images Appear To Show Secretive Construction Of 'Strategic' Base In Belarus\n\n- Europe Faces Critical Challenges in Countering Russian Drone Threats\n\n#### Europe Faces Critical Challenges in Countering Russian Drone Threats",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Latest News in EL PAÍS English",
      "url": "https://english.elpais.com/latest-news/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://images.english.elpais.com/resizer/vf9Osm0ICEGR8hFZvQdXaZ1Sask=/200x200/cloudfront-eu-central-1.images.arcpublishing.com/prisa/WPQVX7BCBRHEPF6ES56RRQTEPI.jpg",
        "1": "https://imagenes.elpais.com/resizer/v2/KU7VEAJAFRDAZH3KYLZ6HUCFRM.jpg?auth=c84356b00492767bb8939d63850c9130b3c38b8a8528651afa0c4e12de44ca52&width=414&height=233&focal=1899%2C1440",
        "2": "https://imagenes.elpais.com/resizer/v2/NWJBIU4P3NCXVPHXD3VGDCJHKY.jpg?auth=5c77c86ae04cbdc4d24fb299a480f35c038677840f2d38f2cb212075b705bd22&width=414&height=233&focal=819%2C543",
        "3": "https://imagenes.elpais.com/resizer/v2/SNHLEFOU7JJFRCQXWFKFOH4LXY.jpg?auth=5c9c9465a34c493972241dd4e37a0780fc203b1ddbe3b372eda01d0bfb73a89e&width=414&height=233&focal=2252%2C869",
        "4": "https://imagenes.elpais.com/resizer/v2/LTQECKDRIFGPRGQMHXKVTE7P3Y.jpg?auth=8b9d4011f1cc13fde5ec74c158c028d842661d533025579be717871a4a14315b&width=414&height=233&focal=2866%2C772"
      },
      "content": "Argentina’s economy minister draws on his stock-trading past to make risky moves that divide opinion\n\nThe unprecedented US financial aid, hailed at the Casa Rosada as a major victory, puts the Argentine president under the Republican’s influence\n\nThe wife of the slain Trump activist has emerged as a rising public figure at the crossroads of politics and religion in US conservatism\n\nThe risk of the National Guard deployments is that our reflexive militarism moves us, mindlessly, towards fascism\n\nPublishers and non-profit groups in Spain, Portugal, Australia and Ireland share the same conviction: that the best writers of children’s books are the kids themselves\n\nDefectors from the Pyongyang regime describe the growing repression and deterioration of human rights denounced by the UN\n\nOn the outskirts of San Salvador, a real estate company is threatening to evict the residents of the Primero de Diciembre neighborhood. This pattern is playing out across the country amid a rapid wave of land privatization and gentrification\n\nMoscow is cracking down on complaints calling for the return of troops three years after the draft that shocked Russia\n\nThe current owners of the legendary Manhattan restaurant manage the 99-year-old establishment with respect and care, protecting it from property speculation\n\nWhile the official narrative tries to avoid the word ‘poverty,’ the inequality that the revolutionaries promised to eradicate is increasingly evident\n\nAfter exploring sex in his first books, the writer delves into illness and US social violence in his novel ‘Small Rain’\n\nThe U.S. exchange has become the go-to destination for foreign firms aiming to go public. About 50 European companies have listed there this year\n\nA lethal mix of cannabis and synthetic opioids up to 25 times more potent than fentanyl is causing dozens of deaths and has become a public health emergency in countries like Liberia and Sierra Leone\n\nEU-funded researchers are cultivating fungi on agricultural waste to create smarter and greener construction materials able to adapt and react to their environment, and even repair themselves\n\nThe writer and filmmaker from Zimbabwe decries the destruction caused by colonialism in her country, and looks to rebuild an identity that has been shattered\n\nAmericans are facing a countdown to save democracy. With the government against them, civil society will be crucial in this challenge\n\nFrom an evolutionary anthropological perspective, human beings have adapted to be able to run and work out without shoes, and biomechanics show the practice can be beneficial if adopted gradually\n\nWith interest rates soaring and reserves in the red, Argentina’s far-right president is finding it increasingly difficult to keep his fiscal adjustment afloat. He is hoping a recent pledge from the White House will save him from the abyss\n\nFor 150 years, the bag has been a symbol of childhood. It is handcrafted and used throughout elementary school. The most luxurious models can cost over $1,000\n\nThe Israeli Prime Minister says he will not allow a ‘national suicide’ by accepting a Palestinian state and said recognition by France, the UK and others is a ‘mark of shame’\n\nThe former Black Panther member, accused 52 years ago of murdering a police officer, was welcomed by Fidel Castro and always considered herself a political prisoner\n\nThe island’s authorities have been using suicide drones for eight months to target armed groups, and the attacks have left at least 30 civilians dead, including children\n\nFifty years after its premiere, it is still remembered as a brave, intelligent and emotional film, one of the pearls of New Hollywood and a highlight in the career of one of the big screen’s biggest stars\n\nThe DHS says it has received more than 150,000 applications to join the immigration agency, but there are growing concerns about staffing shortages in other forces\n\nComplaints about poor conditions at the new detention center indicate that detainees lack adequate medical care, food, and water\n\nDespite facing multiple legal proceedings, the former French leader — the first to enter prison — kept his political and business clout\n\nThe president’s comment about Kyiv recovering all territory occupied by Russia is being interpreted as a sign that Washington will eventually disengage from the conflict\n\nThe charges come days after the US president demanded that DOJ act ‘now’ against his critic\n\nStates and cities are acting as checks and balances against the White House\n\nSoprano Melinda Hughes writes, composes and stars in ‘Melania: The Opera’, a playful chamber piece about the first lady’s dilemmas during a fictional Russian invasion of her homeland, Slovenia\n\nThe satellite’s influence on the reproduction of many animals is well documented, but its impact on humans is debated\n\nAccording to the US distributor of the Mexican beer, concern over ICE raids explains why Michelob Ultra has taken the lead in sales\n\nA security operation discovered a site in Michoacán where a group of men from the megachurch were being trained in military tactics\n\nWednesday’s shooting in Dallas was the third at an immigration office in Texas this year. The government reports that attacks on officers have increased by 1,000%\n\nA team of scientists describes how malignant cells use ‘highways’ of hardened tissue to spread to other organs, and how blocking two proteins can stop them\n\nKyiv avoids triumphant statements despite the US president’s apparent support for the country’s recovery of all territory invaded by Russia\n\nThe controversial statements by the US president put the spotlight on an island lacking more than 400 medicines and where experts believe autism is underreported\n\nTraditional journalists complain that he is an advocate — the same criticism Woodward and Bernstein faced during Watergate\n\nThe vessel will be there to perform rescues if required, not to confront attacks by drones\n\nThe former presidential candidate was interrupted by pro-Palestinian protesters at the start of a book tour in New York to promote her memoir about the election campaign she lost\n\nThe acting director of Immigration and Customs Enforcement confirmed that the assailant is dead. No federal agents were shot\n\nThe comic writer reflects on his book series, which was adapted into a hit show on Amazon Prime, watched by more than 55 million people\n\nSamples from Spanish supercentenarian María Branyas Morera reveal the keys to her exceptional genetics and provide clues for healthy aging\n\nThe Ukrainian president thanked Donald Trump for his support and called for regulating the use of AI ‘in the most destructive arms race in history’\n\nTreasury Secretary Scott Bessent warns ‘speculators’ that Trump ‘has given President Milei a rare endorsement of a foreign official’\n\nIn an interview with EL PAÍS, the politician describes the state of political resistance, denounces harassment, and shares her fears about living in a country without judicial guarantees\n\nDemocratic lawmakers say that Trump reassigned 90% of the DHS office that investigates child exploitation and trafficking to immigration enforcement\n\nHistorian Enrique Faes uncovers a case hidden in the archives for 60 years: a real-life detective tale involving tax evasion, secret codes and a Swiss bank employee who sought out wealthy clients in post-war Spain\n\nUS musician Jacob Koller is performing a recital in Japan with an instrument that was saved from the atomic bomb, and donated to restorer Mitsunori Yagawa to promote peace\n\nThe researcher, trained at Oxford and Cambridge, explains the interaction between artificial intelligence and the scientific discipline that deals with the nervous system\n\nThe comedian, who was suspended a week ago over a remark about the alleged killer of MAGA activist Charlie Kirk, spoke out against Trump’s efforts to silence critics\n\nThe French president praised the purpose and history of the organization that the US leader attacked: ‘Its harshest critics are those who want to exert domination’\n\nThe suspect, who represented himself, faces life in prison. After learning the verdict, he tried to stab himself in the neck with a pen\n\nThe US president criticizes the fight against climate change at the United Nations General Assembly, calling it a ‘hoax’ and demands that Europe stop buying Russian gas and oil to end the war in Ukraine\n\nThe decision will affect 25% of American households, and will also hurt advertising revenue\n\nThe US space agency has announced a new schedule for Artemis 2 that will lay the groundwork for the first human landing since 1972\n\nA team of paleontologists has discovered a complete set of fossil remains of one of the megaraptors that lived shortly before the extinction of dinosaurs\n\nA scientific review examines advances in the field and addresses the controversy surrounding new drugs, questioned due to their price and modest efficacy\n\nThe OECD maintains that, on average, a quarter of socioeconomic differences are explained by imposed or inherited factors. In the European country, the proportion exceeds 35%\n\nFood shipments from Mexico declined by 4.4% in the first seven months of the year, according to official data. More than 80% of these exports are destined for the US\n\nThe Israeli project to divide the West Bank dates back to the 1990s, but no government had dared to approve it due to international pressure. ‘This place is ours,’ the Israeli prime minister emphasized\n\nThe artist, 22, who took home two of the four awards for which she was nominated at the recent VMA Awards, describes herself as very hard-working, ambitious and ‘a bit clairvoyant’\n\nAlthough the goal is to benefit American workers in advanced sectors, experts warn that the measure limits growth and innovation, especially in artificial intelligence",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Here are 7 things you might not know about European stocks, according to UBS By Investing.com",
      "url": "https://www.investing.com/news/stock-market-news/here-are-7-things-you-might-not-know-about-european-stocks-according-to-ubs-4257930?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i-invdn-com.investing.com/news/moved_LYNXNPEI48092_L.jpg"
      },
      "content": "# Here are 7 things you might not know about European stocks, according to UBS\n\nInvesting.com - Global investors have been paying closer attention to European markets in recent months, as traders partially look to take advantage of the region’s cheaper valuation relative to frothy U.S. names.\n\nIn a note, analysts at UBS argued that the narrative around European equities has been expanding beyond luxury sector stocks and chip equipment maker ASML, which were prevalent \"growth stories\" in the decade prior to a worldwide financial crisis more than a decade ago.\n\nAgainst this backdrop, they recently upgraded their year-end target for the pan-European Stoxx 600 index to 600. On Friday, it closed at 554.52.\n\n\"The region is undergoing a transformation that provides plenty of underappreciated opportunities -- defense spending beneficiaries and banks have become opportunities with global recognition but there is still more to Europe to discover,\" they wrote.\n\nThey highlighted both the financials and industrials sectors, flagging that the two now account for 42% of the European index. As a result, the analysts said, the region has become exposed to more cyclical economic trends, although quality and growth metrics have not materially decreased. This was \"a testament to Europe’s broader quality improvement\" in recent years, they said.\n\nRisk-adjusted alpha, or the excess return of an investment or portfolio over a benchmark index, and shareholder yields remain elevated in Europe as well, they said, adding that this provides \"downside protection.\"\n\nMeanwhile, stimulus-sensitive sectors, such as manufacturing, are beginning to expand, with sector activity data pointing to the end of a three-year soft patch and the start of a new cycle, the analysts said.\n\nAt the same time, European governments are increasingly embracing innvovation funding and broadening an effort to improve competitiveness of local businesses, they said.\n\nSpecific sectors, such as utilities, are delivering growth upgrades at \"attractive\" valuations, benefiting from electrification, regulatory support and disciplined capital allocation, they added.\n\nTelecommunications firms are another \"under-appreciated\" beneficiary of tax relief, infrastructure investment, and digitial sovereignty initiatives in Europe, \"creating structural tailwinds that are not yet fully priced in,\" the analysts said.\n\nEurope’s pharmaceuticals sector is also at its cheapest in 15 years, fueled by pipeline catalysts and fading political risks, they argued, adding that this sets the segment up for a re-rating.\n\nOut of the utilities, telecoms, and drugmaking sectors, the UBS analysts have \"buy\" ratings for a number of stocks, including Iberdrola (BME:IBE), Enel (BIT:ENEI), and Engie (EPA:ENGIE); Deutsche Telekom (ETR:DTEGn), Orange (EPA:ORAN), and Telenor (OL:TEL); and AstraZeneca (ST:AZN), Roche (SIX:ROG), and Sanofi (EPA:SASY).\n\n## Latest comments\n\n| Name | Last | Chg. % | Vol. |\n| --- | --- | --- | --- |\n| INTC | 35.50 | +4.44% | 268.58M |\n| NVDA | 178.19 | +0.28% | 148.57M |\n| TSLA | 440.40 | +4.02% | 101.63M |\n| AAPL | 255.46 | -0.55% | 46.08M |\n| PLTR | 177.57 | -0.87% | 44.28M |\n| AMZN | 219.78 | +0.75% | 41.65M |\n| MSFT | 511.46 | +0.87% | 16.21M |\n\n| Name | Last | Chg. % | Vol. |\n| --- | --- | --- | --- |\n| EA | 193.35 | +14.87% | 14.49M |\n| GFS | 35.59 | +8.37% | 8.50M |\n| PCAR | 100.50 | +5.16% | 5.89M |\n| CDW | 164.37 | +4.71% | 1.50M |\n| APP | 669.86 | +4.68% | 6.12M |\n| LW | 55.22 | +4.52% | 2.74M |\n| TTWO | 256.12 | +4.49% | 3.48M |\n\n| Name | Last | Chg. % | Vol. |\n| --- | --- | --- | --- |\n| COST | 915.95 | -2.90% | 4.81M |\n| ORCL | 283.46 | -2.70% | 25.99M |\n| SHOP | 140.25 | -2.23% | 7.26M |\n| EBAY | 91.14 | -2.12% | 6.90M |\n| FICO | 1,518.78 | -1.91% | 199.01K |\n| DXCM | 67.10 | -1.76% | 7.43M |\n| PODD | 318.00 | -1.72% | 577.41K |\n\n## Trending Stocks\n\n| Name | Last | Chg. % | Vol. |\n| --- | --- | --- | --- |\n| TSLA | 440.40 | +4.02% | 101.63M |\n| NVDA | 178.19 | +0.28% | 148.57M |\n| INTC | 35.50 | +4.44% | 268.58M |\n| AMZN | 219.78 | +0.75% | 41.65M |\n| ORCL | 283.46 | -2.70% | 25.99M |",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Asian stocks today: Markets mostly in green following US gains; HSI jumps over 350 points, Shenzhen up 1.28% - The Times of India",
      "url": "https://timesofindia.indiatimes.com/business/international-business/asian-stocks-today-markets-mostly-in-green-following-us-gains-hsi-jumps-over-350-points-shenzhen-up-1-28/articleshow/124204048.cms?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://static.toiimg.com/thumb/msid-124204220,width-1070,height-580,imgsize-72954,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "1": "https://static.toiimg.com/thumb/msid-124204220,imgsize-72954,width-400,resizemode-4/representative-image.jpg",
        "2": "https://static.toiimg.com/thumb/imgsize-327339,msid-124203882,width-375,resizemode-4/124203882.jpg",
        "3": "https://static.toiimg.com/thumb/imgsize-14754,msid-124179148,width-375,resizemode-4/124179148.jpg",
        "4": "https://static.toiimg.com/thumb/imgsize-24600,msid-124198496,width-375,resizemode-4/124198496.jpg"
      },
      "content": "# Asian stocks today: Markets mostly in green following US gains; HSI jumps over 350 points, Shenzhen up 1.28%\n\nAsian markets inched higher on Monday, lifted by Wall Street's gains after US inflation data met expectations and eased concerns about[US President Donald Trump](https://timesofindia.indiatimes.com/topic/us-president-donald-trump)'s latest tariff announcements.Hong Kong's HSI jumped 353 points or 1.35% to 26,482. Shenzhen also jumped 169 points or 1.28% to trade at 13,378 while Shanghai gained 6 points or 0.17% to reach 3,834.Tired of too many ads?go ad free nowSouth Korea's Kospi also inched 44 points or 1.3% to 3,430.Meanwhile, Japan's Nikkei fell 462 points or 1.02% to trade at 44,892 at 9.05 AM IST.Investors, however, remained cautious about the ongoing political deadlock in Washington, where lawmakers have yet to reach a funding agreement.All three major US indexes closed higher on Friday, breaking a three-day losing streak. The rebound came after the Federal Reserve’s preferred inflation measure, the personal consumption expenditures (PCE) index, rose 2.7 percent in August, slightly higher than July’s 2.6 percent but above the Fed’s two percent target.With a Tuesday deadline approaching, congressional leaders are set to meet President Trump to try and resolve the funding impasse, which could result in partial government closures. Democratic House leader Hakeem Jeffries told ABC he was “hopeful” a deal could be reached before the cutoff, while Senate Democratic leader Chuck Schumer echoed cautious optimism, noting that any progress would depend on Trump’s Republicans.Trump has maintained a firm stance on his agenda, cancelling a meeting last week with senior opposition leaders. That discussion is now scheduled for Monday.Despite the political uncertainty, most Asian markets remained positive.Oil prices fell on speculation that OPEC+ may raise output, raising concerns about oversupply.The drop came after last week’s rally, which had been fuelled by growing tensions between Nato countries and Russia, with the threat of fresh sanctions on Moscow.\n\n##### About the Author\n\nTOI Business Desk\n\nThe TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Top Asian News 10:29 a.m. GMT",
      "url": "https://www.yahoo.com/news/articles/top-asian-news-5-48-040000993.html?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://s.yimg.com/cv/apiv2/games/images/DST_yahoous_banner_600x400_174kb.png"
      },
      "content": "Top Asian News 12:46 a.m. GMT\n\nReturn to Homepage\n\n## Top Stories:\n\n- [Michigan church shooting and fire](https://www.yahoo.com/news/articles/multiple-people-shot-mormon-church-153629584.html) - [American released by Taliban](https://www.yahoo.com/news/articles/american-citizen-released-taliban-9-175837565.html) - [N.C. mass shooting](https://www.yahoo.com/news/articles/3-killed-8-injured-north-095250867.html) - [Tropical Storm Imelda](https://www.yahoo.com/news/articles/us-braces-storm-expected-hit-093025657.html) - [Trump's economic priorities](https://finance.yahoo.com/news/three-headed-problem-thats-throwing-160801171.html) - [Shutdown deadline looms](https://www.yahoo.com/news/politics/article/why-is-the-government-on-the-brink-of-a-shutdown-what-does-that-mean-and-is-there-any-hope-of-a-deal-214625413.html) - [More Epstein files released](https://www.yahoo.com/news/articles/elon-musk-prince-andrew-named-200854494.html) - [4 dead in Arizona flooding](https://www.yahoo.com/news/articles/arizona-flooding-kills-4-causes-204700257.html) - [Child vaccination timeline](https://www.yahoo.com/news/articles/delaying-child-shots-why-professionals-174219799.html) - [City troop deployment update](https://www.yahoo.com/news/articles/trump-says-hell-send-troops-144134139.html)\n\nTop diplomats of North Korea, China agree to deepen ties and resist hegemonismSEOUL, South Korea (AP) — The foreign ministers of North Korea and China agreed to deepen bilateral ties and resist hegemonism or unilateralism, a likely reference to their pushbacks against the United States. Their meeting in Beijing on Sunday came about three weeks after North Korean leader Kim Jong Un and Chinese President Xi Jinping held their first summit in more than six years and pledged mutual support and enhanced cooperation. Kim and Xi earlier attended a massive Beijing military parade marking the end of the World War II, with other world leaders including Russian President Vladimir Putin. The joint appearance of Kim, Xi and Putin, the first of its kind, displayed a potential three-way unity against the United States, though it's unclear how far China would go in such an anti-U.S.\n\n- [About Our Ads](https://legal.yahoo.com/us/en/yahoo/privacy/adinfo/index.html)\n\n## Play Daily Sudoku Together\n\nNew Release: Unlimited puzzles across 14 levels!New Release: Unlimited puzzles across 14 levels!\n\nDaily Sudoku TogetherPlay on Yahoo\n\nAdvertisement\n\nAdvertisement",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "AJA Newsbites – September 28, 2025 - THE AsiaN",
      "url": "https://theasian.asia/archives/202711?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://theasian.asia/wp-content/uploads/2025/08/image-1.png",
        "1": "https://theasian.asia/wp-content/uploads/2025/07/image-357x220.png",
        "2": "https://theasian.asia/wp-content/uploads/2025/06/AJA-1-357x220.png",
        "3": "https://theasian.asia/wp-content/uploads/2025/06/image-357x220.png"
      },
      "content": "AJA Newsbites is a curated roundup of major news and developments from across Asia, brought to you by members of Asia Journalist Association (AJA)\n\nLee Sang-ki, THE AsiaN, KoreaOn September 26, a fire at the National Computing and Information Resources Service in Daejeon crippled Korea’s government network, causing widespread disruption across the country. A total of 647 services were shut down, including Government24, real estate transactions, postal banking, and mobile ID systems. Airports and ports experienced boarding delays as ID issuance was halted, while ATMs and postal cards became unusable, deepening public inconvenience. With the Chuseok holiday fast approaching, concerns over potential logistics disruptions are mounting. Citizens were unable to file civil complaints, finalize insurance contracts, or access local government services, and official government email systems also went offline. Coming just two years after the last major outage, the shutdown has further fueled growing public frustration and outrage.\n\nChhay Sophal, Cambodia News Online, CambodiaCambodia’s Senate President, Samdech Techo Hun Sen, has submitted a proposal to the Malaysian military leadership — currently chairing the ASEAN-led Interim Observer Team (IOT) — calling for an accurate forensic analysis and on-site inspections regarding Thailand’s alleged ceasefire violation. The aim, he stated, is to ensure integrity, transparency, neutrality, and credibility in addressing the incident.Writing on his Facebook page Saturday night, Hun Sen claimed that the ceasefire breach involved the use of mortars and machine guns by Thai forces earlier that day. In response, he and Prime Minister Hun Manet held an emergency online meeting, directing Cambodia’s armed forces to exercise maximum restraint and avoid retaliation.Following the exchange of gunfire, both Cambodia and Thailand accused each other of violating the ceasefire. Hun Sen noted that each side had submitted complaints to the IOT, with Cambodia urgently requesting an on-site investigation by the observer team.\n\nNasir Aijaz, Sindh Courier, PakistanPakistan’s security forces have killed 17 terrorists in the Lakki Marwat district of Khyber Pakhtunkhwa province, which borders Afghanistan, the Inter-Services Public Relations (ISPR) said in a statement on Saturday.According to the military’s media wing, the operation was based on intelligence reports and was conducted overnight from September 26 to 27, targeting the reported presence of terrorists. “During the operation, troops successfully killed 17 terrorists,” the ISPR stated.Weapons and ammunition were recovered from the scene. The slain individuals had been actively involved in numerous terrorist activities targeting security forces and law enforcement agencies.\n\nPooneh Nedai, Shokaran Magazine, IranThe first Iranian Film Week in South Korea was held from September 23 to 26 in Seoul, hosted by the Embassy of the Islamic Republic of Iran with support from the Korean Film Archive. As the country’s main state cinema institution, the Archive played a key role in organizing the cultural event.Four Iranian films — A Cube of Sugar, The Painting Pool, In the Embrace of the Tree, and Angels Come Together — were screened at the Seoul Cinematheque. The opening ceremony, attended by diplomats, Koreans, and Iranians, featured A Cube of Sugar and was met with strong audience appreciation.This event marked the first official showcase of Iranian cinema in South Korea, fostering cultural exchange and strengthening ties between the two countries.\n\n### AJA Newsbites\n\n### Author's other articles\n\n### AJA Newsbites – July 26, 2025\n\n### AJA Newsbites – July 7, 2025\n\n### AJA Newsbites – June 17, 2025\n\n### AJA Newsbites – August 26, 2025",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Asian cricket chief Mohsin Naqvi’s provocative social media reposts one of the reasons for India cricketers refusing to accept trophy from him | Cricket News - The Indian Express",
      "url": "https://indianexpress.com/article/sports/cricket/india-snub-mohsin-naqvi-asia-cup-winners-trophy-10277255/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://images.indianexpress.com/2025/09/ind-pak-56.jpg",
        "1": "https://images.indianexpress.com/2025/08/Google-button-2.gif",
        "2": "https://images.indianexpress.com/2025/09/ind-pak-56.jpg?w=640",
        "3": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
        "4": "https://images.indianexpress.com/2025/09/ind-pak-56.jpg?resize=150,83"
      },
      "content": "Asian cricket chief Mohsin Naqvi’s provocative social media reposts one of the reasons for India cricketers refusing to accept trophy from him\n\n\"I have never seen a champion (team) not getting a trophy. We deserved it,\" says India captain Suryakumar Yadav; Mohsin Naqvi, the Pakistan Cricket Board (PCB) chairman, is also the country's Interior Minister.\n\nThe drama continued long after **India beat Pakistan in a final-over thriller** to win the Asia Cup as Suryakumar Yadav’s team refused to accept the trophy from the Asia Cricket Council (ACC) chief Mohsin Naqvi, the Pakistan Cricket Board (PCB) chairman who is also the country’s Interior Minister. With Naqvi insisting that he would give away the trophy, the ceremony was delayed by over an hour before it wound up without a trophy presentation.\n\nThe Indian players, it is understood, were ready to receive the trophy from Vice Chairman of the Emirates Cricket Board Khalid Al Zarooni. But Naqvi refused to give in. As the delay dragged on, the trophy was taken away by officials.\n\nAccording to sources, the immediate trigger for the Indian cricketers refusing to accept the trophy from Naqvi was his reposting of images on X — including one titled ‘Final Day’ in which Pakistan cricketers, including captain Salman Agha and fast bowler Shaheen Shah Afridi, are seen wearing flight suits with images of airborne fighter jets in the background. Earlier during the tournament, Naqvi had posted a picture of Cristiano Ronaldo depicting a crashing plane.\n\nTeam India poses for a photograph after winning the Asia Cup cricket final against Pakistan at Dubai International Cricket Stadium, United Arab Emirates, Sunday, Sept. 28, 2025. (AP Photo/Altaf Qadri)\n\n“I have never seen a champion (team) not getting a trophy. We deserved it. The real trophies are my 14 colleagues and they will stay in my memory,” India captain [Suryakumar Yadav](https://indianexpress.com/about/suryakumar-yadav/) said in the post-match media briefing.\n\nThis was the **third meeting of India and Pakistan** in the tournament. The first two were marked by comfortable wins for India — and very fraught references to a rivalry that wasn’t quite cricket. India had refused to shake hands with the Pakistani players from their first game here, with Suryakumar dedicating the win at the time to the families of victims of the Pahalgam terror attack that killed 26 people.\n\nAlso Read | Asia Cup | BCCI secy Devajit Saikia to Pak board chief Mohsin Naqvi: ‘Return Trophy and medals as soon as possible’\n\nDays after the Pahalgam attack, India had retaliated with Operation Sindoor, targeting terror infrastructure in PoK and Pakistan and triggering a tense military standoff in April-May lasting three days.\n\n> I have never seen a champion (team) not getting a trophy. We deserved it.\n\nIn Dubai, the relationship between the two sides turned sour after the no-handshake gesture. Subsequently, Naqvi supported a move for the team to boycott the rest of the Asia Cup. “If we had to go to boycott, which was a very big decision — the prime minister, government officials and lots of other people were also involved, and we got their full support. We were monitoring the issue,” he said during a press conference in Lahore. “We believe that politics and sports can’t go together. This is sports, and let it remain a sport. Cricket should be separate from all this,” he added.\n\nStory continues below this ad\n\nOn Sunday night, India’s cricketers only stepped onto the podium at the Dubai International Stadium to receive individual awards from other dignitaries. Then, the players quickly left the stadium.\n\nIn fact, there were signs immediately after the match that the awards ceremony would be delayed. Almost 20 minutes had passed after Rinku Singh hit the winning runs and the organisers had erected the dais. Pakistan’s cricketers had retreated to the dressing room. The Indians were scattered on one side of the ground. Nothing happened. Officials were spotted walking urgently to resolve the issue. Umpires and the match referee did their round of negotiations, but to little evident result.\n\nThe delay prompted boos from the stands, by then half empty and with only a few Indian supporters remaining. On TV, commentator Ravi Shastri said it was ridiculous for the players to have to wait for 45 minutes for the presentation after the game’s conclusion.",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Asian drug market stocks slides: Trump’s 100% pharmaceutical tariffs shake market; broader impact on Japan likely minimal - The Times of India",
      "url": "https://timesofindia.indiatimes.com/business/international-business/asian-drug-market-stocks-slides-trumps-100-pharmaceutical-tariffs-shake-market-broader-impact-on-japan-likely-minimal/articleshow/124149791.cms?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://static.toiimg.com/thumb/msid-124149992,width-1070,height-580,imgsize-913862,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "1": "https://static.toiimg.com/thumb/imgsize-14754,msid-124179148,width-375,resizemode-4/124179148.jpg",
        "2": "https://static.toiimg.com/thumb/imgsize-1229607,msid-124169679,width-375,resizemode-4/124169679.jpg",
        "3": "https://static.toiimg.com/thumb/imgsize-860637,msid-124184248,width-375,resizemode-4/124184248.jpg",
        "4": "https://static.toiimg.com/thumb/imgsize-21382,msid-124189929,width-375,resizemode-4/124189929.jpg"
      },
      "content": "# Asian drug market stocks slides: Trump’s 100% pharmaceutical tariffs shake market; broader impact on Japan likely minimal\n\nAsian drug stocks fell on Friday as investors reacted to[US President Donald Trump](https://timesofindia.indiatimes.com/topic/us-president-donald-trump)’s threat to impose 100% tariffs on imported branded pharmaceuticals starting October 1.Companies without existing US manufacturing plants could face the full impact, triggering declines across major drugmakers in South Korea, Japan, and Hong Kong.Tired of too many ads?go ad free nowIndian Pharmaceutical Industry Unfazed by Trump’s 100% Tariff on Imported Medicines, Denies ImpactIn South Korea, Samsung Biologics fell 1.6%, while SK Biopharmaceuticals slid 2.6%. Celltrion, which recently acquired ImClone Systems from Eli Lilly in the United States for $330 million, rose 1.3% after recouping earlier losses.In Japan, Sumitomo Pharma tumbled 4.3%, Otsuka Holdings dropped 3.5%, and Daiichi Sankyo lost 1.6%. Takeda added 0.2%, and Shionogi gained 1.3%.Meanwhile, Hong Kong’s Hang Seng Biotech Index fell about 2.58%.Markets had already been braced for further tariffs and investigations by the US commerce department, said Carol Kong, economist and currency strategist at Commonwealth Bank of Australia in Sydney.\"The sectoral tariffs are here to stay because those have proven to be more legally sound than the emergency tariffs that the lower courts judged to be illegal,\" she said.\"Sectoral tariffs are going to push the US government's effective tariff rate a little bit high - it was about 10% in August, we expect the global effective tariff rate to edge further to about 18% in the coming months,” added Kong, as quoted by Reuters.Kong added that the broader impact on economies like Japan and Australia may be fairly limited.\n\n##### About the Author\n\nTOI Business Desk\n\nThe TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "School Assembly News Headlines (September 28): Asian Cup final, S Jaishankar at UNGA, Sonam Wangchuk arrest & more",
      "url": "https://indianexpress.com/article/education/school-assembly-news-headlines-today-september-28-india-pak-asian-cup-match-un-s-jaishankar-speech-sonam-wangchuk-10276395/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://images.indianexpress.com/2025/09/school-assembly-news-headlines-1-1.jpg",
        "1": "https://images.indianexpress.com/2025/08/Google-button-2.gif",
        "2": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
        "3": "https://images.indianexpress.com/2025/01/Untitled-design-2025-01-23T134754.684.jpg?resize=450,253",
        "4": "https://images.indianexpress.com/2025/01/Untitled-design-2025-01-22T192057.941.jpg?resize=450,253"
      },
      "content": "School Assembly News Headlines (September 28): India wins Asia Cup, S Jaishankar at UNGA, Sonam Wangchuk arrest & more\n\nHere are the top School Assembly News Headlines for September 28: Today’s school assembly headlines highlight Sonam Wangchuk's detainment under the NSA, United Nations General Assembly speeches by S Jaishankar and the Russian foreign minister, to no sanctions on Russian oil and of course, the final Asian Cup match between India and Pakistan.\n\n**Here are the top School Assembly News Headlines for September 28:**Here are the top School Assembly News Headlines for September 28. Today’s school assembly headlines highlight Sonam Wangchuk’s detainment under the NSA, United Nations General Assembly speeches by S Jaishankar and the Russian foreign minister, to no sanctions on Russian oil and of course, the final Asian Cup match between India and Pakistan.\n\n## National News\n\n[Climate activist Sonam Wangchuk was detained under the National Security Act (NSA) by the police in Leh on Friday.](https://indianexpress.com/article/india/sonam-wangchuk-detained-press-conference-address-drama-leh-10272906/)\n\nWithout naming Pakistan, EAM S Jaishankar referred to a “neighbour that is an epicentre of global terrorism” (File Photo)\n\n[Underlining that “major international terrorist attacks are traced back to that one country](https://indianexpress.com/article/india/terror-attacks-traced-to-that-one-country-jaishankar-targets-pakistan-at-un-general-assembly-10275579/), External Affairs Minister S Jaishankar targeted Pakistan at the United Nations General Assembly.\n\nThe [Cold Desert Biosphere Reserve (CDBR) in Himachal Pradesh](https://indianexpress.com/article/india/himachal-cold-desert-enters-unesco-biosphere-reserve-list-10275673/) has been included in the World Network of Biosphere Reserves (WNBR) by UNESCO.\n\n## World News\n\n[NATO has said that it will upgrade its mission in the Baltic Sea with an air defence frigate and other assets.](https://indianexpress.com/article/world/denmark-drone-incident-nato-to-increase-presence-in-baltic-10275817/)\n\nRussia’s Minister for Foreign Affairs Sergei Lavrov addresses the 80th session of the United Nations General Assembly, at UN headquarters. (AP Photo)\n\n[Russia’s foreign minister Sergei Lavrov has told the United Nations](https://indianexpress.com/article/world/russia-tells-un-no-intention-to-attack-eu-nato-10275744/) that Moscow has no intention of attacking Europe or NATO countries.\n\nThe US [has revoked the visa of Colombian President Gustavo Petro after he urged American](https://indianexpress.com/article/world/us-revokes-visa-colombia-president-american-soldiers-disobey-trump-10275209/) soldiers to disobey orders from President Trump.\n\nStory continues below this ad\n\n## Business News\n\n[Union Petroleum and Natural Gas Minister Hardeep Singh Puri clarified](https://indianexpress.com/article/business/india-to-continue-russian-oil-imports-oil-minister-10273502/) that there are no sanctions on Russian oil purchases, only price caps.\n\nHardeep Singh Puri\n\n[Indian households added to their wealth at a faster clip in 2024](https://indianexpress.com/article/business/indian-household-wealth-jumps-2024-securities-surge-29-pc-growth-10272125/), with gross financial assets rising 14.5 per cent during the year.\n\n## Sports News\n\nNepal marked a historic moment in international T20 cricket with a 19-run victory over the West Indies in the opening match of their three-game T20I series held at Sharjah Cricket Stadium.\n\nMithun Manhas has been appointed as the president of the Board of Control for Cricket in India (BCCI).\n\nStory continues below this ad\n\n[India beats Pakistan in the 2025 Asia Cup, however,](https://indianexpress.com/article/sports/cricket/india-snub-mohsin-naqvi-asia-cup-winners-trophy-10277255/?ref=breaking_hp) they refused to accept the trophy from the Asia Cricket Council (ACC) chief Mohsin Naqvi,\n\n## Education News\n\nCentre tweaks recruitment rules[for Eklavya residential schools](https://indianexpress.com/article/education/centre-norms-hindi-competency-eklavua-residential-school-staff-exam-10276975/?ref=newlist_hp)\n\n[Union Public Service Commission (UPSC)](https://indianexpress.com/about/upsc/) Chairman [Ajay Kumar is set to engage directly with civil service aspirants](https://indianexpress.com/article/education/upsc-chairman-to-have-first-live-interaction-with-cse-aspirants-on-october-1-10275904/) across India through a virtual town hall on October 1.\n\nAccording to an official communique released on Friday, the live interaction will be broadcast by DD News via its YouTube channel on October 1, from noon to 1 pm.(Photo Credit: X/@drajaykumar_ias)\n\n[NCERT](https://indianexpress.com/about/ncert/) will grant equivalence to [Class 10 and 12 certificates awarded by various school education boards](https://indianexpress.com/article/education/ncert-grant-equivalence-class-10th-12th-certificates-across-all-school-education-boards-10274330/) in India for admissions in higher education institutions and recruitment for government jobs.",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Asia en EL PAÍS",
      "url": "https://elpais.com/noticias/asia/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://imagenes.elpais.com/resizer/v2/https%3A%2F%2Farc-anglerfish-eu-central-1-prod-prisa.s3.amazonaws.com%2Fpublic%2FPSMME3J7ZBDOHK4S6ZIIFVDEAQ.png?auth=6297c6ea5303b046503b1d9ef9d5cf46f4eacf1583ad6d61346d8fc8d9f9c948&width=300&height=300&smart=true",
        "1": "https://imagenes.elpais.com/resizer/v2/M63NA4KL4BEWHPM34SDH2YKUR4.jpg?auth=c45efb4898e0e39548daf8c3982c65a862b2f541b73dfe087108fc0141993832&width=414&height=233&smart=true",
        "2": "https://imagenes.elpais.com/resizer/v2/S2YDDWPT3JHERKBRMRHD65C5YE.jpg?auth=66639f848ef284b229063cf476ee63bb4bbd94fbd47f43a5781c9d0262630091&width=414&height=311&smart=true",
        "3": "https://imagenes.elpais.com/resizer/v2/EZYZBXVUXRCSNBHYY7FAVTB6D4.jpg?auth=c9388e3639576db560b0ff105ea74ff290b00fabe36539cddfd048ccfd8e3607&width=414&height=311&smart=true",
        "4": "https://imagenes.elpais.com/resizer/v2/ETJSUJQS6ZBIHB2SFUX6SK2ZPE.jpg?auth=1aad6eff427dbe5a4a14e0b9ddca96c79216c9e584b52e52a1e209c231b47597&width=414&height=311&smart=true"
      },
      "content": "Asia en EL PAÍS\n\nAgencias|Hanói|28 sept 2025 - 11:46 CEST\n\nLas autoridades cierran cuatro aeropuertos a la espera de que la tormenta toque tierra en el centro del país a última hora de este domingo\n\nAgencias|Chennai (India)|28 sept 2025 - 10:38 CEST\n\nLa policía del Estado de Tamil Nadu presenta una denuncia contra el partido TVK del popular actor Vijay\n\n[Use Lahoz](https://elpais.com/autor/use-lahoz/)|28 sept 2025 - 05:30 CEST\n\nUn viaje para saborear lento que revela la cultura, el carácter y las costumbres de Tailandia entre templos, los imprescindibles ‘seven eleven’ o su imbatible gastronomía\n\n[El País](https://elpais.com/autor/el-pais/)|Madrid|25 sept 2025 - 14:01 CEST\n\nEl estreno del largometraje australiano se pospone después de que en redes sociales se comparasen fragmentos de la versión original y la local con el cambio\n\n[Guillermo Abril](https://elpais.com/autor/guillermo-abril/)|Pekín|25 sept 2025 - 11:48 CEST\n\nPekín sostiene que las acusaciones sobre violaciones de derechos humanos contra la minoría uigur del territorio son una “manipulación”\n\n[El País](https://elpais.com/autor/el-pais/)|24 sept 2025 - 14:10 CEST\n\nLa fuerza del agua ha hecho estallar la puerta de entrada de un hotel y ha inundado la parte de la entrada, arrastrando a las personas y los objetos del interior\n\n[Guillermo Abril](https://elpais.com/autor/guillermo-abril/)|Pekín|24 sept 2025 - 03:28 CEST\n\nLa ciudad financiera amanece bajo el nivel de alerta 10, el máximo, golpeada por vientos huracanados y lluvias torrenciales\n\n[El País](https://elpais.com/autor/el-pais/)|23 sept 2025 - 11:21 CEST\n\nAl menos tres personas han muerto y nueve han resultado heridas en Filipinas por el paso del supertifón Ragasa, la mayor tormenta del año, que tocó tierra el lunes en el norte del archipiélago y obligó a evacuar a miles de personas\n\nAgencias / [Guillermo Abril](https://elpais.com/autor/guillermo-abril/)|Manila / Pekín|23 sept 2025 - 10:33 CEST\n\nLa provincia china de Cantón se prepara para los fuertes vientos y lluvias con la evacuación de 400.000 personas y la paralización de aviones y trenes\n\nAgencias|Manila|22 sept 2025 - 10:23 CEST\n\nEl aeropuerto de Hong Kong, uno de los mayores de Asia, cerrará durante un día y medio por los fuertes vientos y lluvias\n\n[Sara Cucala](https://elpais.com/autor/sara-fernandez-cucala/)|21 sept 2025 - 05:25 CEST\n\nUn libro ilustrado y una guía viajera nos conducen al corazón cultural e histórico de la India\n\n[Amaia Odriozola](https://elpais.com/autor/amaia-odriozola-olloquiegui/)|19 sept 2025 - 05:30 CEST\n\nDesde hace 150 años es un símbolo de la infancia. Se elabora de manera artesanal y se usa durante toda la educación primaria. Los modelos más lujosos pueden llegar a los 1.000 euros\n\n[EL PAÍS Exprés](https://elpais.com/autor/el-pais-expres/)|16 sept 2025 - 06:55 CEST\n\n[Adrián Rodríguez](https://elpais.com/autor/adrian-rodriguez-perez/)|16 sept 2025 - 05:29 CEST\n\nA los imprescindibles de Bangkok, en Chiang Rai, Ayutthaya y Chiang Mai esperan otras joyas arquitectónicas que mezclan cultura, tradición, arte e historia\n\n[Guillermo Abril](https://elpais.com/autor/guillermo-abril/)|Pekín|15 sept 2025 - 13:50 CEST\n\nLa ONU denuncia en un informe el deterioro de los derechos humanos y el creciente aislamiento del país asiático\n\n[Inma Bonet](https://elpais.com/autor/inmaculada-bonet-bailen/) / [Guillermo Abril](https://elpais.com/autor/guillermo-abril/)|Pekín|12 sept 2025 - 17:30 CEST\n\nLa expresidenta del Tribunal Supremo Sushila Karki era la candidata propuesta por los jóvenes de la generación Z que lideraron las manifestaciones\n\n[El País](https://elpais.com/autor/el-pais/) / Agencias|Madrid|12 sept 2025 - 16:41 CEST\n\nScott Bessent aprovechará su visita a España y al Reino Unido para encontrarse cara a cara con el vice primer ministro chino He Lifeng\n\n[Inma Bonet](https://elpais.com/autor/inmaculada-bonet-bailen/)|Pekín|12 sept 2025 - 13:38 CEST\n\nEl presidente Lee Jae-myung avisa de que el episodio complica futuras inversiones en suelo estadounidense\n\n[Guillermo Abril](https://elpais.com/autor/guillermo-abril/)|Pekín|11 sept 2025 - 09:17 CEST\n\nEntre los posibles candidatos para liderar el Ejecutivo provisional está Sushila Karki, expresidenta del Tribunal Supremo\n\n[Inma Bonet](https://elpais.com/autor/inmaculada-bonet-bailen/) / [Guillermo Abril](https://elpais.com/autor/guillermo-abril/)|Pekín|11 sept 2025 - 05:40 CEST\n\nEl profundo malestar por la falta de oportunidades y frustración con una élite política enquistada lleva a miles de jóvenes a desafiar al Gobierno en las calles de Katmandú\n\n[El País](https://elpais.com/autor/el-pais/)|10 sept 2025 - 12:57 CEST\n\nEl inmueble fue incendiado por los manifestantes, según afirman medios locales, junto con otros edificios gubernamentales como el Parlamento\n\n[Guillermo Abril](https://elpais.com/autor/guillermo-abril/)|Pekín|10 sept 2025 - 11:40 CEST\n\nLos jóvenes que impulsaron las primeras protestas tratan de desmarcarse de los actos de vandalismo\n\n[El País](https://elpais.com/autor/el-pais/)|Madrid|09 sept 2025 - 16:24 CEST\n\nLos manifestantes prenden fuego a los lugares de poder mientras dimiten ministros del Gobierno\n\n[Inma Bonet](https://elpais.com/autor/inmaculada-bonet-bailen/)|Pekín|09 sept 2025 - 13:13 CEST\n\nEl exgobernante, padre de la primera ministra cesada a finales de agosto, ha sido la figura política más influyente del país en las últimas dos décadas\n\n[Guillermo Abril](https://elpais.com/autor/guillermo-abril/)|Pekín|09 sept 2025 - 05:45 CEST\n\nLos manifestantes de la “generación Z” queman el Parlamento del país en una tensa jornada en la que los ciudadanos han desafiado los toques de queda\n\n[Reuters](https://elpais.com/autor/reuters/)|Katmandú|08 sept 2025 - 18:05 CEST\n\nEl Gobierno vetó a varias plataformas, entre ellas Facebook, tras alegar que no se inscribieron en un registro para combatir el odio y las noticias falsas\n\n[Andrés Mourenza](https://elpais.com/autor/andres-mourenza-urbina/)|Estambul|08 sept 2025 - 16:03 CEST\n\nLa intervención de la mayor agrupación socialdemócrata dispara la tensión entre el Gobierno y el CHP\n\n[Wilfredo Miranda Aburto](https://elpais.com/autor/wilfredo-miranda-aburto/)|San José (Costa Rica)|08 sept 2025 - 11:30 CEST\n\nEl auge de comercios regentados por ciudadanos del país asiático arrincona a las pequeñas tiendas locales y se extiende al sector inmobiliario y minero. Un 75% de los nicaragüenses lo rechaza\n\n[Guillermo Abril](https://elpais.com/autor/guillermo-abril/)|Pekín|07 sept 2025 - 11:06 CEST\n\nShigeru Ishiba seguirá en el cargo hasta que su partido, derrotado en las elecciones de julio, designe a un sucesor\n\n[Inma Bonet](https://elpais.com/autor/inmaculada-bonet-bailen/)|Pekín|05 sept 2025 - 12:45 CEST\n\nAnutin Charnvirakul dirigirá el país tras la abrupta salida de la anterior gobernante, que había criticado al ejército\n\n[EFE](https://elpais.com/autor/agencia-efe/)|Seúl|04 sept 2025 - 13:22 CEST\n\nEl dirigente toma medidas especiales para no dejar rastros biológicos en su viaje a China, mientras su entorno limpia sus huellas en todos los objetos que usa\n\n[EFE](https://elpais.com/autor/agencia-efe/)|Senggigi (Indonesia)|04 sept 2025 - 10:13 CEST\n\nTodo apunta a que la mujer fue asesinada por un empleado del hotel donde se alojaba y un extrabajador del mismo\n\nAnnie Philip|Bangalore (India)|04 sept 2025 - 05:30 CEST\n\nLa máxima corte había ordenado que, para este verano, se conformara un comité para expedir una norma centralizada para garantizar los derechos laborales de millones de empleadas. Pero no hay rastro de este ni de otros compromisos del Gobierno\n\n[Ana López García](https://elpais.com/autor/ana-lopez-garcia/)|Madrid|04 sept 2025 - 05:30 CEST\n\nLa organización, dirigida por mujeres, ha logrado llegar a la región, donde ya atiende a 1.000 familias e intenta salvar vidas, pese a la reducción de las ayudas y las restricciones de los talibanes\n\n[Inma Bonet](https://elpais.com/autor/inmaculada-bonet-bailen/)|Pekín|03 sept 2025 - 16:32 CEST\n\nEl líder norcoreano coincide por primera vez en Pekín en un evento multilateral con otros mandatarios, uno de sus movimientos diplomáticos más trascendentes\n\n[EFE](https://elpais.com/autor/agencia-efe/)|03 sept 2025 - 12:32 CEST\n\nLa policía encontró el 30 de agosto el cadáver de la turista española en una playa de la isla de Lombok\n\n[EFE](https://elpais.com/autor/agencia-efe/)|Washington|03 sept 2025 - 11:11 CEST\n\nEl presidente recuerda a su homólogo chino el sacrificio de los soldados estadounidenses para ayudar a China durante la II Guerra Mundial\n\n[Reuters](https://elpais.com/autor/reuters/)|Seúl|02 sept 2025 - 16:48 CEST\n\nEl mandatario ha llegado a Pekín este martes a bordo del ferrocarril lento usado desde hace décadas por sus predecesores\n\n[Guillermo Abril](https://elpais.com/autor/guillermo-abril/) / [Inma Bonet](https://elpais.com/autor/inmaculada-bonet-bailen/)|Pekín|02 sept 2025 - 16:37 CEST\n\nPekín intensifica su campaña sobre la “visión correcta de la historia” por el 80º aniversario de la rendición de Japón en la Segunda guerra sino-japonesa y la conclusión de la contienda global\n\nAgencias|Jalalabad / Kabul|02 sept 2025 - 10:29 CEST\n\nLos rescatistas tratan de acceder a las aldeas más remotas y los hospitales, desbordados, continúan recibiendo heridos",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "兩岸 - 中時新聞網",
      "url": "https://www.chinatimes.com/chinese/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://images.chinatimes.com/newsphoto/2025-09-29/1024/20250929002114.jpg",
        "1": "https://images.chinatimes.com/newsphoto/2025-09-29/656/20250929001661.jpg",
        "2": "https://images.chinatimes.com/newsphoto/2025-09-29/656/20250929000750.jpg",
        "3": "https://images.chinatimes.com/newsphoto/2025-09-29/656/20250929000695.jpg",
        "4": "https://images.chinatimes.com/newsphoto/2025-09-29/656/20250929000720.jpg"
      },
      "content": "# 習主持中央政治局會議 四中會議1020北京召開\n\n# 羅冠聰赴星遭拘留 訊問數小時後拒絕入境\n\n# 減排目標缺乏雄心？ 澳學者：中國會超額完成任務\n\n# 在福建艦彈射意味？央視詳解空警-600硬核戰力\n\n# 每周368次航班！韓對陸團客免簽今生效 助旅遊需求噴發\n\n# 世界第一高橋通車！貴州花江峽谷大橋 2分鐘跨越天塹\n\n# 三星堆驚人發現！學者揭外來勢力入侵與葬俗消失之謎\n\n# 颱風放假補班被投訴 深圳貿易公司：改為正常休假但「取消14天年假」\n\n# 酒後開自駕…自己坐到副駕睡覺20分鐘 杭州男被判拘役45天＋罰金1.7萬元\n\n# 羅冠聰赴新加坡被拘留 訊問數小時後「拒絕入境」\n\n- 陸自主研製載人飛艇「祥雲」 完成首次高原地區低空飛行 16:402025/09/29 兩岸 陸自主研製載人飛艇「祥雲」 完成首次高原地區低空飛行\n\n### 陸自主研製載人飛艇「祥雲」 完成首次高原地區低空飛行\n\n陸自主研製載人飛艇「祥雲」 完成首次高原地區低空飛行\n\n- 謝鋒籲美應尊重事實 停止散布「台灣地位未定」謬論 16:012025/09/29 兩岸 謝鋒籲美應尊重事實 停止散布「台灣地位未定」謬論\n\n### 謝鋒籲美應尊重事實 停止散布「台灣地位未定」謬論\n\n謝鋒籲美應尊重事實 停止散布「台灣地位未定」謬論\n\n- 習近平主持中共中央政治局會議 20屆四中10／20北京召開 15:572025/09/29 兩岸 習近平主持中共中央政治局會議 20屆四中10／20北京召開\n\n### 習近平主持中共中央政治局會議 20屆四中10／20北京召開\n\n習近平主持中共中央政治局會議 20屆四中10／20北京召開\n\n- 批美國對香港投資環境報告失之偏頗 港府表達強烈不滿 14:472025/09/29 兩岸 批美國對香港投資環境報告失之偏頗 港府表達強烈不滿\n\n### 批美國對香港投資環境報告失之偏頗 港府表達強烈不滿\n\n批美國對香港投資環境報告失之偏頗 港府表達強烈不滿\n\n- 羅冠聰赴新加坡被拘留 訊問數小時後「拒絕入境」 13:362025/09/29 兩岸 羅冠聰赴新加坡被拘留 訊問數小時後「拒絕入境」\n\n### 羅冠聰赴新加坡被拘留 訊問數小時後「拒絕入境」\n\n羅冠聰赴新加坡被拘留 訊問數小時後「拒絕入境」\n\n- 減排目標缺乏雄心？ 澳學者：每個人都知道中國會超額完成任務 08:492025/09/29 兩岸 減排目標缺乏雄心？ 澳學者：每個人都知道中國會超額完成任務\n\n### 減排目標缺乏雄心？ 澳學者：每個人都知道中國會超額完成任務\n\n減排目標缺乏雄心？ 澳學者：每個人都知道中國會超額完成任務\n\n- 每周368次航班！韓對陸團客免簽今生效 助旅遊需求噴發 08:432025/09/29 兩岸 每周368次航班！韓對陸團客免簽今生效 助旅遊需求噴發\n\n### 每周368次航班！韓對陸團客免簽今生效 助旅遊需求噴發\n\n每周368次航班！韓對陸團客免簽今生效 助旅遊需求噴發\n\n- 陸高票連任國際民航組織ICAO一類理事國 08:372025/09/29 兩岸 陸高票連任國際民航組織ICAO一類理事國\n\n### 陸高票連任國際民航組織ICAO一類理事國\n\n陸高票連任國際民航組織ICAO一類理事國\n\n- 在福建艦彈射意味著什麼？央視詳解空警-600硬核戰力 08:332025/09/29 兩岸 在福建艦彈射意味著什麼？央視詳解空警-600硬核戰力\n\n### 在福建艦彈射意味著什麼？央視詳解空警-600硬核戰力\n\n在福建艦彈射意味著什麼？央視詳解空警-600硬核戰力\n\n- 16-59歲勞動年齡8億5798萬 陸統計局：人口紅利依然在 08:202025/09/29 兩岸 16-59歲勞動年齡8億5798萬 陸統計局：人口紅利依然在\n\n### 16-59歲勞動年齡8億5798萬 陸統計局：人口紅利依然在\n\n16-59歲勞動年齡8億5798萬 陸統計局：人口紅利依然在\n\n- 「反內卷」現成果？8月規模以上工業企業利潤大增逾20％ 07:522025/09/29 兩岸 「反內卷」現成果？8月規模以上工業企業利潤大增逾20％\n\n### 「反內卷」現成果？8月規模以上工業企業利潤大增逾20％\n\n「反內卷」現成果？8月規模以上工業企業利潤大增逾20％\n\n- 我們必須去競爭 黃仁勳：中國晶片僅落後美國「幾奈秒」 07:402025/09/29 兩岸 我們必須去競爭 黃仁勳：中國晶片僅落後美國「幾奈秒」\n\n### 我們必須去競爭 黃仁勳：中國晶片僅落後美國「幾奈秒」\n\n我們必須去競爭 黃仁勳：中國晶片僅落後美國「幾奈秒」\n\n- 寧德時代派2000人赴歐建廠 西班牙官員讚汽車電池領先者 07:362025/09/29 兩岸 寧德時代派2000人赴歐建廠 西班牙官員讚汽車電池領先者\n\n### 寧德時代派2000人赴歐建廠 西班牙官員讚汽車電池領先者\n\n寧德時代派2000人赴歐建廠 西班牙官員讚汽車電池領先者\n\n- 圍繞八大領域 中日韓簽署新一期環境合作聯合行動計畫 07:252025/09/29 兩岸 圍繞八大領域 中日韓簽署新一期環境合作聯合行動計畫\n\n### 圍繞八大領域 中日韓簽署新一期環境合作聯合行動計畫\n\n圍繞八大領域 中日韓簽署新一期環境合作聯合行動計畫\n\n- 5歲男童「瞇眼看物」驚覺近視1000度 爺奶1方式育兒害慘他 07:222025/09/29 兩岸 5歲男童「瞇眼看物」驚覺近視1000度 爺奶1方式育兒害慘他\n\n### 5歲男童「瞇眼看物」驚覺近視1000度 爺奶1方式育兒害慘他\n\n5歲男童「瞇眼看物」驚覺近視1000度 爺奶1方式育兒害慘他\n\n- 熱歌勁舞 30塊人民幣的KTV 被打工人爆改成減肥營 07:172025/09/29 兩岸 熱歌勁舞 30塊人民幣的KTV 被打工人爆改成減肥營\n\n### 熱歌勁舞 30塊人民幣的KTV 被打工人爆改成減肥營\n\n熱歌勁舞 30塊人民幣的KTV 被打工人爆改成減肥營\n\n- 婚紗照新娘非本尊！人妻「掛客廳4年」傻爆眼 結局超展開 07:112025/09/29 兩岸 婚紗照新娘非本尊！人妻「掛客廳4年」傻爆眼 結局超展開\n\n### 婚紗照新娘非本尊！人妻「掛客廳4年」傻爆眼 結局超展開\n\n婚紗照新娘非本尊！人妻「掛客廳4年」傻爆眼 結局超展開\n\n- 警察來電：妳是在逃人員 誤以為詐騙！女子報案慘遭逮捕 07:072025/09/29 兩岸 警察來電：妳是在逃人員 誤以為詐騙！女子報案慘遭逮捕\n\n### 警察來電：妳是在逃人員 誤以為詐騙！女子報案慘遭逮捕\n\n警察來電：妳是在逃人員 誤以為詐騙！女子報案慘遭逮捕\n\n- 未竟的光復 繼續保衛釣魚台 04:102025/09/29 話題觀察 未竟的光復 繼續保衛釣魚台\n\n### 未竟的光復 繼續保衛釣魚台\n\n未竟的光復 繼續保衛釣魚台\n\n- 列黑名單 林孝信被拒回台17年 04:102025/09/29 話題觀察 列黑名單 林孝信被拒回台17年\n\n### 列黑名單 林孝信被拒回台17年\n\n列黑名單 林孝信被拒回台17年\n\n- 保釣運動 讓林孝信人生轉了彎 04:102025/09/29 話題觀察 保釣運動 讓林孝信人生轉了彎\n\n### 保釣運動 讓林孝信人生轉了彎\n\n保釣運動 讓林孝信人生轉了彎\n\n- 美盼HBM設廠 韓興致缺缺 04:102025/09/29 兩岸新聞 美盼HBM設廠 韓興致缺缺\n\n### 美盼HBM設廠 韓興致缺缺\n\n美盼HBM設廠 韓興致缺缺\n\n- 迦薩現轉機 美施壓以恐讓步 04:102025/09/29 兩岸新聞 迦薩現轉機 美施壓以恐讓步\n\n### 迦薩現轉機 美施壓以恐讓步\n\n迦薩現轉機 美施壓以恐讓步\n\n- 高市嗆可重談 韓拒付3500億美元 04:102025/09/29 兩岸新聞 高市嗆可重談 韓拒付3500億美元\n\n### 高市嗆可重談 韓拒付3500億美元\n\n高市嗆可重談 韓拒付3500億美元\n\n- 伊核談判破局 聯合國重啟制裁 04:102025/09/29 兩岸新聞 伊核談判破局 聯合國重啟制裁\n\n### 伊核談判破局 聯合國重啟制裁\n\n伊核談判破局 聯合國重啟制裁\n\n- 北韓外長訪華 傳邀習平壤閱兵 04:102025/09/29 兩岸新聞 北韓外長訪華 傳邀習平壤閱兵\n\n### 北韓外長訪華 傳邀習平壤閱兵\n\n北韓外長訪華 傳邀習平壤閱兵\n\n- 新聞透視》隔海問診 兩岸誤判風險增 04:102025/09/29 國際新聞 新聞透視》隔海問診 兩岸誤判風險增\n\n### 新聞透視》隔海問診 兩岸誤判風險增\n\n新聞透視》隔海問診 兩岸誤判風險增\n\n- 滿足窺探欲 真相淪其次 04:102025/09/29 國際新聞 滿足窺探欲 真相淪其次\n\n### 滿足窺探欲 真相淪其次\n\n滿足窺探欲 真相淪其次\n\n- 社評／柯克之死與國民黨的兩岸政策 04:102025/09/29 國際新聞 社評／柯克之死與國民黨的兩岸政策\n\n### 社評／柯克之死與國民黨的兩岸政策\n\n社評／柯克之死與國民黨的兩岸政策\n\n- 聽床師當道 中國研究新挑戰 04:102025/09/29 國際新聞 聽床師當道 中國研究新挑戰\n\n### 聽床師當道 中國研究新挑戰\n\n聽床師當道 中國研究新挑戰",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    },
    {
      "title": "Africa: All of Africa Today - September 29, 2025 - allAfrica.com",
      "url": "https://allafrica.com/stories/202509290087.html?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://cdn.allafrica.com/download/pic/main/main/csiid/00660790:31c3b799d93fc32e89804bf0300237d4:arc614x376:w1200.jpg",
        "1": "https://cdn.allafrica.com/download/pic/main/main/csiid/00660790:31c3b799d93fc32e89804bf0300237d4:arc614x376:w735:us1.jpg"
      },
      "content": "Africa: All of Africa Today - September 29, 2025\n\nAddToAny BEGIN\n\nAddToAny END\n\nAllAfrica AllAfrica logo\n\n/.figure.picture.story-header\"\n\n29 September 2025 allAfrica.com\n\n/.publisher-and-date\n\nBy Melody Chironda\n\n**Namibia Deploys Troops, Helicopters to Battle Massive Etosha Fire**\n\nNamibia is set to deploy helicopters and hundreds of soldiers to battle a [massive fire](https://allafrica.com/stories/202509290063.html)that has ravaged a third of Etosha National Park, one of southern Africa's top tourist attractions. It is also home to critically endangered black rhinos. The blaze, believed to have started at a charcoal production site outside the park on Monday, [spread](https://allafrica.com/stories/202509260065.html)into the reserve, killing at least nine antelope and destroying habitats and grazing land in the Omusati and Oshana regions near Angola. Opposition MP Likando Rodrick criticised the government for failing to contain the fire, urging better preparedness and stronger long-term response measures. At an emergency meeting, authorities decided to send 500 more troops to support firefighters, police, and volunteers already on the ground. Covering a total of 22,935 sq km (8,855 sq miles), Etosha National Park is one of the largest in Africa. Some 200,000 tourists visit the nature reserve every year, according to the government. Etosha hosts 114 mammal species and attracts hundreds of migratory birds, including flamingos.\n\n/.outer-ad-container.adsense-outer-ad-container.adsense-responsive-outer-ad-container.responsive-aans-view-a-container\n\n**Kenyan Police Rescue 22 from Trafficking Ring Linked to Ukraine War**\n\nFollow us on WhatsApp | LinkedIn for the latest headlines\n\nKenyan police [rescued](https://www.bbc.com/news/articles/cdxqjqjln1ko) 22 people from a suspected human trafficking ring that lured victims with fake job offers in Russia but intended to send them to fight in Ukraine. It follows an intelligence-led raid on a residential apartment on the outskirts of the capital, Nairobi, where officers seized recruitment materials, travel documents, and job offer letters. One suspect accused of coordinating the travel in September and October was arrested and remanded for 10 days to allow investigations. Authorities said the syndicate had extorted large sums from desperate job seekers, with victims signing contracts requiring payments of up to $18,000, some already having paid deposits of $1,500. Officials noted growing concerns about Kenyans being trafficked abroad under false promises, citing a young athlete who was recently captured in Ukraine after being duped into joining the Russian army. Police warned that many recruits return home injured, traumatised, or not at all, with two survivors recently back in Kenya, one currently in hospital. The government is also probing reports of Kenyans held as prisoners of war in Ukraine, alongside nationals from other countries, though Ukrainian officials said most African states show little interest in repatriating such citizens.\n\n/.outer-ad-container.adsense-outer-ad-container.adsense-responsive-outer-ad-container.responsive-aans-view-b-container\n\n**Guinea Remembers Conakry Stadium Massacre Victims**\n\nSixteen years after Guinea's [2009 stadium massacre](https://allafrica.com/stories/202509290033.html), in which security forces killed at least 156 people and subjected more than 100 women to sexual violence during an opposition rally, the struggle for justice and accountability continues under military rule. This year's anniversary came months after the government launched its first phase of reparations, with more than 300 survivors receiving state-funded compensation. Yet hopes of closure were shaken when former junta leader Moussa Dadis Camara, sentenced in 2024 to 20 years in prison for crimes against humanity, was pardoned in March by transitional leader Colonel Mamadi Doumbouya - a move condemned by victims and the UN. Human rights chief Volker Türk reminded Conakry that international law prohibits pardons for such crimes and urged authorities to free political detainees, end arbitrary arrests, and lift restrictions on opposition parties and the press. Tensions have deepened further after a controversial referendum on a new constitution, denounced by the opposition as a ploy to secure Doumbouya's path to the presidency, leaving civil society warning of shrinking freedoms amid ongoing repression.\n\n/.outer-ad-container.adsense-outer-ad-container.adsense-responsive-outer-ad-container.responsive-aans-view-c-container\n\n**MSF Suspends Operations in Mozambique Due to Surge in Cabo Delgado Violence**\n\nIn northern Mozambique, Médecins Sans Frontières (MSF) [suspended](https://allafrica.com/stories/202509290039.html) its medical activities due to an escalation of violence. In Cabo Delgado province, armed incursions have threatened, killed, and forced civilians to flee the town, since early September. The latest attacks, the most violent in years, displaced nearly 5,000 people and cut off communities from vital healthcare. MSF halted services at the district hospital, including emergency, maternity, mental health, and referral systems, while some patients were transferred to Pemba and Mueda. The organisation warned that insecurity is driving preventable deaths and suffering in a region where 430,000 people remain displaced and the health system is already under strain. MSF reiterated its call for all armed groups to protect civilians, medical facilities, and humanitarian workers, pledging to resume activities once staff safety can be guaranteed.\n\nClose\n\n#### Sign up for free AllAfrica Newsletters\n\nGet the latest in African news delivered straight to your inbox\n\nBy submitting above, you agree to our privacy policy.\n\n#### Success!\n\nAlmost finished...\n\nWe need to confirm your email address.\n\nTo complete the process, please follow the instructions in the email we just sent you.\n\n#### Error!\n\n#### Error!\n\nThere was a problem processing your submission. Please try again later.\n\n/.row\n\n**U.S. Lifts Visa Restrictions on Ghana After Deportation Deal**\n\nThe United States [lifted its visa restriction](https://allafrica.com/stories/202509290038.html)s on Ghana after the West African nation emerged as a key deportation hub in President Donald Trump's immigration crackdown. Ghana confirmed that it had begun accepting West Africans [deported](https://allafrica.com/view/group/main/main/id/00094194.html) by the U.S., becoming the fifth African country to do so. Officials in Accra insisted they [received nothing](https://allafrica.com/view/group/main/main/id/00094030.html) in return. Foreign Minister Samuel Okudzeto Ablakwa announced the reversal on the sidelines of the UN General Assembly, saying Ghanaians were once again eligible for five-year multiple-entry visas. Political analysts suggested the policy shift was tied to Ghana's agreement to take in third-country deportees, with at least 14 West Africans already transferred there since September. Rights groups have raised concerns after some deportees, despite winning protection from U.S. courts, were allegedly detained under harsh conditions in Ghana before being sent on to other countries, such as Togo. Ghana has said it is accepting West Africans on humanitarian grounds and that the deal is not an \"endorsement\" of U.S. immigration policy.\n\n/.story-body\n\n/#more-on-this-carousel\n\nTagged:\n\n- [Africa](https://allafrica.com/africa/) - [East Africa](https://allafrica.com/eastafrica/) - [Governance](https://allafrica.com/governance/) - [Southern Africa](https://allafrica.com/southernafrica/) - [West Africa](https://allafrica.com/westafrica/) - [Legal Affairs](https://allafrica.com/legalaffairs/) - [External Relations](https://allafrica.com/externalrelations/) - [Environment](https://allafrica.com/environment/) - [Conflict](https://allafrica.com/conflict/) - [Kenya](https://allafrica.com/kenya/) - [Health](https://allafrica.com/health/) - [International Organisations](https://allafrica.com/io/) - [Human Rights](https://allafrica.com/humanrights/) - [U.S., Canada and Africa](https://allafrica.com/usafrica/) - [Namibia](https://allafrica.com/namibia/) - [Ghana](https://allafrica.com/ghana/) - [Migration](https://allafrica.com/migration/) - [Mozambique](https://allafrica.com/mozambique/) - [Wildlife](https://allafrica.com/wildlife/) - [Guinea](https://allafrica.com/guinea/)\n\nAddToAny BEGIN\n\nAddToAny END\n\nCopyright © 2025 allAfrica.com. All rights reserved. Distributed by AllAfrica Global Media (allAfrica.com). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here.\n\n/.outer-ad-container.adsense-outer-ad-container.adsense-responsive-outer-ad-container.responsive-aans-view-end-container",
      "source": "News Source",
      "date": "2025-09-29T09:32:05.592Z"
    }
  ],
  "timestamp": 1759138325592
}